package com.islamey.hamza.wazaker.domain.DataSets

import com.islamey.hamza.wazaker.domain.Models.ZekerModel

object MorningAzkarDataset {

    private lateinit var morAzkar: MutableList<ZekerModel>

    val morningAzkar: List<ZekerModel>
        get() {
            morAzkar = ArrayList()
            morAzkar.add(
                ZekerModel(
                    """أَعُوذُ بِالله السَّمِيعِ العَلِيِمِ مِنَ الشّيطَانِ الرّجِيمِ (بِسْمِ اللهِ الرَّحْمـَنِ الرَّحِيمِ , الْحَمْدُ للهِ رَبِّ الْعَالَمِينَ , الرَّحْمـنِ الرَّحِيمِ , مَـلِكِ يَوْمِ الدِّينِ , إِيَّاكَ نَعْبُدُ وإِيَّاكَ نَسْتَعِينُ , اهدِنَــــا الصِّرَاطَ المُستَقِيمَ , صِرَاطَ الَّذِينَ أَنعَمتَ عَلَيهِمْ غَيرِ المَغضُوبِ عَلَيهِمْ وَلاَ الضَّالِّينَ)

 (الفاتحة)""", 1
                )
            )
            morAzkar.add(
                ZekerModel(
                    """(بِسْمِ اللّهِ الرَّحْمـنِ الرَّحِيمِ , الـم , ذَلِكَ الْكِتَابُ لاَ رَيْبَ فِيهِ هُدًى لِّلْمُتَّقِينَ , الَّذِينَ يُؤْمِنُونَ بِالْغَيْبِ وَيُقِيمُونَ الصَّلاةَ وَمِمَّا رَزَقْنَاهُمْ يُنفِقُونَ , والَّذِينَ يُؤْمِنُونَ بِمَا أُنزِلَ إِلَيْكَ وَمَا أُنزِلَ مِن قَبْلِكَ وَبِالآخِرَةِ هُمْ يُوقِنُونَ , أُوْلَـئِكَ عَلَى هُدًى مِّن رَّبِّهِمْ وَأُوْلَـئِكَ هُمُ الْمُفْلِحُونَ)

 (البقرة:1-5).""", 1
                )
            )
            morAzkar.add(
                ZekerModel(
                    """ بِسْمِ اللهِ الرَّحْمـَنِ الرَّحِيمِ
 {اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ}


 [آية الكرسي – البقرة 255]
من قالها حين يصبح أجير من الجن حتى يمسى 
ومن قالها حين يمسى أجير من الجن حتى
 يصبح""", 1
                )
            )
            morAzkar.add(
                ZekerModel(
                    """ ( آمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ ۚ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ. لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَّسِينَآ أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِين )

 [البقرة 285 – 286]

( مرة واحدة )""", 1
                )
            )
            morAzkar.add(
                ZekerModel(
                    """بسم الله الرحمن الرحيم

 قُلْ هُوَ اللَّهُ أَحَد(1)اللَّهُ الصَّمَدُ(2)لَمْ يَلِدْ وَلَمْ يُولَدْ (3) وَلَمْ يَكُن لَّهُ كُفُواً أَحَد(4)

( ثلاث مرات )
""", 3
                )
            )
            morAzkar.add(
                ZekerModel(
                    """بسم الله الرحمن الرحيم

قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ (1) مِن شَرِّ مَا خَلَقَ (2) وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ (3) وَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقَد (4) وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ(5)

 ( ثلاث مرات ) """, 3
                )
            )
            morAzkar.add(
                ZekerModel(
                    """
                بسم الله الرحمن الرحيم
                
                قُلْ أَعُوذُ بِرَبِّ النَّاسِ (1) مَلِكِ النَّاسِ (2) إِلَهِ النَّاسِ (3) مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ (4) الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ (5) مِنَ الْجِنَّةِ وَالنَّاسِ (6)
                
                ( ثلاث مرات )
                من قالها حين يصبح وحين يمسى كفته من كل شيء (الإخلاص والمعوذتين)
                
                
                """.trimIndent(), 3
                )
            )
            morAzkar.add(
                ZekerModel(
                    """
                أصبحنا وأصبح الملك لله ، والحمد لله لا شريك له ، لا إله إلا هو وإليه النشور 
                
                (ثلاثا)
                """.trimIndent(), 3
                )
            )
            morAzkar.add(
                ZekerModel(
                    """أَصْبَـحْـنا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ

 ( ثلاثا )""", 3
                )
            )
            morAzkar.add(
                ZekerModel(
                    """اللهم أني أصبحت منك في نعمة وعافية وستر , فأتم علي نعمتك وعافيتك وسترك في الدنيا والآخر
 (ثلاثا)""", 3
                )
            )
            morAzkar.add(
                ZekerModel(
                    """اللّهُـمَّ ما أَصْبَـَحَ بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر  
 (ثلاثا)

من قرأها حين يصبح فقد أدى شكر يومه ومن قرأها حين يمسي فقد ادى شكر ليلته - رواه ابو داوود

""", 3
                )
            )
            morAzkar.add(
                ZekerModel(
                    """
                اللّهُـمَّ إِنِّـي أَصْبَـحْتُ أُشْـهِدُك ، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلَائِكَتَكَ ، وَجَمـيعَ خَلْـقِك ، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك ، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك
                
                
                من قال حين يصبح او يمسي اربع مرات اعتقه الله من النار- رواه ابو داوود
                """.trimIndent(), 4
                )
            )
            morAzkar.add(
                ZekerModel(
                    """
                اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ، خَلَقْتَنـي وَأَنا عَبْـدُك، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت، أَعـوذُ بِكَ مِنْ شَـرِّ ما صَنَـعْت، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ 
                (ثلاثا)
                
                
                من قالها موقنا بها حين يمسى ومات من ليلته دخل الجنة وكذلك حين يصبح
                """.trimIndent(), 3
                )
            )
            morAzkar.add(
                ZekerModel(
                    """رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـا

 ( ثلاث مرات )

من قالها حين يصبح وحين يمسى كان حقا على الله أن يرضيه يوم القيامة""", 3
                )
            )
            morAzkar.add(
                ZekerModel(
                    """
                حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم
                
                ( سبع مرات )
                من قالها حين يصبح وحين يمسي سبع مرات كفاه الله ما اهمه من امر الدنيا والآخرة
                
                
                """.trimIndent(), 7
                )
            )
            morAzkar.add(
                ZekerModel(
                    """بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم 

 ( ثلاث مرات ) 

من قالها ثلاثا اذا اصبح وثلاثا اذا امسى لم يضره شيئ - رواه ابن ماجه""", 3
                )
            )
            morAzkar.add(
                ZekerModel(
                    """
                (اللهم إنا نعوذ بك من أن نشرك بك شيئا نعلمه ونستغفرك لما لا نعلمه) 
                
                (ثلاثا)
                """.trimIndent(), 3
                )
            )
            morAzkar.add(
                ZekerModel(
                    """
    ( أعوذ بكلمات الله التامات من شر ما خلق )
    ( ثلاثا )
    """.trimIndent(), 3
                )
            )
            morAzkar.add(
                ZekerModel(
                    """اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْهَمِّ وَالْحَزَنِ، وَأَعُوذُ بِكَ مِنْ الْعَجْزِ وَالْكَسَلِ، وَأَعُوذُ بِكَ مِنْ الْجُبْنِ وَالْبُخْلِ، وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ، وَقَهْرِ الرِّجَالِ
 (ثلاثا)
إذا قُلْتَهُ أَذْهَبَ اللهُ تعالى هَمَّكَ وقَضَى عنك دَيْنَكَ""", 3
                )
            )
            morAzkar.add(
                ZekerModel(
                    """سُبْحـانَ اللهِ وَبِحَمْـدِهِ عَدَدَ خَلْـقِه، وَرِضـا نَفْسِـه، وَزِنَـةَ عَـرْشِـه، وَمِـدادَ كَلِمـاتِـه

 ( ثلاث  مرات ) """, 3
                )
            )
            morAzkar.add(
                ZekerModel(
                    """
                اللّهُـمَّ عافِـني في بَدَنـي، اللّهُـمَّ عافِـني في سَمْـعي، اللّهُـمَّ عافِـني في بَصَـري 
                
                ( ثلاث  مرات ) 
                """.trimIndent(), 3
                )
            )
            morAzkar.add(
                ZekerModel(
                    """
                أسْتَغْفِرُ اللهَ العَظِيمَ الَّذِي لاَ إلَهَ إلاَّ هُوَ، الحَيُّ القَيُّومُ، وَأتُوبُ إلَيه
                
                ( ثلاث مرات )
                """.trimIndent(), 3
                )
            )
            morAzkar.add(
                ZekerModel(
                    """
                يَا رَبِّ، لَكَ الْحَمْدُ كَمَا يَنْبَغِي لِجَلَالِ وَجْهِكَ، وَلِعَظِيمِ سُلْطَانِكَ
                
                ( ثلاث مرات )
                """.trimIndent(), 3
                )
            )
            morAzkar.add(
                ZekerModel(
                    """لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءِ قَدِير

 ( 100 مرة )

كانت له عدل عشر رقاب، وكتبت له مئة حسنة، ومحيت عنه مئة سيئة، وكانت له حرزا من الشيطان""", 100
                )
            )
            morAzkar.add(
                ZekerModel(
                    """
                اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ على نَبِيِّنَا مُحمَّد
                
                ( عشر مرات )
                
                من صلى علي حين يصبح وحين يمسى أدركته شفاعتي يوم القيامة
                """.trimIndent(), 10
                )
            )
            morAzkar.add(
                ZekerModel(
                    """
                اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا طَيِّبًا، وَعَمَلًا مُتَقَبَّلًا
                
                ( ثلاث مرات )
                """.trimIndent(), 3
                )
            )
            morAzkar.add(
                ZekerModel(
                    """سُبْحـانَ اللهِ وَبِحَمْـدِه

 ( 100 مرة )

من قالها غُفِرَتْ له ذنوبُه ولو كانت مثلَ زبدِ البحرِ""", 100
                )
            )
            morAzkar.add(
                ZekerModel(
                    """اللهم صل على سيدنا محمد عبدك ورسولك النبي الأمي وعلى آله وصحبه وسلم تسليما عدد ما أحاط به علمك وخط به قلمك وأحصاه كتابك  وارض اللهم عن ساداتنا أبي بكر وعمر وعثمان وعلي  وعن الصحابة أجمعين  وعن التابعين وتابعيهم بإحسان إلى يوم الدين

 سبحان ربك رب العزة عما يصفون  وسلام على المرسلين  والحمد لله رب العالمين
""", 1
                )
            )
            return morAzkar
        }
}