package com.islamey.haamzaa.WAZAKER.data.DataSets;

import com.islamey.haamzaa.WAZAKER.data.Models.Hadith;

import java.util.ArrayList;
import java.util.List;

public class FortyDataSet {

    public static List<Hadith> fortyhadithList;

    public static List<Hadith> getFortyHadithList(int index) {

        if (index == 0) {

            fortyhadithList = new ArrayList<>();

            fortyhadithList.add(new Hadith(
                    "الأعمال بالنيات" + "\n" + "\n" +
                            "عَنْ أَمِيرِ المُؤمِنينَ أَبي حَفْصٍ عُمَرَ بْنِ الخَطَّابِ قَالَ : سَمِعْتُ رَسُولَ اللهِ ﷺ يَقُولُ : " + "\n" +
                            " \" إِنَّمَا الأَعْمَالُ بِالنِّيَّاتِ ، وَإنَّمَا لِكُلِّ امْرِىءٍ مَا نَوَى ،" +
                            " فَمَنْ كَانَتْ هِجْرَتُهُ إِلى اللهِ وَرَسُوله" +
                            " فَهِجْرتُهُ إلى اللهِ وَرَسُوُله ،" +
                            " وَمَنْ كَانَتْ هِجْرَتُهُ لِدُنْيَا يُصِيْبُهَا ، " +
                            "أَو امْرأَةٍ يَنْكِحُهَا ، فَهِجْرَتُهُ إِلى مَا هَاجَرَ إلَيْهِ \"" + "\n" + "\n" + "\n" + " رواه إماما المحدثين أبو عبدالله محمد بن إسماعيل بن إبراهيم بن المغيرة بن بَرْدِزْبَهْ البخاري ، وأبو الحسين مسلم بن الحجَّاج ين مسلم القشيري النيسابوري ، في صحيحيهما اللَذين هما أصح الكتب المصنفة "
            ));


            fortyhadithList.add(new Hadith("(سَمِعْتُ) دليل على أنه أخذه من النبي بلا واسطة ." + "\n" +
                    " (إِنَّمَا الأَعْمَالُ بِالنِّيَّاتِ) فيه من أوجه البلاغة الحصر ، وهو " +
                    ": إثبات الحكم في المذكور ونفيه عما سواه . " + "\n" +
                    "وطريق الحصر : (إِنَّمَا) لأن (إِنَّمَا) تفيد الحصر . ( وَإنَّمَا لِكُلِّ امْرِىءٍ مَا نَوَى)  " + "\n"
            ));

            fortyhadithList.add(new Hadith("(وَمَنْ كَانَتْ هِجْرَتُهُ لِدُنْيَا يُصِيْبُهَا ، أَو امْرأَةٍ يَنْكِحُهَا ، " +
                    "فَهِجْرَتُهُ إِلى مَا هَاجَرَ إلَيْهِ ) من البلاغة :" + "\n" +
                    " إخفاء نية من هاجر للدنيا ، لقوله :" +
                    " (فَهِجْرَتُهُ إِلى مَا هَاجَرَ إلَيْهِ)" +
                    "ولم يقل : إلى دنيا يصيبها ، والفائدة البلاغية في ذلك هي :" + "\n" +
                    " تحقير ما هاجر إليه هذا الرجل ، أي ليس أهلاً لأن يذكر ،" +
                    " بل يكنى عنه بقوله : (إِلى مَا هَاجَرَ إلَيْهِ) ." + "\n" +
                    " (فَمَنْ كَانَتْ هِجْرَتُهُ إِلى اللهِ وَرَسُوله) الجواب : " + "\n" +
                    "(فَهِجْرتُهُ إلى اللهِ وَرَسُوُله) فذكره تنويهاً بفضله."
            ));


        } else if (index == 1) {

            fortyhadithList = new ArrayList<>();

            fortyhadithList.add(new Hadith("مراتب الدين\n" + "\n" + "\n" +
                    "عَنْ عُمَرَ رَضِيَ اللهُ تَعَالَى عَنْهُ أقَال : بَيْنَمَا نَحْنُ جُلُوْسٌ عِنْدَ رَسُولِ اللهِ " +
                    "ذَاتَ يَوْمٍ إَذْ طَلَعَ عَلَيْناَ رَجُلٌ شَدِيْدُ بَيَاضِ الثّياب شَدِيْدُ سَوَادِ الشَّعْرِ" +
                    " لاَ يُرَى عَلَيهِ أَثَرُ السَّفَرِ وَلاَ يَعْرِفُهُ مِنا أحَدٌ حَتى جَلَسَ إلَى النبِي" +
                    " فَأَسْنَدَ رُكْبَتَيْهِ إلَى رُكْبَتَيْهِ وَوَضَعَ كَفيْهِ عَلَى فَخِذِيْهِ وَقَالَ :" +
                    " يَا مُحَمَّدُ أَخْبِرْنِي عَنِ الإِسْلاَم ، فَقَالَ رَسُولُ اللهِ ﷺ :" +
                    " \" الإِسْلاَمُ أَنْ تَشْهَدَ أَنْ لاَ إلَه إلاَّ اللهُ وَأَنَّ مُحَمَّدَاً رَسُولُ الله ،" +
                    " وَتُقِيْمَ الصَّلاَة ، وَتُؤْتِيَ الزَّكَاةَ ، وَتَصُوْمَ رَمَضَانَ ،" +
                    " وَتَحُجَّ البيْتَ إِنِ اِسْتَطَعتَ إِليْهِ سَبِيْلاً \"" +

                    "قَالَ: صَدَقْتَ." +
                    " فَعجِبْنَا لَهُ يَسْأَلُهُ وَيُصَدِّقُهُ،" +
                    " قَالَ: فَأَخْبِرِنيْ عَنِ الإِيْمَانِ، قَالَ: \" أَنْ تُؤمِنَ بِالله، وَمَلاِئكَتِه، وَكُتُبِهِ ، وَرُسُلِهِ ،" +
                    " وَالْيَومِ الآَخِر ، وَتُؤْمِنَ بِالقَدَرِ خَيْرِهِ وَشَرِّهِ \" قَالَ: صَدَقْتَ، قَالَ فَأخْبِرْنِيْ عَنِ الإِحْسَانِ" +
                    "، قَالَ: \" أَنْ تَعْبُدَ اللهَ كَأَنَكَ تَرَاهُ، فَإِنْ لمْ تَكُنْ تَرَاهُ فَإِنَّهُ يَرَاكَ \" " +
                    "قَالَ: فَأَخْبِرْنِي عَنِ السَّاعَةِ ، قَالَ : \" مَا الْمَسئُوُلُ عَنْهَا بِأَعْلَمَ مِنَ السَّائِلِ \" " +
                    "قَالَ : فَأخْبِرْنِيْ عَنْ أَمَارَاتِها ، قَالَ : \" أَنْ تَلِدَ الأَمَةُ رَبَّتَهَا" +
                    " ، وَأَنْ تَرى الحُفَاةَ العُرَاةَ العَالَةَ رِعَاءَ الشَّاءِ يَتَطَاوَلُوْنَ فِي البُنْيَانِ" +
                    " \" ثْمَّ انْطَلَقَ فَلَبِثتُ مَلِيَّاً ثُمَّ قَالَ : \" يَا عُمَرُ أَتَدْرِي مَنِ السَّائِلُ؟ " +
                    "\" قُلْتُ اللهُ وَرَسُوله أَعْلَمُ قَالَ : \" فَإِنَّهُ جِبْرِيْلُ أَتَاكُمْ يُعَلَّمُكُمْ دِيْنَكُمْ \" " +
                    "" + "\n" +
                    ".رواه مسلم"

            ));

            fortyhadithList.add(new Hadith("شرح الحديث الثاني" + "\n" +
                    "(بَيْنَمَا نَحْنُ جُلُوْسٌ) \"بَيْنَمَا \" هي \" بينا\" ولكن زيدت (مَا) فيها والأصل: بين نحن ، (مَا) زيدت للتوكيد . (جُلُوْسٌ) مبتدأ ، وخبره : (عِنْدَ رَسُولِ اللهِ) (ذَاتَ يَوْمٍ) ذات هنا تفيد النكرة، أي في يوم من الأيام ،وتستعمل في اللغة على وجوه متعددة: تارة تكون بمعنى النكرة الدالة على العموم : كما في جملة الحديث \" ذَاتَ يَوْمٍ \" وهذا أغلب ما تستعمل . (شَدِيْدُ بَيَاضِ الثّياب) أي عليه ثياب"
            ));

            fortyhadithList.add(new Hadith(
                    "(شَدِيْدُ سَوَادِ الشَّعْرِ) أي أنه شاب . ( لاَ يُرَى عَلَيهِ أَثَرُ السَّفَرِ) لأن ثيابه بيضاء وشعره أسود ليس فيه غبار ولا شعث السفر ، ولأن المسافر في ذلك الوقت يُرى عليه أثر السفر . (وَلاَ يَعْرِفُهُ مِنا أحَدٌ) أي وليس من أهل المدينة المعروفين ، فهو غريب . (حَتى جَلَسَ إلَى النبِي) ولم يقل عنده ليفيد الغاية ، أي أن جلوسه كان ملاصقاً للنبي ﷺ . "
            ));

            fortyhadithList.add(new Hadith("ولهذا قال : (فَأَسْنَدَ رُكْبَتَيْهِ إلَى رُكْبَتَيْهِ وَوَضَعَ كَفيْهِ )" +
                    " أي كفي هذا الرجل (عَلَى فَخِذِيْهِ) " +
                    "أي فخذي هذا الرجل ، " +
                    "وليس على فخذي النبي، وهذا من شدة الاحترام ." +
                    " (وَقَالَ : يَا مُحَمَّدُ) ولم يقل : يا رسول الله ليوهم أنه أعرابي ،" +
                    " لأن الأعراب ينادون النبي ﷺ باسمه العلم ،" +
                    " وأما أهل الحضر فينادونه بوصف النبوة أو الرسالة عليه الصلاة والسلام "
            ));

            fortyhadithList.add(new Hadith("(أَخْبِرْنِي عَنِ الإِسْلاَم) أي ما هو الإسلام ؟ أخبرني عنه . (الإِسْلاَمُ أَنْ تَشْهَدَ أَنْ لاَ إلَه إلاَّ اللهُ وَأَنَّ مُحَمَّدَاً رَسُولُ الله) تشهد أي تقر وتعترف بلسانك وقلبك ، فلا يكفي اللسان ، بل لا بد من اللسان والقلب قال الله تعالى :]إِلَّا مَن شَهِدَ بِالْحَقِّ وَهُمْ يَعْلَمُونَ[ (وَأَنَّ مُحَمَّدَاً رَسُولُ الله) أي وتشهد أن محمداً رسول الله"
            ));

            fortyhadithList.add(new Hadith("وقوله : (مُحَمَّدَاً) هو محمد بن عبدالله الهاشمي القرشي من ذرية إسماعيل ، وليس من ذرية إسماعيل رسول سواه . (رَسُولُ الله) رسول بمعنى مرسل ، والرسول هو من أوحى الله بشرع وأمر بتبليغه والعمل به . (وَتُقِيْمَ الصَّلاَة) أي تأتي بها قائمة تامة معتدلة . وكلمة : (الصَّلاَة) تشمل الفريضة والنافلة . (وَتُؤْتِيَ الزَّكَاةَ) تؤتي بمعنى تعطي ، والزكاة هي المال الواجب بذله لمستحقه من الأموال الزكوية تعبداً لله"
            ));

            fortyhadithList.add(new Hadith(" (وَتَصُوْمَ رَمَضَانَ) أي تمسك عن المفطرات تعبداً لله تعالى من طلوع الفجر إلى غروب الشمس . وأصل الصيام في اللغة : الإمساك . (وَتَحُجَّ البيْتَ) أي تقصد البيت لأداء النسك في وقت مخصوص تعبداً لله تعالى . (إِنِ اِسْتَطَعتَ إِليْهِ سَبِيْلاً) "
            ));

            fortyhadithList.add(new Hadith("قَالَ : ( فَأَخْبِرِنيْ عَنِ الإِيْمَانِ) قال : أي جبريل ، فأخبرني : أي يا محمد عن الإيمان ؟ والإيمان في اللغة : هو الإقرار بالقلب والاعتراف المستلزم للقبول والإذعان وهو مطابق للشرع . وأما قولهم : الإيمان في اللغة التصديق ففيه نظر . قَالَ : ( أَنْ تُؤمِنَ بِالله ، وَمَلاِئكَتِه ، وَكُتُبِهِ ، وَرُسُلِهِ ، وَالْيَومِ الآَخِر ، وَتُؤْمِنَ بِالقَدَرِ خَيْرِهِ وَشَرِّهِ )"
            ));

            fortyhadithList.add(new Hadith("ثم قال: ( فَأخْبِرْنِيْ عَنِ الإِحْسَانِ) الإحسان: مصدر أحسن يحسن، وهو بذل الخير والإحسان في حق الخالق، بأن تبني عبادتك على الإخلاص لله تعالى والمتابعة لرسول الله، وأما الإحسان للخلق، فهو بذل الخير لهم من مال أو جاه أو غير ذلك."
            ));

            fortyhadithList.add(new Hadith("(فَأَخْبِرْنِي عَنِ السَّاعَةِ)  والساعة هي : قيام الناس من قبورهم لرب العالمين ، يعني البعث ، وسميت ساعة لأنها داهية عظيمة ، قال الله تعالى :] يَا أَيُّهَا النَّاسُ اتَّقُوا رَبَّكُمْ إِنَّ زَلْزَلَةَ السَّاعَةِ شَيْءٌ عَظِيمٌ [ فقال النبي ﷺ : (مَا الْمَسئُوُلُ عَنْهَا) يعني نفسه (بِأَعْلَمَ مِنَ السَّائِلِ) يعني جبريل عليه السلام ، والمعنى إذا كنت تجهلها فأنا أجهلها ولا أستطيع أن أخبرك بها ، لأن علم الساعة مما اختص الله به."
            ));

            fortyhadithList.add(new Hadith("ومن علامات الساعة ما ذكره ﷺ في هذا الحديث بقوله : ( أَنْ تَلِدَ الأَمَةُ رَبَّتَهَا) وفي لفظ ( رَبَّهَا) والمعنى : (أَنْ تَلِدَ الأَمَةُ) أي الرقيقة المملوكة (رَبَّهَا) أي سيدها ، أو (رَبَّتَهَا ) . (وَأَنْ تَرى الحُفَاةَ العُرَاةَ العَالَةَ) الحفاة: يعني: ليس لهم نعال . والعراة : أي ليس لهم ثياب تكسوهم وتكفيهم  ، عالة أي فقراء" + "\n" +
                    "، ( يَتَطَاوَلُوْنَ فِي البُنْيَانِ) أي يكونون أغنياء حتى يتطاولون في البنيان أيهم أطول "
            ));

            fortyhadithList.add(new Hadith(" فقال النبي ﷺ : (فَإِنَّهُ جِبْرِيْلُ) الإشارة هنا إلى شيء معلوم بالذهن ، أي هذا جبريل؟ (أَتَاكُمْ يُعَلَّمُكُمْ دِيْنَكُمْ) لكنه جاء بهذه الصيغة أي صيغة السؤال والجواب لأنه أمكن في النفس وأقوى في التأثير."
            ));


        } else if (index == 2) {
            fortyhadithList = new ArrayList<>();

            fortyhadithList.add(new Hadith("أركان الإسلام" + "\n" +
                    "عَنْ أَبِيْ عَبْدِ الرَّحْمَنِ عَبْدِ اللهِ بْنِ عُمَرَ بْن الخَطَّابِ رَضِيَ اللهُ عَنْهُمَا قَالَ: سَمِعْتُ النبي ﷺ يَقُوْلُ: \" بُنِيَ الإِسْلامُ عَلَى خَمْسٍ: شَهَادَةِ أَنْ لاَ إِلَهَ إِلاَّ الله وَأَنَّ مُحَمَّدَاً رَسُوْلُ اللهِ، وَإِقَامِ الصَّلاةِ، وَإِيْتَاءِ الزَّكَاةِ، وَحَجِّ البِيْتِ، وَصَوْمِ رَمَضَانَ \""
            ));

            fortyhadithList.add(new Hadith("شرح الحديث الثالث" + "\n" +
                    "يَقُوْلُ ﷺ : \" بُنِيَ الإِسْلامُ \" الذي بناه هو الله عزّ وجل، وأبهم الفاعل للعلم به، كما أُبهم الفاعل في قوله تعالى: {وَخُلِقَ الْإِنْسَانُ ضَعِيفاً } فلم يبين من الخالق، لكنه معلوم، فما عُلم شرعاً أو قدراً جاز أن يبنى فعله لما لم يسم فاعله. \" عَلَى خَمْسٍ \" أي على خمسِ دعائم. \" شَهَادَة أنْ لا إِلَهَ إِلاَّ الله وَأَنَّ مُحَمَّدَاً رَسُوْلُ اللهِ \" الشهادتان: نطق باللسان، واعتقاد بالجنان. \" وَإِقَامِ الصّلاةِ، وَإِيْتَاءِ الزَّكَاةِ، وَحَجِّ البّيْتِ، وَصَوْمِ رَمَضَان \""
            ));

            fortyhadithList.add(new Hadith("إقام الصلاة: عمل بدني يشتمل على قول وفعل، وما قد يجب من المال لإكمال الصلاة فإنه لا يعد منها، وهو خارج عن العبادة، ولذلك نقول: إن الصلاة عبادة بدنية محضة. إيتاء الزكاة: عبادة مالية لا بدنية، وكون الغني يجب أن يوصلها للفقير، وربما يمشي وربما يستأجر سيارة، هذا أمر خارج عن العبادة"
            ));

            fortyhadithList.add(new Hadith("حج البيت :أي: الكعبة، وهو واجب على المسلم العاقل البالغ الحر المستطيع، والصحيح من أقوال العلماء أنه واجب على الفور، والله أعلم. صوم رمضان: عبادة بدنية لكن من نوع آخر، الصلاة بدنية لكنها فعل، والصيام بدني لكنه كف وترك، لأنه قد يسهل على الإنسان أن يفعل ويصعب عليه أن يكف، وقد يسهل عليه الكف ويصعب عليه الفعل، فنوعت العبادات ليكمل بذلك الامتحان، فسبحان الله العظيم."
            ));


        } else if (index == 3) {

            fortyhadithList = new ArrayList<>();

            fortyhadithList.add(new Hadith("الحديث الرابع" + "\n" +

                    "عَنْ عَبْدِ اللهِ بنِ مَسْعُوْدْ رَضِيَ اللهُ عَنْهُ قَالَ: حَدَّثَنَا رَسُوْلُ اللهِ ﷺ وَهُوَ الصَّادِقُ المَصْدُوْقُ : \" إِنَّ أَحَدَكُمْ يُجْمَعُ خَلْقُهُ فِيْ بَطْنِ أُمِّهِ أَرْبَعِيْنَ يَوْمَاً نُطْفَةً، ثُمَّ يَكُوْنُ عَلَقَةً مِثْلَ ذَلِكَ،ثُمَّ يَكُوْنُ مُضْغَةً مِثْلَ ذَلِكَ،ثُمَّ يُرْسَلُ إِلَيْهِ المَلَكُ فَيَنفُخُ فِيْهِ الرٌّوْحَ،وَيَؤْمَرُ بِأَرْبَعِ كَلِمَاتٍ: بِكَتْبِ رِزْقِهِ وَأَجَلِهِ وَعَمَلِهِ وَشَقِيٌّ أَوْ سَعِيْدٌ. فَوَالله الَّذِي لاَ إِلَهَ غَيْرُهُ إِنََّ أَحَدَكُمْ لَيَعْمَلُ بِعَمَلِ أَهْلِ الجَنَّةِ حَتَّى مَا يَكُوْنُ بَيْنَهُ وَبَيْنَهَا إلاذِرَاعٌ فَيَسْبِقُ عَلَيْهِ الكِتَابُ فَيَعْمَلُ بِعَمَلِ أَهْلِ النَّارِ فَيَدْخُلُهَا، وَإِنَّ أَحَدَكُمْ لَيَعْمَلُ بِعَمَلِ أَهْلِ النَّارِ حَتَّى مَايَكُونُ بَيْنَهُ وَبَيْنَهَا إلا ذِرَاعٌ فَيَسْبِقُ عَلَيْهِ الكِتَابُ فَيَعْمَلُ بِعَمَلِ أَهْلِ الجَنَّةِ فَيَدْخُلُهَا \" " + "\n" + "\n" +
                    "رواه البخاري ومسلم."
            ));

            fortyhadithList.add(new Hadith("شرح الحديث الرابع" + "\n" +
                    "قال: (إِنَّ أَحَدَكُمْ يُجْمَعُ خَلْقُهُ فِيْ بَطْنِ أُمِّهِ ) وذلك أن الإنسان إذا أتى أهله فهذا الماء المتفرق يجمع وكيفية الجمع لم يذكر في الحديث، وقيل: إن الطبّ توصّل إلى معرفة بعض الشيء عن تكون الأجنة والله أعلم أَرْبَعِيْنَ يَوْمَاً نُطْفَة أي قطرة من المني. ثُمَّ يَكُوْنُ عَلَقَةً مِثْلَ ذَلِكَ) والعلقة هي: قطعة الدم الغليظ، وهي دودة معروفة ترى في المياه الراكدة."
            ));

            fortyhadithList.add(new Hadith("(ثُمَّ يَكُونُ مُضْغَةً مِثْلَ ذَلِك) أي أربعين يوماً، والمضغة: هي قطعة لحم بقدر ما يمضغه الإنسان. (ثُمَّ يُرْسَلُ إِلَيْهِ المَلَكُ) والمرسِل هو الله رب العالمين عزّ وجل، فيرسل الملك إلى هذا الجنين وهو واحد الملائكة والمراد به الجنس لا ملك معين.  فَيَنْفُخُ فِيْهِ الرُّوْح الروح ما به يحيا الجسم، وكيفية النفخ الله أعلم بها، ولكنه ينفخ في هذا الجنين الروح ويتقبلها الجسم"
            ));

            fortyhadithList.add(new Hadith("(وَيُؤْمَرُ) أي الملك (بِأَرْبَعِ كَلِمَاتٍ) والآمر هو الله عزّ وجل بِكْتبِ (رِزْقِهِ، وَأَجَلِهِ، وَعَمَلِهِ، وَشَقِيٌّ أَوْ سَعِيْدٌ) . ) رِزْقه) الرزق هنا: ما ينتفع به الإنسان وهو نوعان: رزق يقوم به البدن، ورزق يقوم به الدين. (وَأَجَله) أي مدة بقائه في هذه الدنيا. (وَعَمَله) أي ما يكتسبه من الأعمال القولية والفعلية والقلبية. (وَشَقِيٌّ أَوْ سَعِيْدٌ) هذه النهاية"
            ));

            fortyhadithList.add(new Hadith("والسعيد هو الذي تم له الفرح والسرور، والشقي بالعكس. (فَوَاللهِ الَّذِيْ لاَ إِلَهَ غَيْرُهُ) هذا قسم مؤكد بالتوحيد، القسم: (فَوَاللهِ) والتوكيد بالتوحيد: (الَّذِيْ لاَ إِلَهَ غَيْرُهُ) أي لا إله حق غير الله. (إِنََّ أَحَدَكُمْ لَيَعْمَلُ بِعَمَلِ أَهْلِ الجَنَّةِ) ؛ أي: بأن يأتي بالطاعات ويترك المنهيات (حَتَّى مَا يَكُوْنُ) ؛ أي: لا يوجد (بَيْنَهُ وَبَيْنَهَا) ؛ أي: الجنة (إلاذِرَاعٌ) ، وهي كناية عن شدة القرب، (فَيَسْبِقُ) ؛ أي: يغلِب (عَلَيْهِ الكِتَابُ) الذي كتب له في بطن أمه"
            ));

            fortyhadithList.add(new Hadith("(فَيَعْمَلُ بِعَمَلِ أَهْلِ النَّارِ) من المعاصي، كفرًا كانت أو كبيرة، بإرادته واختياره، (فَيَدْخُلُهَا) ؛ أي: النار يوم القيامة، (وَإِنَّ أَحَدَكُمْ لَيَعْمَلُ بِعَمَلِ أَهْلِ النَّارِ حَتَّى مَايَكُونُ بَيْنَهُ وَبَيْنَهَا إلا ذِرَاعٌ فَيَسْبِقُ عَلَيْهِ الكِتَابُ فَيَعْمَلُ بِعَمَلِ أَهْلِ الجَنَّةِ فَيَدْخُلُهَا) بأن يتوب من ذنبه، إما بالإسلام إن كان كافرًا، وإما بالإقلاع والندامة ورد المظالم إن كان مسلمًا."
            ));


        } else if (index == 4) {

            fortyhadithList = new ArrayList<>();


            fortyhadithList.add(new Hadith("النهي عن الابتداع في الدين" + "\n" + "\n" +

                    "عَنْ أُمِّ المُؤمِنِينَ أُمِّ عَبْدِ اللهِ عَائِشَةَ - رَضِيَ اللهُ عَنْهَا - قَالَتْ:" + "\n" + "\n" +
                    " قَالَ رَسُوْلُ اللهِ : \" مَنْ أَحْدَثَ فِيْ أَمْرِنَا هَذَا مَا لَيْسَ مِنْهُ فَهُوَ رَدٌّ \" رواه البخاري ومسلم، وفي رواية لمسلم \" مَنْ عَمِلَ عَمَلاً لَيْسَ عَلَيْهِ أَمْرُنَا فَهُوَ رَدٌّ \""
            ));

            fortyhadithList.add(new Hadith(
                    "شرح الحديث الخامس" + "\n" +

                            "وفي روايةٍ لمسلم: (مَنْ عَمِلَ عَمَلاً لَيْسَ عَلِيْهِ أَمْرُنَا فَهوَ رَدّ ٌ) وهذه الرواية أعم من رواية (مَنْ أَحْدَثَ) ومعنى هذه الرواية: أن من عمل أي عمل سواء كان عبادة، أو كان معاملة، أو غير ذلك ليس عليه أمر الله ورسوله فإنه مردود عليه. وهذا الحديث أصل من أصول الإسلام، دل عليه قوله تعالى: (وَأَنَّ هَذَا صِرَاطِي مُسْتَقِيماً فَاتَّبِعُوهُ وَلا تَتَّبِعُوا السُّبُلَ فَتَفَرَّقَ بِكُمْ عَنْ سَبِيلِهِ) وكذلك الآيات التي سقناها دالة على هذا الأصل العظيم."
            ));

        } else if (index == 5) {
            fortyhadithList = new ArrayList<>();


            fortyhadithList.add(new Hadith("عَنْ أَبِيْ عَبْدِ اللهِ النُّعْمَانِ بْنِ بِشِيْر رضي الله عنهما قَالَ: سَمِعْتُ رَسُوْلَ اللهِ ﷺ يَقُوْلُ: " + "\n" + "\n" +
                    "(إِنَّ الحَلالَ بَيِّنٌ وَإِنَّ الحَرَامَ بَيِّنٌ وَبَيْنَهُمَا أُمُوْرٌ مُشْتَبِهَات لاَ يَعْلَمُهُنَّ كَثِيْرٌ مِنَ النَّاس،ِ فَمَنِ اتَّقَى الشُّبُهَاتِ فَقَدِ اسْتَبْرأَ لِدِيْنِهِ وعِرْضِه، وَمَنْ وَقَعَ فِي الشُّبُهَاتِ وَقَعَ فِي الحَرَامِ كَالرَّاعِي يَرْعَى حَوْلَ الحِمَى يُوشِكُ أَنْ يَقَعَ فِيْهِ. أَلا وَإِنَّ لِكُلِّ مَلِكٍ حِمَىً . أَلا وَإِنَّ حِمَى اللهِ مَحَارِمُهُ، أَلا وإِنَّ فِي الجَسَدِ مُضْغَةً إِذَا صَلَحَتْ صَلَحَ الجَسَدُ كُلُّهُ وإذَا فَسَدَت فَسَدَ الجَسَدُ كُلُّهُ أَلا وَهيَ القَلْبُ)" + "\n" + "\n" +
                    " رواه البخاري ومسلم ."
            ));

            fortyhadithList.add(new Hadith("(إن الحلال بيـنٌ) ؛ أي: واضح لا يخفى حله، (وإن الحرام بيـنٌ) ؛ أي: ظاهر غير خفي، (وبينهما) ؛ أي: بين الحلال والحرام الواضحين (أمورٌ مشتبهاتٌ) ؛ أي: غير واضحات الحِل والحرمة، والمراد أنها تشتبه على بعض الناس دون بعض، قال النووي رحمه الله: الأشياء ثلاثة أقسام: حلال بيِّن واضح لا يخفى حله، كالخبز والفواكه والزيت والعسل، وحرام بيِّن، كالخمر والخنزير والميتة والبول والدم المسفوح"
            ));


            fortyhadithList.add(new Hadith(
                    "والمشتبهات غير الواضحة الحل والحرمة؛ فلهذا قال: (لا يعلمهن) ؛ أي: لا يعلم حكمها (كثيرٌ من الناس) ، وأما العلماء فيعرفون حكمها بنص أو قياس أو استصحاب أو غير ذلك. (فمن اتقى الشبهات) ؛ أي: تحرز عنها وتركها (فقد استبرأ) ؛ أي: حصل البراءة (لدِينه) مما يَشينه من النقص (وعِرضه) من الطعن فيه. (وَمَنْ وَقَعَ فِي الشُّبُهَاتِ وَقَعَ فَي الحَرَامِ) (ومن وقع في الشبهات) بأن لم يترك فعلها"

            ));

            fortyhadithList.add(new Hadith("(وقع في الحرام) المحض، أو قارَبَ أن يقع فيه، (كالراعي) ؛ أي: حاله كحال الراعي الذي يحفظ الحيوان، (يرعى) مواشيه (حول) ؛ أي: جانب (الحِمَى) المحظور على غير مالكه، (يوشك) يسرع، (أن يقع فيه) أي: تدخله الماشية وتأكل منه. (ألا) هي للتنبيه على أن ما بعدها أمر ينبغي التنبه له. (ألا وإن في الجسد مضغةً) سميت بذلك لأنها قدر ما يمضغ"
            ));

            fortyhadithList.add(new Hadith("(إذا صلَحت) بالإيمان والعلم، (صلَح الجسد كله) ؛ أي: بالإخلاص في الأعمال، (وإذا فسدت فسد الجسد كله) ؛ أي: بالجحود والكفر والعصيان (ألا وهي القلب) ؛ فإنه محل النية التي بها صلاحُ الأعمال وفسادها، وأيضًا هو الأمير والملك بالنسبة إلى تمام الجسد، والرعيَّةُ تابعة للملك."
            ));


        } else if (index == 6) {

            fortyhadithList = new ArrayList<>();


            fortyhadithList.add(new Hadith(
                    "الدين النصيحة" + "\n" + "\n"
                            + "عَنْ أَبِيْ رُقَيَّةَ تَمِيْم بْنِ أَوْسٍ الدَّارِيِّ رضي الله عنه أَنَّ النبي ﷺ قَالَ:( الدِّيْنُ النَّصِيْحَةُ قُلْنَا: لِمَنْ يَا رَسُولَ اللهِ ؟ قَالَ: للهِ، ولكتابه، ولِرَسُوْلِهِ، وَلأَئِمَّةِ المُسْلِمِيْنَ، وَعَامَّتِهِمْ " + "\n" + "\n" +
                            "(رواه مسلم)"));

            fortyhadithList.add(new Hadith("النصيحة لله تتضمن أمرين: الأول:إخلاص العبادة له. الثاني: الشهادة له بالوحدانية في ربوبيته وألوهيته، وأسمائه وصفاته. النصيحة لكتابه تتضمن أموراً منها: " + "\n" +
                    "الأول: الذبّ عنه، بأن يذب الإنسان عنه تحريف المبطلين، ويبيّن بطلان تحريف من حرّف. الثاني: تصديق خبره تصديقاً جازماً لا مرية فيه، فلو كذب خبراً من أخبار الكتاب لم يكن ناصحاً، "
            ));

            fortyhadithList.add(new Hadith("ومن شك فيه وتردد لم يكن ناصحاً. النصيحة للعلماء تكون بأمورٍ منها: الأول: محبتهم، لأنك إذا لم تحب أحداً فإنك لن تتأسّى به. الثاني: معونتهم ومساعدتهم في بيان الحق، فتنشر كتبهم بالوسائل الإعلامية المتنوعة التي تختلف في كل زمان"
            ));


        } else if (index == 7) {

            fortyhadithList = new ArrayList<>();

            fortyhadithList.add(new Hadith(
                    "عَنِ ابْنِ عُمَرَ رَضِيَ اللهُ عَنْهُمَا أَنَّ رَسُوْلَ اللهِ قَالَ: (أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَشْهَدُوا أَنْ لاَ إِلَهَ إِلاَّ اللهُ وَأَنَّ مُحَمَّدَاً رَسُوْلُ اللهِ وَيُقِيْمُوْا الصَّلاةَ وَيُؤْتُوا الزَّكَاةَ فَإِذَا فَعَلُوا ذَلِكَ عَصَمُوا مِنِّي دِمَاءهَمْ " +
                            "وَأَمْوَالَهُمْ إِلاَّ بِحَقِّ الإِسْلامِ وَحِسَابُهُمْ عَلَى اللهِ تَعَالَى) " + "\n" + "\n" + "\n" +
                            "رواه البخاري ومسلم"));


        } else if (index == 8) {

            fortyhadithList = new ArrayList<>();

            fortyhadithList.add(new Hadith(
                    "النهي عن كثرة السؤال والتشدد" + "\n" + "\n" +
                            "عَنْ أَبِي هُرَيْرَةَ عَبْدِ الرَّحْمَنِ بْنِ صَخْرٍ رَضِيَ الله تَعَالَى عَنْهُ قَالَ: سَمِعْتُ رَسُوْلَ اللهِ ﷺ يَقُوْلُ: (مَا نَهَيْتُكُمْ عَنْهُ فَاجْتَنِبُوهُ وَمَا أَمَرْتُكُمْ بِهِ فأْتُوا مِنْهُ مَا اسْتَطَعْتُمْ؛ فَإِنَّمَا أَهْلَكَ الَّذِيْنَ مِنْ قَبْلِكُمْ كَثْرَةُ مَسَائِلِهِمْ" +
                            " وَاخْتِلافُهُمْ عَلَى أَنْبِيَائِهِمْ) " + "\n" +
                            "رواه البخاري ومسلم"
            ));

            fortyhadithList.add(new Hadith("قوله: (مَا نَهَيْتُكُمْ عَنْهُ فَاجْتَنِبُوهُ) النهي: طلب الكفّ على وجه الاستعلاء، يعني أن يطلب منك من هو فوقك - ولو باعتقاده - أن تكفّ، فهذا نهي. ولهذا قال أهل أصول الفقه: النهي طلب الكفّ على وجه الاستعلاء ولو حسب دعوى الناهي، يعني وإن لم يكن عالياً على المنهي"
            ));


            fortyhadithList.add(new Hadith("(الَّذِيْنَ مِنْ قَبْلِكُمْ ) يشمل اليهود والنصارى وغيرهم، والمتبادر أنهم اليهود والنصارى، ، فإن نظرنا إلى العموم قلنا المراد بقوله: مِنْ قَبْلِكُمْ جميع الأمم، وإن نظرنا إلى قرينة الحال قلنا المراد بهم: اليهود والنصارى . واليهود أشدّ في كثرة المساءلة التي يهلكون بها،"
            ));


            fortyhadithList.add(new Hadith("وقوله: ( كَثْرَةُ مَسَائِلِهِمْ) جمع مسألة وهي: ما يُسأل عنه. ) وَاخْتِلافُهُمْ عَلَى أَنْبِيَائِهِمْ) يعني وأهلكهم اختلافهم. وقوله: (عَلَى أَنْبِيَائِهِمْ) وذلك بالمعارضة والمخالفة، وفي الحديث قال: ( اختلافهم على أنبيائهم ) ولم يقل:عن أنبيائهم، لأن كلمة (على) تفيد أن هناك معارضة للأنبياء."
            ));


        } else if (index == 9) {

            fortyhadithList = new ArrayList<>();

            fortyhadithList.add(new Hadith("سبب إجابة الدعاء" + "\n" + "\n" +
                    "عَنْ أَبِيْ هُرَيْرَةَ رَضِيَ اللهُ تَعَالَى عَنْهُ قَالَ: قَالَ رَسُوْلُ اللهِ :" + "\n" + "\n" +
                    " (إِنَّ اللهَ تَعَالَى طَيِّبٌ لاَ يَقْبَلُ إِلاَّ طَيِّبَاً وَإِنَّ اللهَ أَمَرَ المُؤْمِنِيْنَ بِمَا أَمَرَ بِهِ المُرْسَلِيْنَ فَقَالَ : (يَا أَيُّهَا الرُّسُلُ كُلُوا مِنَ الطَّيِّبَاتِ وَاعْمَلُوا صَالِحاً) (المؤمنون: الآية51) ، وَقَالَ: (يَا أَيُّهَا الَّذِينَ آمَنُوا كُلُوا مِنْ طَيِّبَاتِ مَا رَزَقْنَاكُمْ ) (البقرة: الآية172) ثُمَّ ذَكَرَ الرَّجُلَ يُطِيْلُ السَّفَرَ أَشْعَثَ أَغْبَرَ، يَمُدُّ يَدَيْهِ إِلَى السَّمَاء،ِ يَا رَبِّ يَا رَبِّ، وَمَطْعَمُهُ حَرَامٌ ،وَمَشْرَبُهُ حَرَامٌ، وَغُذِيَ بِالحَرَام" +
                    "ِ فَأَنَّى يُسْتَجَابُ لذلك) " + "\n" +
                    "رواه مسلم."));

        } else if (index == 10) {

            fortyhadithList = new ArrayList<>();

            fortyhadithList.add(new Hadith(
                    "اترك ما شككت فيه" + "\n" +

                            "عَنْ أَبِي مُحَمَّدٍ الحَسَنِ بنِ عَلِيّ بنِ أبِي طالبٍ سِبْطِ رَسُولِ اللهِ ﷺ وَرَيْحَانَتِهِ رَضِيَ اللهُ عَنْهُمَا قَالَ: حَفِظْتَ مِنْ رَسُوْلِ اللهِ ﷺ : (دَعْ مَا يَرِيْبُكَ إِلَى مَا لاَ يَرِيْبُكَ)" + "\n" +
                            " رواه الترمذي والنسائي وقال الترمذي: حديث حسن صحيح."));

            fortyhadithList.add(new Hadith("وقوله: \"دَعْ\" أي اترك \"مَا يرِيْبُكَ\" أي ما يلحقك به ريب وشك وقلق إِلَى \"مَا لاَ يَرِيْبُكَ\" أي إلى شيءٍ لا يلحقك به ريبٌ ولا قلق. وهذا الحديث من جوامع الكلم وما أجوده وأنفعه للعبد إذا سار عليه، فالعبد يرد عليه شكوك في أشياء كثيرة،فنقول: دع الشك إلى ما لاشكّ فيه حتى تستريح وتسلم"
            ));

        } else if (index == 11) {

            fortyhadithList = new ArrayList<>();

            fortyhadithList.add(new Hadith("الاشتغال بما يفيد" + "\n" +
                    "عَنْ أَبِيْ هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ قَالَ: قَالَ رَسُوْلُ اللهِ ﷺ : (مِنْ حُسْنِ إِسْلامِ المَرْءِ تَرْكُهُ مَا لاَ يَعْنِيْهِ)" + "\n" + "\n" +
                    " حديثٌ حسنٌ، رواه الترمذي وغيره هكذا."));


        } else if (index == 12) {

            fortyhadithList = new ArrayList<>();

            fortyhadithList.add(new Hadith("من كمال الإيمان" + "\n" +
                    "عَنْ أَبِيْ حَمْزَة أَنَسِ بنِ مَالِكٍ رَضِيَ اللهُ تَعَالَى عَنْهُ خَادِمِ رَسُوْلِ اللهِ ﷺ عَن النبي ﷺ قَالَ: (لاَ يُؤمِنُ أَحَدُكُمْ حَتَّى يُحِبَّ لأَخِيْهِ مَا يُحِبُّ لِنَفْسِهِ)" + "\n" + "\n" +
                    " رواه البخاري ومسلم"));


        } else if (index == 13) {

            fortyhadithList = new ArrayList<>();

            fortyhadithList.add(new Hadith("متى يهدر دم المسلم؟" + "\n" + "\n" +

                    "َعنِ ابْنِ مَسْعُودٍ رضي الله عنه قَالَ: قَالَ رَسُولُ اللهِ : (لا يَحِلُّ دَمُ امْرِئٍ مُسْلِمٍ إِلاَّ بإِحْدَى ثَلاثٍ: الثَّيِّبُ الزَّانِيْ، وَالنَّفْسُ بِالنَّفْسِ، وَالتَّاركُ لِدِيْنِهِ المُفَارِقُ للجمَاعَةِ) " + "\n" + "\n" +
                    "رواه البخاري ومسلم."
            ));

            fortyhadithList.add(new Hadith("وقوله: (امرِئٍ مُسْلِمٍ) التعبير بذلك لا يعني أن المرأة يحل دمها، ولكن التعبير بالمذكر في القرآن والسنة أكثر من التعبير بالمؤنث، لأن الرجال هم الذين تتوجه إليهم الخطابات وهم المعنيّون بأنفسهم وبالنساء. وقوله: (مُسْلِمٍ) أي داخل في الإسلام."
            ));

            fortyhadithList.add(new Hadith("(الثَّيِّبُ الزَّانِي) فالثيب الزاني يحلّ دمه، والثيب هو : الذي جامع في نكاح صحيح، فإذا زنا بعد أن أنعم الله عليه بنعمة النكاح الصحيح صار مستحقاً للقتل، ولكن صفة قتله سنذكرها إن شاء الله تعالى في الفوائد. ومفهوم قوله (الثَّيِّبُ) أن البكر لا يحل دمه إذا زنا، وهو الذي لم يجامع في نكاح صحيح"
            ));

            fortyhadithList.add(new Hadith("(وَالنَّفْسُ بِالنَّفْسِ) المقصود به القصاص، أي أنه إذا قتل إنسانٌ إنساناً عمداً قُتِلَ به بالشروط المعروفة. (وَالتَّارِكُ لِدِينِهِ) يعني بذلك المرتدّ بأي نوع من أنواع الرّدة. وقوله: (المُفَارِقُ للجَمَاعَةِ) هذا عطف بيان، يعني أن التارك لدينه مفارق للجماعة خارج عنها."
            ));


        } else if (index == 14) {

            fortyhadithList = new ArrayList<>();

            fortyhadithList.add(new Hadith("اكرام الضيف" + "\n" + "\n" +


                    "عَن أَبِي هُرَيْرَةَ رضي الله عنه أَنَّ رَسُولَ اللهِ ﷺ قَالَ: (مَنْ كَانَ يُؤمِنُ بِاللهِ وَاليَوْمِ الآخِرِ فَلْيَقُلْ خَيْرَاً أَو لِيَصْمُتْ، وَمَنْ كَانَ يُؤمِنُ بِاللهِ" +
                    " وَاليَومِ الآخِرِ فَلْيُكْرِمْ جَارَهُ، ومَنْ كَانَ يُؤمِنُ بِاللهِ واليَومِ الآخِرِ فَلْيُكْرِمْ ضَيْفَهُ) " + "\n" + "\n" +
                    "رواه البخاري ومسلم."));


        } else if (index == 15) {

            fortyhadithList = new ArrayList<>();

            fortyhadithList.add(new Hadith("النهي عن الغضب" + "\n" + "\n" +
                    "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ أَنَّ رَجُلاً قَالَ لِلنَّبيِّ ﷺ : أَوصِنِيْ، قَال : (لاَ تَغْضَبْ) . رواه البخاري" + "\n" +

                    "قَالَ: (لا َتَغْضَبْ) الغضب: بيَّن النبي ﷺ أنه جمرة يلقيها الشيطان في قلب ابن آدم فيغلي القلب، ولذلك يحمرّ وجهه وتنتفخ أوداجه وربما يقف شعره."
            ));

        } else if (index == 16) {

            fortyhadithList = new ArrayList<>();

            fortyhadithList.add(new Hadith("الرفق بالحيوان" + "\n" + "\n" +
                    "عَنْ أَبِي يَعْلَى شَدَّادِ بنِ أَوْسٍ رَضِيَ اللهُ تَعَالَى عَنْهُ عَنْ رَسُولِ اللهِ ﷺ قَالَ: (إِنَّ اللهَ كَتَبَ الإِحْسَانَ عَلَى كُلِّ شَيءٍ. فَإِذَا قَتَلْتُمْ فَأَحْسِنُوا القِتْلَةَ، وَإِذَا ذَبَحْتُمْ فَأَحْسِنُوا الذِّبْحَةَ، وَلْيُحِدَّ أَحَدُكُمْ شَفْرَتَهُ، وَلْيُرِحْ ذَبِيْحَتَهُ) " + "\n" +
                    "رواه مسلم"));

            fortyhadithList.add(new Hadith("(وَليُحدّ أحدكم شَفْرَته) أي السكين، وحدُّها يعني حكها حتى تكون قوية القطع، أي يحكها بالمبرد أو بالحجر أو بغيرهما حتى تكون حادة يحصل بها الذبح بسرعة. (وَلْيُرِحْ ذَبِيْحَتَهُ) اللام للأمر، أي وليرح ذبيحته عند الذبح بحيث يمر السكين بقوة وسرعة"
            ));

        } else if (index == 17) {

            fortyhadithList = new ArrayList<>();

            fortyhadithList.add(new Hadith("الخلق الحسن" + "\n" + "\n" +
                    "عَنْ أَبِيْ ذَرٍّ جُنْدُبِ بنِ جُنَادَةَ وَأَبِي عَبْدِ الرَّحْمَنِ مُعَاذِ بِنِ جَبَلٍ رَضِيَ اللهُ عَنْهُمَا عَنْ رَسُولِ اللهِ ﷺ قَالَ: (اتَّقِ اللهَ حَيْثُمَا كُنْتَ، وَأَتْبِعِ السَّيِّئَةَ الحَسَنَةَ تَمْحُهَا، وَخَالِقِ النَّاسَ بِخُلُقٍ حَسَنٍ )" + "\n" +
                    " رواه الترمذي وقال: حديث حسن. وفي بعض النسخ: حسنٌ صحيح."

            ));

            fortyhadithList.add(new Hadith("شرح الحديث" + "\n" + "\n" +
                    "( وَخَالِقِ النَّاسَ بِخُلُقٍ حَسَنٍ) أي عامل الناس بخلق حسن. والخُلُق: هو الصفة الباطنة في الإنسان، والخَلْقُ: هو الصفة الظاهرة،والمعنى: عامل الناس بالأخلاق الحسنة بالقول وبالفعل. فما هو الخلق الحسن؟ قال بعضهم: الخلق الحسن: كف الأذى، وبذل الندى، والصبر على الأذى - أي على أذى الغير - والوجه الطلق"
            ));

        } else if (index == 18) {

            fortyhadithList = new ArrayList<>();

            fortyhadithList.add(new Hadith("الإيمان بالقضاء والقدر" + "\n" +

                    "عَنْ أَبِي عَبَّاسٍ عَبْدِ اللهِ بنِ عَبَّاسٍ رضي الله عنهما قَالَ: كُنْتُ خَلْفَ النبي ﷺ يَومَاً فَقَالَ: (يَا غُلاَمُ إِنّي أُعَلِّمُكَ كَلِمَاتٍ : احْفَظِ اللهَ يَحفَظك، احْفَظِ اللهَ تَجِدهُ تُجَاهَكَ، إِذَاَ سَأَلْتَ فَاسْأَلِ اللهَ، وَإِذَاَ اسْتَعَنتَ فَاسْتَعِن بِاللهِ، وَاعْلَم أَنَّ الأُمّة لو اجْتَمَعَت عَلَى أن يَنفَعُوكَ بِشيءٍ لَمْ يَنْفَعُوكَ إِلا بِشيءٍ قَد كَتَبَهُ اللهُ لَك، وإِن اِجْتَمَعوا عَلَى أَنْ يَضُرُّوكَ بِشيءٍ لَمْ يَضروك إلا بشيءٍ قَد كَتَبَهُ اللهُ عَلَيْكَ، رُفعَت الأَقْلامُ، وَجَفّتِ الصُّحُفُ)" +
                    " رواه الترمذي وقال: حديث حسن صحيح"));

            fortyhadithList.add(new Hadith("شرح الحديث" + "\n" + "\n" +

                    "(احْفَظِ اللهَ تَجِدهُ تجَاهَكْ)  ومعنى تجده تجاهك وأمامك معناهما" +
                    " واحد يعني تجد الله عزّ وجل أمامك يدلك على كل خير ويقربك إليه ويهديك إلي" +
                    "ه ويذود عنك كل شر ولا سيما إذا حفظت الله بالاستعانة به فإ" +
                    "ن الإنسان إذا استعان بالله عزّ وجل وتوكل عليه" +
                    " كان الله حسبه ولا يحتاج إلى أحد بعد الله" + "\n" +

                    "(رُفعَت الأَقْلامُ، وَجَفّت الصُّحُفُ) يعني أن ما كتبه الله عزّ وجل قد انتهى فالأقلام رفعت والصحف جفت ولا تبديل لكلمات الله"
            ));


        } else if (index == 19) {

            fortyhadithList = new ArrayList<>();

            fortyhadithList.add(new Hadith("الحياء من الإيمان" + "\n" + "\n" +

                    "عَنْ أَبيْ مَسْعُوْدٍ عُقبَة بنِ عَمْرٍو الأَنْصَارِيِّ البَدْرِيِّ رضي الله عنه قَالَ: قَالَ رَسُوْلُ اللهِ ﷺ (إِنَّ مِمَّا أَدرَكَ النَاسُ مِن كَلاَمِ النُّبُوَّةِ الأُولَى إِذا لَم تَستَحْيِ فاصْنَعْ مَا شِئتَ) رواه البخاري."
            ));

            fortyhadithList.add(new Hadith("(إذا لَم تَستَحْيِ فَاصْنَع مَا شِئت) هذه الكلمة من كلام النبوة الأولى، والحياء هو عبارة عن انفعال يحدث للإنسان عند فعل ما لا يجمله ولا يزينه، فينكسر ويحصل الحياء."
            ));


        } else if (index == 20) {

            fortyhadithList = new ArrayList<>();

            fortyhadithList.add(new Hadith("الاستقامه بالإسلام" + "\n" + "\n" +

                    "عَنِ أَبيْ عَمْرٍو، وَقِيْلَ،أَبيْ عمْرَةَ سُفْيَانَ بنِ عَبْدِ اللهِ رضي الله عنه قَالَ: قُلْتُ يَا رَسُوْلَ اللهِ قُلْ لِيْ فِي الإِسْلامِ قَوْلاً لاَ أَسْأَلُ عَنْهُ أَحَدَاً غَيْرَكَ؟ قَالَ: (قُلْ آمَنْتُ باللهِ ثُمَّ استَقِمْ)"
            ));

            fortyhadithList.add(new Hadith(
                    "(اِستَقِم) أي سر على صراط مستقيم، فلا تخرج عن الشريعة لا يميناً ولا شمالاً. هاتان الكلمتان جمعتا الدين كله. فلننظر: الإيمان بالله يتضمن الإخلاص له في العبادة، والاستقامة تتضمن التمشي على شريعته عزّ وجل، فيكون جامعاً لشرطي العبادة وهما: الإخلاص والمتابعة."
            ));


        } else if (index == 21) {

            fortyhadithList = new ArrayList<>();

            fortyhadithList.add(new Hadith(
                    "الطريق إلى الجنة" + "\n" + "\n" +
                            "عَنْ أَبيْ عَبْدِ اللهِ جَابِرِ بنِ عَبْدِ اللهِ الأَنْصَارِيِّ رضي الله عنه أَنَّ رَجُلاً سَأَلَ النبي ﷺ فَقَالَ: (أَرَأَيتَ إِذا صَلَّيْتُ المَكْتُوبَاتِ، وَصُمْتُ رَمَضانَ، وَأَحلَلتُ الحَلاَلَ، وَحَرَّمْتُ الحَرَامَ، وَلَمْ أَزِدْ عَلى ذَلِكَ شَيئاً أَدخُل الجَنَّة ؟" +
                            " قَالَ: نَعَمْ)" + "\n" + "\n" +
                            " رواه مسلم"));


        } else if (index == 22) {

            fortyhadithList = new ArrayList<>();

            fortyhadithList.add(new Hadith("جوامع الخير" + "\n" +

                    "عَنْ أَبِي مَالِكٍ الحَارِثِ بنِ عَاصِم الأَشْعَرِيِّ رَضِيَ اللهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللهِ ﷺ : )الطُّهُورُ شَطْرُ الإِيْمَانِ، والحَمْدُ للهِ تَمْلأُ الميزانَ، وسُبْحَانَ اللهِ والحَمْدُ للهِ تَمْلآنِ - أَو تَمْلأُ - مَا بَيْنَ السَّمَاءِ والأَرْضِ، وَالصَّلاةُ نُورٌ، والصَّدَقَةُ بُرْهَانٌ، وَالصَّبْرُ ضِيَاءٌ، وَالقُرْآنُ حُجَّةٌ لَكَ أَو عَلَيْكَ، كُلُّ النَّاسِ يَغْدُو فَبَائِعٌ نَفْسَهُ فَمُعْتِقُهَا أَو مُوبِقُهَا(رواه مسلم)"
            ));

            fortyhadithList.add(new Hadith("(والصَّدَقَةُ) الصدقة: بذل المال للمحتاج تقرّباً إلى الله عزّ وجل. قوله: (بُرْهَانٌ) أي دليل على صدق إيمان المتصدّق. وجه ذلك: أن المال محبوب للنفوس، ولا يبذل المحبوب إلا في طلب ما هو أحب، وهذا يدلّ على إيمان المتصدق، ولهذا سمى النبي ﷺ الصدقة برهاناً. قوله: (وَالصَّبرُ ضِيَاءٌ) الصبر: حبس النفس عما يجب الصبر عنه وعليه"
            ));

            fortyhadithList.add(new Hadith("(فَمُعْتِقُهَا أَو مُوبِقُهَا ) فيكون بيعه لنفسه إعتاقاً إذا قام بطاعة الله كما قال الله عزّ وجل: (وَمِنَ النَّاسِ مَنْ يَشْرِي نَفْسَهُ ابْتِغَاءَ مَرْضَاتِ اللَّهِ) يشتري نفسه أي يبيع نفسه ابتغاء مرضاة الله عزّ وجل، فهذا الذي باع نفسه ابتغاء مرضاة الله وقام بطاعته قد أعتقها من العذاب والنار"
            ));


        } else if (index == 23) {

            fortyhadithList = new ArrayList<>();

            fortyhadithList.add(new Hadith("من فضل الله على الناس" + "\n" + "\n" +


                    "عَنْ أَبي ذرٍّ الغِفَارْي رضي الله عنه عَن النبي ﷺ فيمَا يَرْويه عَنْ رَبِِّهِ عزَّ وجل أَنَّهُ قَالَ: " +
                    "(يَا عِبَادِيْ إِنِّيْ حَرَّمْتُ الظُّلْمَ عَلَى نَفْسِيْ وَجَعَلْتُهُ بَيْنَكُمْ مُحَرَّمَاً فَلا تَظَالَمُوْا،" +
                    " يَا عِبَادِيْ كُلُّكُمْ ضَالٌّ إِلاَّ مَنْ هَدَيْتُهُ فَاسْتَهْدُوْنِي أَهْدِكُمْ،" +
                    " يَا عِبَادِيْ كُلُّكُمْ جَائِعٌ إِلاَّ مَنْ أَطْعَمْتُهُ فاَسْتَطْعِمُونِي أُطْعِمْكُمْ،" +
                    " يَا عِبَادِيْ كُلُّكُمْ عَارٍ إِلاَّ مَنْ كَسَوْتُهُ فَاسْتَكْسُوْنِيْ أَكْسُكُمْ،" +
                    " يَا عِبَادِيْ إِنَّكُمْ تُخْطِئُوْنَ بِاللَّيْلِ وَالنَّهَارِ وَأَنَا أَغْفِرُ الذُّنُوْبَ جَمِيْعَاً فَاسْتَغْفِرُوْنِيْ أَغْفِرْ لَكُمْ"
                    + "يَا عِبَادِيْ إِنَّكُمْ لَنْ تَبْلُغُوْا ضَرِّيْ فَتَضُرُّوْنِيْ وَلَنْ تَبْلُغُوْا نَفْعِيْ فَتَنْفَعُوْنِيْ،"

                    +

                    "يَا عِبَادِيْ لَوْ أَنَّ أَوَّلَكُمْ وَآخِرَكُمْ وَإِنْسَكُمْ وَجِنَّكُمْ كَانُوْا عَلَى أَتْقَى قَلْبِ رَجُلٍ وَاحِدٍ مِنْكُمْ مَا زَادَ ذَلِكَ فَيْ مُلْكِيْ شَيْئَاً. يَا عِبَادِيْ لَوْ أَنَّ أَوَّلَكُمْ وَآخِرَكُمْ وَإِنْسَكُمْ وَجِنَّكُمْ كَانُوْا عَلَى أَفْجَرِ قَلْبِ رَجُلٍ وَاحِدٍ مِنْكُمْ مَا نَقَصَ ذَلِكَ مِنْ مُلْكِيْ شَيْئَاً، يَا عِبَادِيْ لَوْ أنَّ أَوَّلَكُمْ وَآخِرَكُمْ وَإنْسَكُمْ وَجِنَّكُمْ قَامُوْا فِيْ صَعِيْدٍ وَاحِدٍ فَسَأَلُوْنِيْ فَأَعْطَيْتُ كُلَّ وَاحِدٍ مَسْأَلَتَهُ مَا نَقَصَ ذَلِكَ مِمَّا عِنْدِيْ إِلاَّ كَمَا يَنْقُصُ المِخْيَطُ إَذَا أُدْخِلَ البَحْرَ، يَا عِبَادِيْ إِنَّمَا هِيَ أَعْمَالُكُمْ أُحْصِيْهَا لَكُمْ ثُمَّ أُوَفِّيْكُمْ إِيَّاهَا فَمَنْ وَجَدَ خَيْرَاً فَليَحْمَدِ اللهَ وَمَنْ وَجَدَ غَيْرَ ذَلِكَ " +
                    "فَلاَ يَلُوْمَنَّ إِلاَّ نَفْسَهُ)" +
                    " رواه مسلم."));


        } else if (index == 24) {

            fortyhadithList = new ArrayList<>();

            fortyhadithList.add(new Hadith("فضل الذكر" + "\n" + "\n" +

                    "عَنْ أَبي ذَرٍّ رضي الله عنه قال: أَنَّ أُنَاسَاً مِنْ أَصحَابِ رَسُولِ اللهِ ﷺ قَالوا للنَّبي ﷺ يَارَسُولَ الله: ذَهَبَ أَهلُ الدثورِ بِالأُجورِ، يُصَلُّوْنَ كَمَا نُصَلِّيْ، وَيَصُوْمُوْنَ كَمَا نَصُوْمُ، وَيَتَصَدَّقُوْنَ بفُضُوْلِ أَمْوَالِهِمْ، قَالَ: (أَوَ لَيْسَ قَدْ جَعَلَ اللهُ لَكُمْ مَا تَصَّدَّقُوْنَ؟ إِنَّ بِكُلِّ تَسْبِيْحَةٍ صَدَقَة.وَكُلِّ تَكْبِيْرَةٍ صَدَقَةً وَكُلِّ تَحْمَيْدَةٍ صَدَقَةً وَكُلِّ تَهْلِيْلَةٍ صَدَقَةٌ وَأَمْرٌ بالِمَعْرُوْفٍ صَدَقَةٌ وَنَهْيٌ عَنْ مُنْكَرٍ صَدَقَةٌ وَفِيْ بُضْعِ أَحَدِكُمْ صَدَقَةٌ قَالُوا: يَا رَسُوْلَ اللهِ أَيَأْتِيْ أَحَدُنَا شَهْوَتَهُ وَيَكُوْنُ لَهُ فِيْهَا أَجْرٌ؟ قَالَ:أَرَأَيْتُمْ لَوْ وَضَعَهَا فَيْ حَرَامٍ أَكَانَ عَلَيْهِ وِزْرٌ؟ فَكَذَلِكَ إِذَا وَضَعَهَا فَي الحَلالِ كَانَ لَهُ أَجْرٌ) رَوَاهُ مُسْلِمٌ"

            ));

            fortyhadithList.add(new Hadith("(أَرَأيتُم لو وَضَعَها في حَرَامٍ أَكَانَ عَليهِ وِزر؟) والجواب: نعم يكون عليه وزر لو وضعها في حرام. قال ﷺ (فَكَذَلِكَ إِذَا وَضَعَها في الحَلالِ كَانَ لَهُ أَجرٌ) فاستغنى عن الحرام فكان مأجوراً بهذا، وهذا ما يسمى عند العلماء بقياس العكس، أي إذا ثبت هذا ثبت ضده في ضده."
            ));

        } else if (index == 25) {

            fortyhadithList = new ArrayList<>();

            fortyhadithList.add(new Hadith("كثرة طرق الخير" + "\n" + "\n" +

                    "عَنْ أَبِي هُرَيْرَةَ رضي الله عنه قَالَ: قَالَ رَسُولُ اللهِ ﷺ : (كُلُّ سُلامَى مِنَ النَّاسِ عَلَيْهِ صَدَقَةٌ كُلُّ يَومٍ تَطْلُعُ فِيْهِ الشَّمْسُ: تَعْدِلُ بَيْنَ اثْنَيْنِ صَدَقَةٌ، وَتُعِيْنُ الرَّجُلَ في دَابَّتِهِ فَتَحْمِلُ لَهُ عَلَيْهَا أَو تَرْفَعُ لَهُ عَلَيْهَا مَتَاعَهُ صَدَقَةٌ، وَالكَلِمَةُ الطَّيِّبَةُ صَدَقَةٌ، وَبِكُلِّ خُطْوَةٍ تَمْشِيْهَا إِلَى الصَّلاةِ صَدَقَةٌ، وَتُمِيْطُ الأَذى عَنِ الطَّرِيْقِ صَدَقَةٌ) رواه البخاري ومسلم."
            ));


        } else if (index == 26) {

            fortyhadithList = new ArrayList<>();

            fortyhadithList.add(new Hadith("تعريف البر والإثم" + "\n" + "\n" +

                    "عن النواس بن سمعان رضي الله عنهما ، عن النبي ﷺ قال: (البر حسن الخلق ، والإثم ما حاك في نفسك وكرهت أن يطلع عليه الناس ) .رواه مسلم.وعن وابصة بن معبد رضى الله عنه ، قال : أتيت رسول الله ﷺ ، فقال : (جئت تسأل عن البر و الإثم ؟) قلت : نعم ؛ قال : (استفت قلبك ؛ البر ما اطمأنت إليه النفس واطمأن اليه القلب ، والإثم ما حاك في النفس وتردد في الصدر ، وإن أفتاك الناس وأفتوك) .حديث حسن"
            ));

            fortyhadithList.add(new Hadith("(الإثم ما حاك في نفسك) أي تردد وصرت منه في قلق (وكرهت أن يطلع عليه الناس) لأنه محل ذم وعيب ، فتجدك مترددا فيه وتكره أن يطلع الناس عليك وهذه الجملة إنما هي لمن كان قلبه صافيا سليما"
            ));

            fortyhadithList.add(new Hadith(
                    "فهذا هو الذي يحوك في نفسه ما كان إثما ويكره أن يطلع عليه الناس . أما المتمردون الخارجون عن طاعة الله الذين قست قلوبهم فهؤلاء لا يبالون ، بل ربما يتبجحون بفعل المنكر والإثم ، فالكلام هنا ليس عاما لكل أحد بل هو خاص لمن كان قلبه سليما طاهرا نقيا."
            ));


        } else if (index == 27) {

            fortyhadithList = new ArrayList<>();

            fortyhadithList.add(new Hadith("السمع والطاعة" + "\n" + "\n" +

                    "عَن أَبي نَجِيحٍ العربَاضِ بنِ سَاريَةَ رضي الله عنه قَالَ: وَعَظَنا رَسُولُ اللهِ مَوعِظَةً وَجِلَت مِنهَا القُلُوبُ وَذَرَفَت مِنهَا العُيون. فَقُلْنَا: يَارَسُولَ اللهِ كَأَنَّهَا مَوْعِظَةُ مُوَدِّعٍ فَأَوصِنَا، قَالَ: (أُوْصِيْكُمْ بِتَقْوَى اللهِ عز وجل وَالسَّمعِ وَالطَّاعَةِ وَإِنْ تَأَمَّرَ عَلَيْكُمْ عَبْدٌ، فَإِنَّهُ مَنْ يَعِشْ مِنْكُمْ فَسَيَرَى اخْتِلافَاً كَثِيرَاً؛ فَعَلَيكُمْ بِسُنَّتِيْ وَسُنَّةِ الخُلَفَاءِ الرَّاشِدِينَ المّهْدِيِّينَ عَضُّوا عَلَيْهَا بِالنَّوَاجِذِ وَإِيَّاكُمْ وَمُحْدَثَاتِ الأُمُورِ فإنَّ كلّ مُحدثةٍ بدعة، وكُلَّ بِدْعَةٍ ضَلالَةٌ) رواه أبو داود والترمذي وقال : حديث حسن صحيح."
            ));

            fortyhadithList.add(new Hadith("(وَالسَّمعُ والطَّاعَة) أي لولاة الأمر بدليل قوله وَإِن تَأمَّر عَليكُم والسمع والطاعة بأن تسمع إذا تكلم، وأن تطيع إذا أمر" +


                    "\"فَسَيَرى\" والسين هنا للتحقيق اختِلاَفاً كَثيراً في العقيدة، وفي العمل ، وفي المنهج،" +
                    " وهذا الذي حصل، فالصحابة رضي الله عنهم الذين عاشوا طويلاً وجدوا من الاختلاف والفتن والشرور ما لم يكن لهم في الحسبان." +
                    " ثم أرشدهم ﷺ إلى ما يلزمونه عند هذا الاختلاف، فقال:" +
                    " (فَعَلَيكُم بِسَّنتي) أي الزموا سنتي، والمراد بالسنة هنا: الطريقة التي هو عليها ، فلا تبتدعوا في دين الله عزّ وجل ما ليس منه"
            ));

            fortyhadithList.add(new Hadith("(بالنَّوَاجِذِ) وهي أقصى الأضراس ومن المعلوم أن السنة ليست جسماً يؤكل،لكن هذا كناية عن شدة التمسك بها،أي أن الإنسان يتمسك بهذه السنة حتى يعض عليها بأقصى أضراسه"
            ));

            fortyhadithList.add(new Hadith("(وَإيَّاكُم وَمُحدَثَاتِ الأُمور) أي اجتنبوها،والمراد بالأمور هنا الشؤون، والمراد بالشؤون شؤون الدين،لا المحدثات في أمور الدنيا،لأن المحدثات في أمور الدنيا منها ما هو نافع فهو خير،ومنها ما هو ضار فهو شر،لكن المحدثات في أمور الدين كلها شر، ولهذا قال: \"فَإِنَّ كُلَّ مُحدَثَةٍ بِدعَة\" لأنها ابتدعت وأنشئت من جديد. قوله: (كُل بِدعَةٍ ضَلالَة) أي كل بدعة في دين الله عزّ وجل فهي ضلالة "
            ));


        } else if (index == 28) {

            fortyhadithList = new ArrayList<>();

            fortyhadithList.add(new Hadith("بواب الخير" + "\n" + "\n" +

                    "عَن مُعَاذ بن جَبَلٍ رضي الله عنه قَالَ: قُلتُ يَا رَسُولَ الله أَخبِرنِي بِعَمَلٍٍ يُدخِلُني الجَنَّةَ وَيُبَاعدني منٍ النار قَالَ: (لَقَدْ سَأَلْتَ عَنْ عَظِيْمٍ وَإِنَّهُ لَيَسِيْرٌ عَلَى مَنْ يَسَّرَهُ " +
                    "اللهُ تَعَالَى عَلَيْهِ: تَعْبُدُ اللهَ لاَتُشْرِكُ بِهِ شَيْئَا، وَتُقِيْمُ الصَّلاة، وَتُؤتِي الزَّكَاة، وَتَصُومُ رَمَضَانَ، وَتَحُجُّ البَيْتَ. ثُمَّ قَالَ: أَلاَ أَدُلُّكَ عَلَى أَبْوَابِ الخَيْرِ: الصَّوْمُ جُنَّةٌ، وَالصَّدَقَةُ تُطْفِئُ الخَطِيْئَةَ كَمَا يُطْفِئُ المَاءُ النَّارَ،" +
                    " وَصَلاةُ الرَّجُلِ فِي جَوْفِ اللَّيْلِ ثُمَّ تَلا : " + "\n" +
                    "(تَتَجَافَى جُنُوبُهُمْ عَنِ الْمَضَاجِعِ) حَتَّى بَلَغَ: (يَعْلَمُونْ) [السجدة:16-17]"));

            fortyhadithList.add(new Hadith("تكمله الحديث" + "\n" + "\n" +
                    "ثُمَّ قَالَ: أَلا أُخْبِرُكَ بِرَأْسِ الأَمْرِ وَعَمُودِهِ وَذِرْوَةِ سَنَامِهِ ؟ قُلْتُ: بَلَى يَارَسُولَ اللهِ، قَالَ: رَأْسُ الأَمْرِ الإِسْلامُ وَعَمُودُهُ الصَّلاةُ وَذروَةُ سَنَامِهِ الجِهَادُ ثُمَّ قَالَ: أَلا أُخبِرُكَ بِملاكِ ذَلِكَ كُلِّهِ ؟ قُلْتُ:بَلَى يَارَسُولَ اللهِ. فَأَخَذَ بِلِسَانِهِ وَقَالَ: كُفَّ عَلَيْكَ هَذَا. قُلْتُ يَانَبِيَّ اللهِ وَإِنَّا لَمُؤَاخَذُونَ بِمَا نَتَكَلَّمُ بِهِ ؟ فَقَالَ: ثَكِلَتْكَ أُمُّكَ يَامُعَاذُ. وَهَلْ يَكُبُّ النَّاسَ فِي النَّارِ عَلَى وُجُوهِهِمْ أَو قَالَ: عَلَى مَنَاخِرِهِمْ إِلاَّ حَصَائِدُ أَلسِنَتِهِمْ) رواه الترمذي وقال: حديث حسن صحيح."
            ));

            fortyhadithList.add(new Hadith("(وَهَل يَكُبُّ النَّاسَ في النارِ عَلى وجُوهِهم، أَو قَالَ: عَلَى منَاخِرهِم\" هذا شك من الراوي) إِلا حَصائدُ أَلسِنَتِهم\" أي ما يحصدون بألسنتهم من الأقوال. لما قال هذا الكلام اقتنع معاذ رضي الله عنه وعرف أن ملاك الأمر كف اللسان،لأن اللسان قد يقول الشرك، وقد يقول الكفر، وقد يقول الفحشاء، فهو ليس له حد."
            ));

        } else if (index == 29) {

            fortyhadithList = new ArrayList<>();


            fortyhadithList.add(new Hadith("الوقوف عند حدود الشرع" + "\n" + "\n" +
                    "عَنْ أَبِيْ ثَعْلَبَةَ الخُشَنِيِّ جُرثُومِ بنِ نَاشِرٍ رضي الله عنه عَن رَسُولِ اللهِ ﷺ قَالَ: (إِنَّ اللهَ فَرَضَ فَرَائِضَ فَلا تُضَيِّعُوهَا، وَحَدَّ حُدُودَاً فَلا تَعْتَدُوهَا وَحَرَّمَ أَشْيَاءَ فَلا تَنْتَهِكُوهَا، وَسَكَتَ عَنْ أَشْيَاءَ رَحْمَةً لَكُمْ غَيْرَ نِسْيَانٍ فَلا تَبْحَثُوا عَنْهَا) حديث حسن رواه الدارقطني وغيره."
            ));

            fortyhadithList.add(new Hadith(
                    "شرح الحديث" + "\n" +
                            " (وَسَكَتَ عَنْ أَشيَاء رَحمَةً لَكُمْ غَيرَ نسيَان فَلا تَبحَثوا عَنهَا) سكت عن أشياء أي لم يحرمها ولم يفرضها. قال: سكت بمعنى لم يقل فيها شيئاً ، ولا أوجبها ولا حرمها. وقوله: (غَيْرَ نسيَان) أي أنه عزّ وجل لم يتركها ناسياً لوقوله تعالى: (وَمَا كَانَ رَبُّكَ نَسِيّاً) ولكن رحمة بالخلق حتى لا يضيق عليهم. قوله: (فَلا تَبحَثوا عَنهَا) أي لا تسألوا، مأخوذ من بحث الطائر في الأرض، أي لا تُنَقِّبُوا عنها،بل دعوها."
            ));


        } else if (index == 30) {

            fortyhadithList = new ArrayList<>();

            fortyhadithList.add(new Hadith("الزهد في الدنيا" + "\n" + "\n" +

                    "عَنْ أَبي العَباس سَعدِ بنِ سَهلٍ السَّاعِدي رضي الله عنه قَالَ: جَاءَ رَجُلٌ إِلَى النبي ﷺ فَقَالَ: يَا رَسُول الله: دُلَّني عَلَى عَمَلٍ إِذَا عَمَلتُهُ أَحَبَّني اللهُ، وَأَحبَّني النَاسُ ؟ فَقَالَ: (ازهَد في الدُّنيَا يُحِبَّكَ اللهُ ، وازهَد فيمَا عِندَ النَّاسِ يُحِبَّكَ النَّاسُ) حديث حسن رواه ابن ماجة وغيره بأسانيد حسنة"
            ));

            fortyhadithList.add(new Hadith("(ازهَد في الدُّنيَا) والزهد في الدنيا الرغبة عنها، وأن لا يتناول الإنسان منها إلا ما ينفعه في الآخرة، وهو أعلى من الورع، لأن الورع: ترك ما يضر من أمور الدنيا ، والزهد: ترك مالا ينفع في الآخرة، وترك ما لا ينفع أعلى من ترك ما يضر "
            ));

        } else if (index == 31) {

            fortyhadithList = new ArrayList<>();

            fortyhadithList.add(new Hadith("لاضرر ولا ضرار" + "\n" +

                    "عن أبي سعيد سعد بن مالك بن سنان الخدري رضي الله عنه أن رسول الله ( ﷺ ) قال: (لا ضرر ولا ضرار)" + "\n" +
                    "حديث حسن رواه ابن ماجه والدار قطني وغيرهما مسنداً"
            ));

            fortyhadithList.add(new Hadith("(لاَ تُضَآرَّ وَالِدَةٌ بِوَلَدِهَا ) (أَوْ دَيْنٍ غَيْرَ مُضَآرٍّ) في مواضع من هذا النوع. فالضرر منفي ابتداءً ومكافئةً، يعني لا يبتدئ الإنسان بالضرر، ولا يجيب من ضره بالضرر؛ لئلا يسعى إلى ضرر لا ابتداءً ولا مكافئة، لا بمفرده ولا في مقابل من ضره. فالحديث فيه تحريم الضرر"
            ));

        } else if (index == 32) {

            fortyhadithList = new ArrayList<>();

            fortyhadithList.add(new Hadith("البيّنة على المُدَّعي" + "\n" + "\n" +

                    "عنِ ابْنِ عَبَّاسٍ رَضِيَ اللهُ عَنْهُمَا أَنَّ رَسُولَ اللهِ ﷺ قَالَ: \"لَوْ يُعْطَى النَّاسُ بِدعوَاهُمْ لادَّعَى رِجَالٌ أَمْوَال قَومٍ وَدِمَاءهُمْ، وَلَكِنِ البَينَةُ عَلَى المُدَّعِي، وَاليَمينُ عَلَى مَن أَنكَر\" حديث حسن رواه البيهقي هكذا بعضه في الصحيحين"
            ));

            fortyhadithList.add(new Hadith("(وَلَكِنِ البَينَةُ) البينة:ما يبين به الحق، وتكون في إثبات الدعوى (عَلَى المُدَعي) (وَاليَمين) أي دفع الدعوى (عَلَى مَنْ أَنكَر) . فهنا مدعٍ ومدعىً عليه، والمدعي : عليه البينة، والمدعى عليه: عليه اليمين ليدفع الدعوى. قوله: (وَاليَمين عَلَى مَنْ أَنكَر) أي من أنكر دعوى المدعي. هذا الحديث أصل عظيم في القضاء، وهو قاعدة عظيمة في القضاء ينتفع بها القاضي وينتفع بها المصلح بين اثنين وما إلى ذلك."
            ));

        } else if (index == 33) {

            fortyhadithList = new ArrayList<>();

            fortyhadithList.add(new Hadith("تغيير المنكر فريضة" + "\n" + "\n" +

                    "عَنْ أَبي سَعيدٍ الخُدريِّ رضي الله عنه قَالَ: سَمِعتُ رِسُولَ اللهِ ﷺ يَقولُ: (مَن رَأى مِنكُم مُنكَرَاً فَليُغَيِّرْهُ بِيَدِهِ، فَإِنْ لَمْ يَستَطعْ فَبِلِسَانِهِ، فَإِنْ لَمْ يَستَطعْ فَبِقَلبِه وَذَلِكَ أَضْعَفُ الإيمَانِ) رواه مسلم."
            ));

            fortyhadithList.add(new Hadith("(مُنْكَراً) المنكر:هو ما نهى الله عنه ورسوله، لأنه ينكر على فاعله أن يفعله. ( فَلْيُغَيِّرْهُ) أي يغير هذا المنكر بيده. وقوله: (مُنْكَرَاً) لابد أن يكون منكراً واضحاً يتفق عليه الجميع، أي المنكر والمنكر عليه،أو يكون مخالفة المنكر عليه مبينة على قول ضعيف لا وجه له. أما إذا كان من مسائل الاجتهاد فإنه لا ينكره"
            ));

            fortyhadithList.add(new Hadith("(فَإنْ لَمْ يَستَطِعْ فَبِقَلْبِهِ) أي فلينكر بقلبه، أي يكرهه ويبغضه ويتمنى أن لم يكن. (وَذَلِكَ) أي الإنكار بالقلب (أَضْعَفُ الإِيْمَانِ) أي أضعف مراتب الإيمان في هذا الباب أي في تغيير المنكر."
            ));

        } else if (index == 34) {

            fortyhadithList = new ArrayList<>();


            fortyhadithList.add(new Hadith("المسلم أخو المسلم" + "\n" + "\n" +

                    "عَنْ أَبي هُرَيرَةَ رضي الله عنه قَالَ: قَالَ رَسُولُ اللهِ ﷺ : (لاَ تَحَاسَدوا، وَلاَتَنَاجَشوا، وَلاَ تَبَاغَضوا، وَلاَ تَدَابَروا، وَلاَ يَبِع بَعضُكُم عَلَى بَيعِ بَعضٍ، وَكونوا عِبَادَ اللهِ إِخوَانَاً، المُسلِمُ أَخو المُسلم، لاَ يَظلِمهُ، وَلاَ يَخذُلُهُ، وَلا يكْذِبُهُ، وَلايَحْقِرُهُ، التَّقوَى هَاهُنَا - وَيُشيرُ إِلَى صَدرِهِ ثَلاَثَ مَراتٍ - بِحَسْبِ امرىء مِن الشَّرأَن يَحْقِرَ أَخَاهُ المُسلِمَ، كُلُّ المُسِلمِ عَلَى المُسلِمِ حَرَام دَمُهُ وَمَالُه وَعِرضُه) رواه مسلم"
            ));

            fortyhadithList.add(new Hadith(
                    "(وَلا تَنَاجَشوا) أي لا ينجش بعضكم على بعض، وهذا في المعاملات، ففي البيع المناجشة: أن يزيد في السلعة وهو لا يريد شراءها، لكن يريد الإضرار بالمشتري أو نفع البائع، أو الأمرين معاً . قال: (وَلا تَبَاغَضوا) أي لا يبغض بعضكم بعضاً ، والبغضاء لا يمكن تعريفها، تعريفها لفظها:كالمحبة والكراهة، والمعنى: لا تسعوا بأسباب البغضاء. وإذا وقع في قلوبكم بغض لإخوانكم فاحرصوا على إزالته وقلعه من القلوب."
            ));

            fortyhadithList.add(new Hadith("(وَلا تَدَابَروا) إما في الظهور بأن يولي بعضكم ظهر بعض، أولا تدابروا في الرأي، بأن يتجه بعضكم ناحية والبعض الآخر ناحية أخرى. (وَلاَ يَبِع بَعضُكُم عَلَى بَيعِ بَعضٍ) مثال ذلك:رأيت رجلاً باع على آخر سلعة بعشرة،فأتيت إلى المشتري وقلت: أنا أعطيك مثلها بتسعة،أو أعطيك خيراً منها بعشرة،فهذا بيع على بيع أخيه، وهو حرام."
            ));

            fortyhadithList.add(new Hadith("ثم قال: (المُسلِمُ أَخو المُسلِمِ) أي مثل أخيه في الولاء والمحبة والنصح وغير ذلك. ( لاَ يَظلِمهُ) أي لا ينقصه حقه بالعدوان عليه، أو جحد ما له ، سواء كان ذلك في الأمور المالية ،أو في الدماء،أو في الأعراض، في أي شيء. (وَلاَ يَخذُلُهُ) أي لا يهضمه حقه في موضوع كان يحب أن ينتصر له. (ولا يكذبه) أي لا يخبره بالكذب، الكذب القولي أو الفعلي. (وَلاَ يَحْقِرُهُ) أي لا يستصغره، ويرى أنه أكبر منه"
            ));


        } else if (index == 35) {

            fortyhadithList = new ArrayList<>();


            fortyhadithList.add(new Hadith("قضاء حوائج المسلمين" + "\n" +
                    "عَنْ أَبي هُرَيرَة رضي الله عنه عَنِ النبي ﷺ قَالَ: مَنْ نَفَّسَ عَنْ مُؤمِن كُربَةً مِن كُرَبِ الدُّنيَا نَفَّسَ " +
                    "اللهُ عَنهُ كُربَةً مِنْ كرَبِ يَوم القيامَةِ، وَمَنْ يَسَّرَ على مُعسرٍ يَسَّرَ الله عَلَيهِ في الدُّنيَا والآخِرَة،" +
                    " وَمَنْ سَتَرَ مُسلِمَاً سَتَرَهُ الله في الدُّنيَا وَالآخِرَة، وَاللهُ في عَونِ العَبدِ مَا كَانَ العَبدُ " +
                    "في عَونِ أخيهِ، وَمَنْ سَلَكَ طَريقَاً يَلتَمِسُ فيهِ عِلمَاً سَهَّلَ اللهُ لهُ بِهِ طَريقَاً إِلَى الجَنَّةِ،" +
                    " وَمَا اجتَمَعَ قَومٌ في بَيتٍ مِنْ بيوتِ اللهِ يَتلونَ كِتابِ اللهِ وَيتَدارَسونهَ بَينَهُم" +
                    " إِلا نَزَلَت عَلَيهُم السَّكينَة وَغَشيَتهم الرَّحمَة وحَفَتهُمُ المَلائِكة وَذَكَرهُم " +
                    "اللهُ فيمَن عِندَهُ،وَمَنْ بَطَّأ بِهِ عَمَلُهُ لَمْ يُسْرِعْ بهِ نَسَبُهُ"));

            fortyhadithList.add(new Hadith("شرح الحديث" + "\n" +
                    "(مِنْ كُربِ الدنيَا) أي من الكرب التي تكون في الدنيا وإن كانت من مسائل الدين،لأن الإنسان قد تصيبه كربة من كرب الدين فينفس عنه. قوله: (نَفَّسَ اللهُ عَنهُ كُربَةً مِنْ كُرَبِ يَومِ القيامَة) الجزاء من جنس العمل من حيث الجنس،تنفيس وتنفيس،لكن من حيث النوع يختلف اختلافاً عظيماً،فكرب الدنيا لا تساوي شيئاً بالنسبة لكرب الآخرة،فإذا نفس الله عن الإنسان كربة من كرب الآخرة كان ثوابه أعظم من عمله."
            ));

        } else if (index == 36) {

            fortyhadithList = new ArrayList<>();


            fortyhadithList.add(new Hadith("الترغيب في فعل الحسنات" + "\n" +
                    "عَن ابْنِ عَبَّاسٍ رَضِيَ اللهُ عَنْهُمَا عَنِ النبي ﷺ فِيْمَا يَرْوِيْهِ عَنْ رَبِّهِ تَبَارَكَ وَتَعَالى أَنَّهُ قَالَ: (إِنَّ الله كَتَبَ الحَسَنَاتِ وَالسَّيئَاتِ ثُمَّ بَيَّنَ ذَلِكَ؛ فَمَنْ هَمَّ بِحَسَنَةٍ فَلَمْ يَعْمَلْهَا كَتَبَهَا اللهُ عِنْدَهُ حَسَنَةً كَامِلَةً،وَإِنْ هَمَّ بِهَا فَعَمِلَهَا كَتَبَهَا اللهُ عِنْدَهُ عَشْرَ حَسَنَاتٍ إِلَى سَبْعِمائَةِ ضِعْفٍ إِلىَ أَضْعَاف كَثِيْرَةٍ. وَإِنْ هَمَّ بِسَيِّئَةٍ فَلَمْ يَعْمَلْهَا كَتَبَهَا اللهُ عِنْدَهُ حَسَنَةً كَامِلَةً،وَإِنْ هَمَّ بِهَا فَعَمِلَهَا كَتَبَهَا اللهُ سَيِّئَةً وَاحِدَةً) رَوَاهُ البُخَارِيُّ وَمُسْلِمٌ في صَحِيْحَيهِمَا بِهَذِهِ الحُرُوْفِ."
            ));

        } else if (index == 37) {

            fortyhadithList = new ArrayList<>();


            fortyhadithList.add(new Hadith("جزاء معادات الأولياء" + "\n" +
                    "عَنْ أَبِي هُرَيْرَةَ رضي الله عنه قَالَ: قَالَ رَسُولُ اللهِ ﷺ : (إِنَّ اللهَ تَعَالَى قَالَ: مَنْ عَادَى لِي وَلِيَّاً فَقَدْ آذَنْتُهُ بِالحَرْبِ. وَمَا تَقَرَّبَ إِلِيَّ عَبْدِيْ بِشَيءٍ أَحَبَّ إِلِيَّ مِمَّا افْتَرَضْتُهُ عَلَيْهِ. ولايَزَالُ عَبْدِيْ يَتَقَرَّبُ إِلَيَّ بِالنَّوَافِلِ حَتَّى أُحِبَّهُ، فَإِذَا أَحْبَبتُهُ كُنْتُ سَمْعَهُ الَّذِيْ يَسْمَعُ بِهِ، وَبَصَرَهُ الَّذِيْ يُبْصِرُ بِهِ، وَيَدَهُ الَّتِي يَبْطِشُ بِهَا، وَرِجْلَهُ الَّتِي يَمْشِيْ بِهَا. وَلَئِنْ سَأَلَنِيْ لأُعطِيَنَّهُ، وَلَئِنْ اسْتَعَاذَنِيْ لأُعِيْذَنَّهُ) رواه البخاري"
            ));

            fortyhadithList.add(new Hadith("قوله: (مَنْ عَادَى لِي وَليَّاً) أي اتخذه عدواً له، ووليُّ الله عزّ وجل بيَّنه الله عزّ وجل في القرآن، فقال: (أَلا إِنَّ أَوْلِيَاءَ اللَّهِ لا خَوْفٌ عَلَيْهِمْ وَلا هُمْ يَحْزَنُونَ* الَّذِينَ آمَنُوا وَكَانُوا يَتَّقُونَ) قال شيخ الإسلام ابن تيمية - رحمه الله- من كان مؤمناً تقياً كان لله وليَّاً أخذه من الآية: (الَّذِينَ آمَنُوا وَكَانُوا يَتَّقُونَ) قوله: (فَقَدْ) هذا جواب الشرط (آذَنْتُهُ ِبالحَرْبِ) أي أعلنت عليه الحرب"
            ));

            fortyhadithList.add(new Hadith(" (وَلاَ يَزَالُ عَبْدِيْ يَتَقَرَّبُ إِلَيَّ بِالنَّوَافِلِ حَتَّى أُحِبَّهُ) لايزال:هذا من أفعال الاستمرار،أي أنه يستمر يتقرب إلى الله تعالى بالنوافل حتى يحبه الله عزّ وجل،و (حتى) هذه للغاية، فيكون من أحباب الله "
            ));


            fortyhadithList.add(new Hadith(" (وَلَئِنِ اسْتَعَاذَنِي) أي طلب مني أن أعيذه فأكون ملجأ له (لأعِيذَنَّهُ) فذكر السؤال الذي به حصول المطلوب، والاستعاذة التي بها النجاة من المرهوب، وأخبر أنه سبحانه وتعالى يعطي هذا المتقرب إليه بالنوافل ما سأل، ويعيذه مما استعاذ."
            ));


        } else if (index == 38) {

            fortyhadithList = new ArrayList<>();

            fortyhadithList.add(new Hadith(
                    "التجاوز عن الخطأ والنسيان" + "\n" +
                            "عَنِ ابْنِ عَبَّاسٍ رَضِيَ اللهُ عَنْهُمَا أَنَّ رَسُولَ اللهِ ﷺ قَال: (إِنَّ اللهَ تَجَاوَزَ لِي عَنْ أُمَّتِي الخَطَأَ وَالنِّسْيَانَ وَمَا اسْتُكْرِهُوا عَلَيْهِ) حديث حسن رواه ابن ماجه والبيهقي وغيرهما."
            ));

            fortyhadithList.add(new Hadith("قوله: (إِنَّ اللهَ تَجَاوَزَ لِي عَنْ أُمَّتِي الخَطَأَ وَالنِّسْيَانَ وَمَا اسْتُكْرِهُوا عَلَيْهِ) اللام هنا للتعليل، أي تجاوز من أجلي عن أمتي الخطأ والنسيان وما استكرهوا عليه. والخطأ: أن يرتكب الإنسان العمل عن غير عمد. والنسيان: ذهول القلب عن شيءٍ معلوم من قبل. والاستكراه: أن يكرهه شخص على عمل محرم ولا يستطيع دفعه، أي: الإلزام والإجبار."
            ));


        } else if (index == 39) {

            fortyhadithList = new ArrayList<>();

            fortyhadithList.add(new Hadith("كن في الدنيا كأنك غريب" + "\n" +
                    "عَنِ ابْنِ عُمَرَ رَضِيَ اللهُ عَنْهُمَا قَالَ: أَخَذَ رَسُولُ اللهِ ﷺ بِمنْكبيَّ فَقَالَ: (كُنْ فِي الدُّنْيَا كَأَنَّكَ غَرِيْبٌ أَوْ عَابِرُ سَبِيْلٍ) وَكَانَ ابْنُ عُمَرَ رَضِيَ اللهُ عَنْهُمَا يَقُوْلُ: إِذَا أَمْسَيْتَ فَلا تَنْتَظِرِ الصَّبَاحَ، وَإِذَا أَصْبَحْتَ فَلا تَنْتَظِرِ المَسَاءَ. وَخُذْ مِنْ صِحَّتِكَ لِمَرَضِكَ، وَمِنْ حَيَاتِكَ لمَوْتِكَ..رواه البخاري."
            ));

            fortyhadithList.add(new Hadith("(كُنْ فِي الدُّنْيَا كَأَنَّكَ غَرِيْبٌ أَوْ عَابرُ سَبِيْلٍ) وهذا يعني الزهد في الدنيا، وعدم الركون إليها، لأنه مهما طال بك العمر فإن مآلك إلى مفارقتها"
            ));

            fortyhadithList.add(new Hadith("(اعمل لدنياك كأنك تعيش أبداً، واعمل لآخرتك كأنك تموت غداً) والمعنى: الدنيا لاتهمّك، الذي لا تدركه اليوم تدركه غداً فاعمل كأنك تعيش أبداً، والآخرة اعمل لها كأنك تموت غداً، بمعنى: لا تؤخر العمل. وهذا يروى حديثاً عن النبي ﷺ ولكنه ليس بحديث."
            ));

        } else if (index == 40) {

            fortyhadithList = new ArrayList<>();

            fortyhadithList.add(new Hadith("اتباع النبي صلى الله عليه وسلم" + "\n" +

                    "عَنْ أَبِيْ مُحَمَّدٍ عَبْدِ اللهِ بِنِ عمْرِو بْنِ العَاصِ رَضِيَ اللهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اللهِ صلى الله عليه وسلم: " + "\n" +
                    "(لاَيُؤْمِنُ أَحَدُكُمْ حَتَّى يَكُونَ هَواهُ تَبَعَاً لِمَا جِئْتُ بِهِ)" + "\n" + "\n" +
                    " حَدِيْثٌ حَسَنٌ صَحِيْحٌ "));

            fortyhadithList.add(new Hadith("يقول: (لاَ يُؤمِنُ أَحَدُكُمْ) يعني الإيمان الكامل. قوله: (حَتَّى يَكُونَ هَواهُ) أي اتجاهه وقصده. قوله: (تَبَعَاً لِمَا جِئْتُ بِهِ) أي من الشريعة."
            ));

        } else {

            fortyhadithList = new ArrayList<>();

            fortyhadithList.add(new Hadith("سعة مغفرة الله" + "\n" +

                    "عَنْ أَنَسِ بْنِ مَالِكٍ رضي الله عنه قَالَ: سَمِعْتُ رَسُولَ اللهِ يَقُولُ:" + "\n" +
                    " قَالَ اللهُ تَعَالَى:" + "\n" +
                    " (يَا ابْنَ آَدَمَ إِنَّكَ مَا دَعَوتَنِيْ وَرَجَوتَنِيْ غَفَرْتُ لَكَ عَلَى مَا كَانَ مِنْكَ وَلا أُبَالِيْ، يَا ابْنَ آَدَمَ لَو بَلَغَتْ ذُنُوبُكَ عَنَانَ السَّمَاءِ ثُمَّ استَغْفَرْتَنِيْ غَفَرْتُ لَكَ، يَا ابْنَ آَدَمَ إِنَّكَ لَو أَتَيْتَنِيْ بِقِرَابِ الأَرْضِ خَطَايَا ثُمَّ لقِيْتَنِيْ لاَ تُشْرِك بِيْ شَيْئَاً لأَتَيْتُكَ بِقِرَابِهَا مَغفِرَةً)" + "\n" + "\n" +
                    " رَوَاهُ التِّرْمِذِيُّ وَقَالَ: حَدِيْثٌ حَسَنٌ صَحَيْحٌ."
            ));

            fortyhadithList.add(new Hadith("(لأَتَيْتُكَ بِقِرَابِهَا مَغْفِرَةً) وهذا لاشكّ من نعمة الله وفضله، بأن يأتي الإنسان ربه بملء الأرض خطايا ثم يأتيه عزّ وجل بقرابها مغفرة، وإلا فمقتضى العدل أن يعاقبه على الخطايا ."
            ));


        }
        return fortyhadithList;
    }
}