package com.islamey.hamza.wazaker.data.DataSets

import java.util.*

object NotificationDataset {
    // TODO kwatarnof
    //TODO العلماء
    val randomNotification: String
        get() {
            val notifications = arrayOf(
                """
    قال رسول الله صلى الله عليه وسلم: (كُلُّ أُمَّتي يَدْخُلُونَ الجَنَّةَ إِلَّا مَن أَبَى، قالوا: يا رَسُولَ اللَّهِ، وَمَن يَأْبَى؟ قالَ: مَن أَطَاعَنِي دَخَلَ الجَنَّةَ، وَمَن عَصَانِي فقَدْ أَبَى)
    صحيح البخاري
    
    """.trimIndent(),
                """
                       قال رسول الله صلى الله عليه وسلم: (خَيْرُكُمْ مَن تَعَلَّمَ القُرْآنَ وعَلَّمَهُ)
                       صحيح البخاري
                       
                       """.trimIndent(),
                "هل صليت على النبي محمد اليوم؟",
                "عن جابر بن عبد الله -رضي الله عنه- قال: قال رسول الله صلّى الله عليه وسلم: (سلُوا اللهَ علمًا نافعًا، وتَعَوَّذُوا باللهِ منْ علمٍ لا ينفعُ)\n",
                "قال رسول الله صلى الله عليه وسلم: (نضَّرَ اللَّهُ امرأً سمِعَ منَّا حديثًا فحفِظَهُ حتَّى يبلِّغَهُ غيرَهُ، فرُبَّ حاملِ فقهٍ ليسَ بفَقيهٍ، ورُبَّ حاملِ فقهٍ إلى من هوَ أفقَهُ منهُ)\n",
                "قال صلّى الله عليه وسلّم: (لَأَنْ يَحْتَطِبَ أَحَدُكُمْ حُزْمَةً علَى ظَهْرِهِ، خَيْرٌ له مِن أَنْ يَسْأَلَ أَحَدًا فيُعْطِيَهُ أَوْ يَمْنَعَهُ)\n",
                "قال رسول الله صلّى الله عليه وسلّم: (فِي الجَنَّةِ ثَمَانِيَةُ أبْوَابٍ، فِيهَا بَابٌ يُسَمَّى الرَّيَّانَ، لا يَدْخُلُهُ إلَّا الصَّائِمُونَ)",
                """
                       
                       قال رسول الله صلى الله عليه وسلم: (مَثَلُ المُؤْمِنِ الذي يَقْرَأُ القُرْآنَ، مَثَلُ الأُتْرُجَّةِ، رِيحُها طَيِّبٌ وطَعْمُها طَيِّبٌ، ومَثَلُ المُؤْمِنِ الذي لا يَقْرَأُ القُرْآنَ مَثَلُ التَّمْرَةِ، لا رِيحَ لها وطَعْمُها حُلْوٌ)
                       """.trimIndent(),
                """
                       
                       قال رسول الله صلى الله عليه وسلم: (كُلُّ أُمَّتي يَدْخُلُونَ الجَنَّةَ إِلَّا مَن أَبَى، قالوا: يا رَسُولَ اللَّهِ، وَمَن يَأْبَى؟ قالَ: مَن أَطَاعَنِي دَخَلَ الجَنَّةَ، وَمَن عَصَانِي فقَدْ أَبَى)
                       """.trimIndent(),
                "قال رسول الله صلى الله عليه وسلم: (كَلِمَتانِ حَبِيبَتانِ إلى الرَّحْمَنِ، خَفِيفَتانِ علَى اللِّسانِ، ثَقِيلَتانِ في المِيزانِ: سُبْحانَ اللَّهِ وبِحَمْدِهِ، سُبْحانَ اللَّهِ العَظِيمِ)\n",
                "قال رسول الله صلى الله عليه وسلم: (مَن حَفِظَ عَشْرَ آياتٍ مِن أوَّلِ سُورَةِ الكَهْفِ عُصِمَ مِنَ الدَّجَّالِ)",
                "قال رسول الله صلى الله عليه وسلم: (لا تَجْعَلُوا بُيُوتَكُمْ مَقابِرَ، إنَّ الشَّيْطانَ يَنْفِرُ مِنَ البَيْتِ الذي تُقْرَأُ فيه سُورَةُ البَقَرَةِ)",
                "قال رسول الله صلى الله عليه وسلم: (أيَعجِزُ أحَدُكم أنْ يَكسِبَ كُلَّ يَومٍ ألْفَ حَسَنةٍ؟ فقال رَجُلٌ مِن جُلَسائِهِ: كيف يَكسِبُ أحَدُنا ألْفَ حَسَنةٍ؟ قال: يُسبِّحُ مِئةَ تَسبيحةٍ؛ تُكتَبُ له ألْفُ حَسَنةٍ، أو يُحَطُّ عنه ألْفُ خَطيئةٍ)",
                "قال صلى الله عليه وسلم : (اتَّقوا الظُّلمَ، فإنَّ الظُّلمَ ظلماتٌ يومَ القيامةِ، واتَّقوا الشُّحَّ فإنَّ الشُّحَّ أهلك من كان قبلكم، حملهم على أن سفكوا دماءَهم واستحلُّوا محارمَهم)\n",
                """
                       قال رسول الله صلى الله عليه وسلم: (مَن تَرَكَ صَلَاةَ العَصْرِ حَبِطَ عَمَلُهُ)
                       صحيح البخاري
                       
                       """.trimIndent(),
                "عن أبي هريرة رضي الله عنه: ((إذا استيقظ أحدكم من نومه فلا يغمِسْ يده في الإناء حتى يغسلها ثلاثًا، فإنه لا يدري أين باتت يدُه))؛ متفق عليه، وهذا لفظ مسلم\n",
                """
                       قال رسول الله صلى الله عليه وسلم: (لَعَنَ رَسولُ اللَّهِ صَلَّى اللهُ عليه وسلَّمَ المُتَشَبِّهِينَ مِنَ الرِّجَالِ بالنِّسَاءِ، والمُتَشَبِّهَاتِ مِنَ النِّسَاءِ بالرِّجَالِ)
                       صحيح البخاري
                       
                       """.trimIndent(),
                """
                       قال رسول الله صلى الله عليه وسلم: (سَيِّدُ الِاسْتِغْفارِ أنْ تَقُولَ: اللَّهُمَّ أنْتَ رَبِّي لا إلَهَ إلَّا أنْتَ، خَلَقْتَنِي وأنا عَبْدُكَ، وأنا علَى عَهْدِكَ ووَعْدِكَ ما اسْتَطَعْتُ، أعُوذُ بكَ مِن شَرِّ ما صَنَعْتُ، أبُوءُ لكَ بنِعْمَتِكَ عَلَيَّ، وأَبُوءُ لكَ بذَنْبِي فاغْفِرْ لِي، فإنَّه لا يَغْفِرُ الذُّنُوبَ إلَّا أنْتَ)
                       صحيح البخاري
                       
                       """.trimIndent(),
                "هل صليت على النبي محمد اليوم؟",
                "هل صليت على النبي محمد اليوم؟",
                "هل صليت على النبي محمد اليوم؟",
                "هل صليت على النبي محمد اليوم؟",
                "هل صليت على النبي محمد اليوم؟",
                "هل صليت على النبي محمد اليوم؟",
                "هل صليت على النبي محمد اليوم؟",
                "هل صليت على النبي محمد اليوم؟",
                "هل صليت على النبي محمد اليوم؟",
                "هل صليت على النبي محمد اليوم؟",
                "هل صليت على النبي محمد اليوم؟",
                "هل صليت على النبي محمد اليوم؟",
                "هل صليت على النبي محمد اليوم؟",
                "هل صليت على النبي محمد اليوم؟",
                """
                       قال رسول الله صلى الله عليه وسلم: (المُسْلِمُ مَن سَلِمَ المُسْلِمُونَ مِن لِسانِهِ ويَدِهِ، والمُهاجِرُ مَن هَجَرَ ما نَهَى اللَّهُ عنْه)
                       صحيح البخاري
                       
                       """.trimIndent(),
                """
                       قال رسول الله صلى الله عليه وسلم: (الْمُؤْمِنُ القَوِيُّ، خَيْرٌ وَأَحَبُّ إلى اللهِ مِنَ المُؤْمِنِ الضَّعِيفِ، وفي كُلٍّ خَيْرٌ احْرِصْ علَى ما يَنْفَعُكَ، وَاسْتَعِنْ باللَّهِ وَلَا تَعْجَزْ، وإنْ أَصَابَكَ شيءٌ، فلا تَقُلْ لو أَنِّي فَعَلْتُ كانَ كَذَا وَكَذَا، وَلَكِنْ قُلْ قَدَرُ اللهِ وَما شَاءَ فَعَلَ، فإنَّ لو تَفْتَحُ عَمَلَ الشَّيْطَانِ)
                       صحيح مسلم
                       
                       """.trimIndent(),
                """
                       قال رسول الله صلى الله عليه وسلم: (إنَّ اللَّهَ يَرْفَعُ بهذا الكِتَابِ أَقْوَامًا، وَيَضَعُ به آخَرِينَ)
                       صحيح مسلم
                       
                       """.trimIndent(),
                """
                       قال رسول الله صلى الله عليه وسلم: (مَن حَفِظَ عَشْرَ آياتٍ مِن أوَّلِ سُورَةِ الكَهْفِ عُصِمَ مِنَ الدَّجَّالِ)
                       صحيح مسلم
                       
                       """.trimIndent(),
                """
                       روى ابن حبان في صحيحه عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال : ( إذا صلت المرأة خمسها ، وصامت شهرها ، وحصنت فرجها ، وأطاعت زوجها ، قيل لها: أدخلي الجنة من أي أبواب الجنة شئت )
                       صحيح البخاري
                       
                       """.trimIndent(),
                """
                       عن أبي أمامة الباهلي رضي الله عنه قال : قال رسول الله صلى الله عليه وسلم : ( من قرأ آية الكرسي في دبر كل صلاة لم يحل بينه وبين دخول الجنة إلا الموت )
                       صحيح البخاري
                       
                       """.trimIndent(),
                """
                       عن أنس رضي الله عنه قال: "مر النبي صلى الله عليه وسلم بتمرة في الطريق قال لولا أني أخاف أن تكون من الصدقة لأكلتها".
                       صحيح البخاري
                       
                       """.trimIndent(),
                """
                       قال رسول الله صلى الله عليه وسلم: "إذا شرب أحدكم فلا يتنفس في الإناء وإذا أتى الخلاء فلا يمس ذكره بيمينه ولا يتمسح بيمينه"
                       صحيح البخاري
                       
                       """.trimIndent(),
                """
                       "عن عائشة رضي الله عنها أن رسول الله صلى الله عليه وسلم كان إذا أخذ مضجعه نفث في يديه وقرأ بالمعوذات ومسح بهما جسده"
                       صحيح البخاري
                       
                       """.trimIndent(),
                """
                       الإكثار من الدعاء قبل التسليم عن عبدالله بن عمر قال : كنا إذا كنا مع النبي صلى الله عليه وسلم إلى أن قال : ثم ليتخير من الدعاء أعجبه إليه فيدعو
                       صحيح البخاري
                       
                       """.trimIndent(),
                """
                       عن النبي صلى الله عليه وسلم قال لا يؤمن أحدكم حتى يحب لأخيه ما يحب لنفسه
                       صحيح البخاري
                       
                       """.trimIndent(),
                """
                       عن النبي صلى الله عليه وسلم قال: "من نسي صلاة فليصل إذا ذكرها لا كفارة لها إلا ذلك وأقم الصلاة لذكري"
                       صحيح البخاري
                       
                       """.trimIndent(),
                """
                       حديث ابْنُ عَبّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَ مُعاذًا إِلى الْيَمَنِ فَقالَ: اتَّقِ دَعْوَةَ المَظْلُومِ فَإِنَّها لَيْسَ بَيْنَها وَبَيْنَ اللهِ حِجابٌ
                       متفق عليه
                       
                       """.trimIndent(),
                "روي أنّ - النبي صلى الله عليه وسلم - قال:" +
                        " (ما يصيبُ المؤمنَ من وصبٍ ، ولا نصبٍ ، ولا سقمٍ ، ولا حَزنٍ ،" +
                        " حتَّى الهمَّ يُهمُّه، إلَّا كفَّر به من سيِّئاتِه)",
                "روى البخاري بسندٍ صحيح أن - النبي صلى الله عليه وسلم - قال: (ما مِن مصيبةٍ تصيبُ المسلِمَ إلَّا كفَّرَ اللَّهُ بِها عنهُ ، حتَّى الشَّوكةِ يُشاكُها)",
                "روي أنَّ النبي - صلى الله عليه وسلم - قال: (ما يزالُ البلاءُ بالمؤمنِ والمؤمنةِ في نفسِه وولدِه ومالِه حتَّى يلقَى اللهَ تعالَى وما عليه خطيئةٌ).",
                "قد رُوي في الصحيح عن رسول الله - صلى الله عليه وسلم - أنه قال: (إنَّ العبدَ إذا سبقت له من اللهِ منزلةٌ لم يبلغْها بعمله ابتلاه اللهُ في جسدِه أو في مالِه أو في ولدِه ثم صبَّره على ذلك حتى يُبلِّغَه المنزلةَ التي سبقت له من اللهِ تعالى)\n",
                "روي في الصحيح عن سعد بن أبي وقاص - رضي الله عنه - أنه قال: (قلتُ يا رسولَ اللهِ أيُّ النَّاسِ أشدُّ بلاءً قالَ الأَنبياءُ ثمَّ الأَمثلُ فالأَمثلُ ؛ يُبتلَى الرَّجلُ علَى حسَبِ دينِهِ ، فإن كانَ في دينِهِ صلبًا اشتدَّ بلاؤُهُ، وإن كانَ في دينِهِ رقَّةٌ ابتليَ علَى قدرِ دينِهِ، فما يبرحُ البلاءُ بالعبدِ حتَّى يترُكَهُ يمشي علَى الأرضِ وما علَيهِ خطيئةٌ",
                "قول النبي صلّى الله عليه وسلم: (عَجَبًا لِأَمْرِ المؤمنِ؛ إنَّ أمرَهُ كلَّه له خيرٌ، وليس ذلك لأحَدٍ إلَّا للمؤمنِ؛ إنْ أصابَتْه سرَّاءُ شَكَرَ فكان خيرًا له، وإن أصابَتْه ضَرَّاءُ صَبَرَ فكان خيرًا له)\n",
                "قال رسول الله صلّى الله عليه وسلّم: (لا حسَدَ إلَّا في اثنتيْنِ: رجلٌ آتاهُ اللهُ مالًا، فسلَّطَهُ على هلَكتِه في الحقِّ، ورجلٌ آتاهُ اللهُ الحِكمةَ، فهوَ يقضِي بِها، ويُعلِّمُها)\n",
                "عن جابر بن عبد الله -رضي الله عنه- قال: قال رسول الله صلّى الله عليه وسلم: (سلُوا اللهَ علمًا نافعًا، وتَعَوَّذُوا باللهِ منْ علمٍ لا ينفعُ)\n",
                "قال رسول الله صلى الله عليه وسلم: (فضلُ العلْمِ أحبُّ إِلَيَّ مِنْ فضلِ العبادَةِ، وخيرُ دينِكُمُ الورَعُ)",
                "قال رسول الله صلّى الله عليه وسلّم: (سيأتيكُم أقوامٌ يطلبونَ العِلمَ فإذا رأيتُموهم فقولوا لَهُم مَرحبًا مَرحبًا بوصيَّةِ رسولِ اللَّهِ صلَّى اللَّهُ عليهِ وسلَّمَ واقْنوهُم)\n",
                "قال رسول الله صلّى الله عليه وسلّم: (بَلِّغُوا عَنِّي ولو آيَةً، وَحَدِّثُوا عن بَنِي إِسْرَائِيلَ وَلَا حَرَجَ، وَمَن كَذَبَ عَلَيَّ مُتَعَمِّدًا، فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنَ النَّارِ)\n",
                "قال رسول الله صلّى الله عليه وسلّم: (ما اجتمَعَ قومٌ في بيتٍ من بيوتِ اللَّهِ يتلونَ كتابَ اللَّهِ، ويتدارسونَهُ فيما بينَهم إلَّا نزلَت عليهِم السَّكينةُ، وغشِيَتهُمُ الرَّحمةُ، وحفَّتهُمُ الملائكَةُ، وذكرَهُمُ اللَّهُ فيمَن عندَهُ)\n",
                """عن ابن مسعود - رضي الله عنه - عن النَّبيّ - صلى الله عليه وسلم - قَالَ: «إنَّ الصِّدقَ يَهْدِي إِلَى البرِّ، وإنَّ البر يَهدِي إِلَى الجَنَّةِ، وإنَّ الرَّجُلَ لَيَصدُقُ حَتَّى يُكْتَبَ عِنْدَ اللهِ صِدِّيقًا. وَإِنَّ الكَذِبَ يَهْدِي إِلَى الفُجُورِ، وَإِنَّ الفُجُورَ يَهدِي إِلَى النَّارِ، وَإِنَّ الرَّجُلَ لَيَكْذِبُ حَتَّى يُكتَبَ عِنْدَ الله كَذَّابًا»
 مُتَّفَقٌ عَلَيهِ
""",
                """عن أبي ثابت، وقيل: أبي سعيد، وقيل: أبي الوليد، سهل ابن حُنَيْفٍ وَهُوَ بدريٌّ  رضي الله عنه: أنَّ النَّبيّ - صلى الله عليه وسلم - قَالَ: «مَنْ سَأَلَ اللهَ تَعَالَى الشَّهَادَةَ بِصِدْقٍ بَلَّغَهُ مَنَازِلَ الشُّهَدَاءِ وَإِنْ مَاتَ عَلَى فِرَاشِهِ» 
 رواه مسلم
""",
                "قال رسول الله صلى الله عليه وسلم: (أَرْبَعٌ مَن كُنَّ فيه كانَ مُنَافِقًا خَالِصًا، وَمَن كَانَتْ فيه خَلَّةٌ منهنَّ كَانَتْ فيه خَلَّةٌ مِن نِفَاقٍ حتَّى يَدَعَهَا: إِذَا حَدَّثَ كَذَبَ، وإذَا عَاهَدَ غَدَرَ، وإذَا وَعَدَ أَخْلَفَ، وإذَا خَاصَمَ فَجَرَ)\n",
                "عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: (سيَأتي علَى النَّاسِ سنواتٌ خدَّاعاتُ يصدَّقُ فيها الكاذِبُ ويُكَذَّبُ فيها الصَّادِقُ ويُؤتَمنُ فيها الخائنُ ويُخوَّنُ فيها الأمينُ وينطِقُ فيها الرُّوَيْبضةُ قيلَ وما الرُّوَيْبضةُ قالَ الرَّجلُ التَّافِهُ في أمرِ العامَّةِ)\n",
                """قال رسول الله صلى الله عليه وسلم: (بدأ الإسلامُ غريبًا وسيعودُ غريبًا كما بدأ فطُوبِى للغرباءِ، وفي روايةٍ قيل يا رسولَ اللهِ: مَن الغرباءُ؟ قال: الذين يصلحون إذا فسد الناسُ، وفي لفظٍ آخرَ قال: هم الذين يُصلِحون ما أفسد الناسُ من سنتي)
 [صحيح]
""",
                """عن عبد الله بن مسعود رضي الله عنه قال : سألت رسول الله صلى الله عليه وسلم : أي العمل أحب إلى الله ؟ قال : " الصلاة على وقتها " . قلت : ثم أي ؟ قال : " بر الوالدين " . قلت : ثم أي ؟ قال : " الجهاد في سبيل الله "
متفق عليه
""",
                "عن أبى هريرة رضي الله عنه قال : جاء رجل إلى رسول الله صلى الله عليه وسلم فقال : من أحق الناس بحسن صحابتي قال : \" أمك \". قال ثم من قال : \" ثم أمك \" . قال ثم من قال : \" ثم أمك \" . قال ثم من قال \" ثم أبوك \"\n",
                """عن عبد الله بن عمرو رضي الله عنه قال : جاء رجل إلى رسول الله صلى الله عليه وسلم فقال : جئت أبايعك على الهجرة ، وتركت أبوي يبكيان ، فقال : " ارجع إليهما فأضحكهما كما أبكيتهما " 
 أخرجه أحمد وأبو داود والنسائي وابن ماجه وصححه الألباني
""",
                """عن أبي هريرة رضي الله عنه قال : قال رسول الله صلى الله عليه و سلم : " ثلاث دعوات مستجابات لا شك فيهن : دعوة الوالد على ولده ، ودعوة المظلوم ، ودعوة المسافر " 
 أخرجه البخاري في الأدب المفرد وأحمد وأبو داود والترمذي وابن ماجه وحسنه الألباني """,
                "قال رسول اللهِ صلّى اللهُ عليهِ وسلَّم: (إِنَّ الله يُحِبُ إذا عَمِل أحَدُكُم عَمَلا أنْ يُتْقِنَه)\n",
                "قال رسول الله صلى الله عليه وسلم: (كُلُّكُم راعٍ وكُلُّكُم مسؤولٌ عن رعيتهِ)\n",
                "(سُئِلَتْ عائِشةُ عن خُلُقِ رسولِ اللهِ صلَّى اللهُ عليه وسلَّمَ، فقالَتْ: كان خُلُقُه القُرآنَ)\n",
                "(سُئِلَ البَرَاءُ أكانَ وجْهُ النبيِّ صَلَّى اللهُ عليه وسلَّمَ، مِثْلَ السَّيْفِ؟ قَالَ: لا بَلْ مِثْلَ القَمَرِ)\n",
                "قال رسول الله صلى الله عليه وسلم: (الَّذي يقرأُ القرآنَ وهو ماهرٌ به مع السَّفَرةِ الكِرامِ البَررةِ، والَّذي يقرأُ القرآنَ وهو عليه شاقٌّ فله أجران)\n",
                "قال رسول الله صلى الله عليه وسلم: (اقْرَؤُوا القُرْآنَ فإنَّه يَأْتي يَومَ القِيامَةِ شَفِيعًا لأَصْحابِهِ).\n",
                "قال رسول الله صلى الله عليه وسلم: (مَثَلُ المُؤْمِنِ الذي يَقْرَأُ القُرْآنَ، مَثَلُ الأُتْرُجَّةِ، رِيحُها طَيِّبٌ وطَعْمُها طَيِّبٌ، ومَثَلُ المُؤْمِنِ الذي لا يَقْرَأُ القُرْآنَ مَثَلُ التَّمْرَةِ، لا رِيحَ لها وطَعْمُها حُلْوٌ)\n",
                "قال رسول الله صلى الله عليه وسلم: (يقالُ لصاحِبِ القرآنِ: اقرأْ وارقَ ورتِّلْ، كما كنتَ تُرَتِّلُ في دارِ الدنيا، فإِنَّ منزِلَتَكَ عندَ آخِرِ آيةٍ كنتَ تقرؤُها)\n",
                "قال رسول الله صلى الله عليه وسلم: (إنَّ الذي ليسَ في جوفِهِ شيءٌ من القرآنْ كالبيتِ الخَرِبِ)\n",
                "قال رسول الله صلى الله عليه وسلم: (مَن تَوَضَّأَ لِلصَّلَاةِ فأسْبَغَ الوُضُوءَ، ثُمَّ مَشَى إلى الصَّلَاةِ المَكْتُوبَةِ، فَصَلَّاهَا مع النَّاسِ، أَوْ مع الجَمَاعَةِ، أَوْ في المَسْجِدِ غَفَرَ اللَّهُ له ذُنُوبَهُ)\n",
                "قال رسول الله صلى الله عليه وسلم: (لا يَتَوَضَّأُ رَجُلٌ مُسْلِمٌ فيُحْسِنُ الوُضُوءَ فيُصَلِّي صَلاةً إلَّا غَفَرَ اللَّهُ له ما بيْنَهُ وبيْنَ الصَّلاةِ الَّتي تَلِيها)",
                "قال رسول الله صلى الله عليه وسلم: (كَلِمَتانِ خَفِيفَتانِ علَى اللِّسانِ، ثَقِيلَتانِ في المِيزانِ، حَبِيبَتانِ إلى الرَّحْمَنِ، سُبْحانَ اللَّهِ وبِحَمْدِهِ، سُبْحانَ اللَّهِ العَظِيمِ)\n",
                "عن عمر بن الخطاب - رضي الله عنه - قال : سمعت رسول الله (صلي الله عليه وسلم) يقول \" انما الاعمال بالنيات وانما لكل امرئ ما نوي فمن كانت هجرته الي الله ورسوله فهجرته الي الله ورسوله ومن كانت هجرته لدنيا يصيبها او امراة ينكحها فهجرته الي ما هاجر اليه \"\n",
                "عن جابر – رضي الله عنه – قال : قال رسول الله ( صلي الله عليه وسلم ) \" مثل الصلوات الخمس كمثل نهر جار غمر علي باب أحدكم يغتسل منه كل يوم خمس مرات ",
                """عن أبي سعيد رضي الله عنه أن النبي صلى الله عليه وسلم قال: أيها الناس: إن ربكم واحد، وإن أباكم واحد، ألا لا فضل لعربي على أعجمي ولا لعجمي على عربي ولا لأحمر على أسود وأسود على أحمر إلا بالتقوى
 رواه أحمد
""",
                """عن عائشة رضي الله عنها قالت: كان رسول الله صلى الله عليه وسلم إذا تضور من الليل قال: لا إله إلا الله الواحد القهار، رب السموات والأرض وما بينهما العزيز الغفار
 رواه النسائي في عمل اليوم والليلة، وفي الكبرى، وصححه الألباني
""",
                """
                       قال صلى الله عليه وسلم: ((ما من شيء في الميزان أثقل من حسن الخلق)) 
                       رواه الترمذي (2002)
                       
                       """.trimIndent(),
                """قال صلى الله عليه وسلم: ((إن الرجل ليدرك بحسن خلقه درجات قائم الليل صائم النهار))
 رواه أبو داود (4798)
""",
                "رُوِي عن أنس بن مالك أنّه قال: (كانَ رسولُ اللَّهِ صلَّى اللَّهُ عليهِ وسلَّمَ يقولُ اللَّهمَّ إنِّي أعوذُ بِكَ منَ العَجزِ والكسلِ والجبنِ والبخلِ والهرَمِ وأعوذُ بِكَ من عذابِ القبرِ وأعوذُ بِكَ من فِتنةِ المحيا والمماتِ)\n",
                "قال الرسول صلى الله عليه وسلم: (مَن نَفَّسَ عن مُسلِمٍ كُرْبةً من كُرَبِ الدُّنيا، نَفَّسَ اللهُ عنه كُرْبةً من كُرَبِ يومِ القيامةِ، ومَن يسَّرَ على مُعسِرٍ، يسَّرَ اللهُ عليه في الدُّنيا والآخِرةِ، ومَن سَتَرَ على مُسلِمٍ، سَتَرَ اللهُ عليه في الدُّنيا والآخِرةِ، واللهُ في عَونِ العَبدِ ما كان العَبدُ في عَونِ أخيهِ. قال أبو داودَ: لم يذكُرْ عُثمانُ، عن أبي مُعاويةَ: ومَن يسَّرَ على مُعسِرٍ)\n",
                "قال الرسول صلى الله عليه وسلم: (إنَّ اللَّهَ حَرَّمَ علَيْكُم: عُقُوقَ الأُمَّهَاتِ، ووَأْدَ البَنَاتِ، ومَنَعَ وهَاتِ، وكَرِهَ لَكُمْ قيلَ وقالَ، وكَثْرَةَ السُّؤَالِ، وإضَاعَةَ المَالِ)\n",  // TODO kwatarnof
                """
                       ﴿وَما أَمرُ السّاعَةِ إِلّا كَلَمحِ البَصَرِ أَو هُوَ أَقرَبُ إِنَّ اللَّهَ عَلى كُلِّ شَيءٍ قَديرٌ﴾
                       في لمح البصر 
                       يتغير الكون ، وتقوم الساعه فما بالك بشدتك وضيقك وحزنك
                       أضواء الفرج قريبة 
                       
                       """.trimIndent(),
                """إِنَّ اللَّهَ وَمَلَائِكَتَهُ يُصَلُّونَ عَلَى النَّبِيِّ ۚ 
 يَا أَيُّهَا الَّذِينَ آمَنُوا صَلُّوا عَلَيْهِ وَسَلِّمُوا تَسْلِيمًا  ﷺ
""",
                """" حتى إِذَا ركِبا فِي السَّفِينةِ خَرقَها "
قد يكون في خرق سفينتك نجاتك
""",
                """
                       "إن لم يكن بك عليَّ غضبٌ فلا أبالي".
                       طاعة الله مفتاح رضاه واتقاء غضبه، ورضا الله وحده هو سبب رضا العبد وسعادة القلب
                       
                       """.trimIndent(),
                """
                       "الحمد لله الذي ردّ عليَّ روحي.
                       وعافاني في بدني.
                       وأذِن لي بذكره".
                       تذكروا النعم المنسية
                       
                       """.trimIndent(),
                """
                       أستغفرك من يأسي حين طال البلاء.
                       ومن سوء ظني حين تكالب الأعداء.
                       ومن نسيان سوابق الإحسان عند تأخر العطاء
                       
                       """.trimIndent(),
                """
                       قلَّت في المساجد الصفوف.
                       ورجعت المصاحف إلى الرفوف.
                       وبقيتَ أنتَ على العهد وفيا، ولازلت ذاكرا لربك بكرة وعشيا، فكنتَ عند ربك مرضيا.
                       #افتح_مصحفك
                       
                       """.trimIndent(),
                """
                       كان النبي ﷺ يقرؤها كل ليلة مع خواتيم سورة البقرة:
                       (ربنا ولا تحمِّلنا ما لا طاقة لنا به).
                       ربما كان صبرك على البلاء بسبب محافظتك على هذا الدعاء!
                       
                       """.trimIndent(),
                """
                       أول فهم الواقع عن طريق الصلة بالقرآن.
                       وأول الاتصال به: قراءة آياته، ثم تدبرها لفهم حلول الوحي لمشكلات الواقع.
                       عند هجر القرآن، يضل الإنسان طريق السكينة ويفقد الأمان.
                       #افتح_مصحفك
                       
                       """.trimIndent(),
                "فتح مصحفك اليوم يُبقي ما بينك وبين القرآن عامرا، وينزع عنك وصف الجفاء، ويعينك على حفظ عهد الثبات\n",
                """
                       لا ترفعْ دعاءك على مظنة الإجابة، بل على اليقين بالإجابة.
                       الله عند ظن عبده به، والله ما عوَّدك إلا خيرا
                       
                       """.trimIndent(),
                """
                       كيف اصل الي السلام الداخلي ؟
                       أن تعرف الله , فتحبه وترجوه وتخافه 
                       
                       """.trimIndent(),
                """
                       "وكذلك جعلناكم أمةً وسَطاً"
                       ضاع هذا الدين بين الغالى فيه والمجافى عنه"
                       الغالى صاحب إفراط والجافى صاحب تفريط
                       
                       """.trimIndent(),
                """حين تكون أقصى طموحات نبي :
" توفني مسلما " ، تعلم أن أفضل النعم : الثبات على الدين
""",
                """
                       ما أتعس من أضاع عمره و ما عرف ربه
                       ولو عرف ربه لأحبه
                       و لو أحبه ما آثر عليه غيره
                       """.trimIndent(),
                """
                       قال لصاحبه : شوقني الي الجنة ؟
                       
                       فأجاب : إذا كانت اول غمسة فيها تمحو من الذاكرة ألوان العذاب ، وبؤس الحياة ، فكيف بعيش الأبد ؟!!
                       
                       """.trimIndent(),
                """
                       أعانَ الله موسى وهارون في مواجهة طغيان فرعون بسلاح الذِّكر: ﴿ولا تنيا في ذكري﴾.
                       فقوة النفس في استعانتها بالله القوي العزيز
                       
                       """.trimIndent(),
                "وكم صرف الله عنك مِنَ الأذى الخفي، وأنت بضعف بصيرتك تبكي على فقدانه كالصبي!\n",
                "لو انكشف عنك حجاب الغيب، فرأيتٓ ما دفع الدعاء من بلاء وأورث من ثواب، لما فتر لسانك عن الدعاء، ولو لم يتحقق ما دعوتٓ به\n",
                "إن لم يكن بك عليَّ غضبٌ فلا أبالي" +
                        "طاعة الله مفتاح رضاه واتقاء غضبه، ورضا الله وحده هو سبب رضا العبد وسعادة القلب",
                """
                       أغلى الأمنيات وأعظم المستحيلات:
                       زيادة دقيقة واحدة في عُمْر من ماتفكم بين يديك اليوم من ساعات، يحسدك عليها الأموات، فلا تبددها فتكون عليك حسرات
                       
                       """.trimIndent(),
                """
                       أستغفرك من يأسي حين طال البلاء.
                       ومن سوء ظني حين تكالب الأعداءومن نسيان سوابق الإحسان عند تأخر العطاء
                       
                       """.trimIndent(),
                "هل فتحت مصحفك اليوم؟!\n",
                "" +
                        "كان النبي ﷺ يقرؤها كل ليلة مع خواتيم سورة البقرة:" +
                        "(ربنا ولا تحمِّلنا ما لا طاقة لنا به)" +
                        "ربما كان صبرك على البلاء بسبب محافظتك على هذا الدعاء!",
                """
                       أول فهم الواقع عن طريق الصلة بالقرآن.
                       وأول الاتصال به: قراءة آياته، ثم تدبرها لفهم حلول الوحي لمشكلات الواقع.
                       لذا عند هجر القرآن، يضل الإنسان طريق السكينة ويفقد الأمان
                       """.trimIndent(),
                "فتح مصحفك اليوم يُبقي ما بينك وبين القرآن عامرا، وينزع عنك وصف الجفاء، ويعينك على حفظ عهد الثبات.\n",
                """
                       (سلامّ هي حتى مطلع الفجر)..
                       معناها:
                       تشبَّث بكل لحظة قبل الرحيل!
                       
                       """.trimIndent(),
                "اللهم غيِّر حالنا مِنْ أمة (كغثاء السيل) إلى (خير أمة أخرِجت للناس)، واجعلنا من أسباب هذا التغيير.\n",
                """
                       ذاكر الله في الغافلين كالشجرة الخضراء وسط الهشيم.
                       وكالمقاتل الشجاع بين الفارِّين.
                       وهو تاج الصادقين.
                       
                       """.trimIndent(),
                """
                       كم واحداً ذكرته بالأمس في دعائك؟!
                       صاحب القلب الحي يتألم لغيره، فيدعو له.
                       وموتى القلوب لا يذكرون في دعائهم إلا أنفسهم: (أهمّتهم أنفسهم)
                       
                       """.trimIndent(),
                """
                       لمن طال بهم زمن البلاء:
                       تعامل مع البلاء على أنه سبب النجاة، وأنه لولا ثواب الصبر عليه، لما اجتزت الصراط، ولا عبرت إلى الجنة.
                       وإن فاتك أن تسبق غيرك بصالح الأعمال، فقد تجاوزت الجميع بصبرك على كل الأحوال
                       
                       """.trimIndent(),
                """
                       مع انقضاء دعائك كل ليلة، تفاءل وقل لنفسك:
                       قد أجيبت الدعوات، فأبشِر بما هو آت.
                       
                       """.trimIndent(),
                """
                       ﴿قَالَتْ يَالَيْتَنِي مِتُّ قَبْلَ هَذَا وَكُنْتُ نَسْيًا مَنْسِيًّا (23) فَنَادَاهَا مِنْ تَحْتِهَا أَلَّا تَحْزَنِي﴾:
                       عند أقصى اشتدادٍ للأزمة، يُرسِل الله إليك بشائر الفرَج ولطائف القدَر.
                       
                       """.trimIndent(),
                """
                       لا ترفعْ دعاءك على مظنة الإجابة، بل على اليقين بالإجابة.
                       الله عند ظن عبده به، والله ما عوَّدك إلا خيرا.
                       
                       """.trimIndent(),
                """
                       حريصون نحن على صيانة صورتنا أمام الناس حفاظا على سُمْعتنا.
                       ليتنا نحرص هذا الحرص مع الله.
                       
                       """.trimIndent(),
                """
                       اللهم ..
                       أغنني بك عمن سواك.
                       أرضني برضاك عني، فلا آسى على فقدان شيء.
                       آنِس وحشة روحي بلذة القرب منك
                       
                       """.trimIndent(),
                "ساعة بعد نزول الفرَج تنسي سنوات من الألم، فماذا عن أول ساعة بعد دخول الجَنة؟!\n",
                "من أعان ظالما سلّطه الله عليه، فكيف بما ينتظره غدا من عذاب حين يرجع إلى الله موقوفا بين يديه؟!\n",
                """
                       يا محتاج..
                       لا ترفع رأسك الليلة من سجودك قبل أن تشعر بروح الإجابة.
                       
                       """.trimIndent(),
                "\"من أخفى عن الناسِ -همّه- متوكلاً على الله كفاهُ الله ما أهمّهُ وأرضاه. \"\n",
                """
                       مفتاح الرضا:
                       معرفة العبد أن اختيار الله له خيرٌ من اختياره لنفسه
                       
                       """.trimIndent(),
                "اللهم لا تشغل قلوبنا بما ضمِنتَه لنا عما خلقتنا له.\n",
                """
                       سبحان من جعل من بعض الكلام -وهو أيسر شيء على الإنسان- دواء أو داء للقلوب، وشفاء للصدور.
                       القرآن دواء.
                       وذكر الناس داء.
                       
                       """.trimIndent(),
                """
                       "ومن اليقين ما تهوِّن به عَلِينا مصائب الدنيا"
                       من عظمت مصيبته في عينه، فهي علامة نقصان اليقين في قلبه
                       """.trimIndent(),
                """
                       قال ابن عمر رضي الله عنهما:
                       "لكل مؤمن دعوة مستجابة عند إفطاره، إما أن يعجَّل في دنياه، أو يُدَّخَر في آخرته
                       """.trimIndent(),
                """
                       حين تسمع دعاء النبي ﷺ:
                       "اللهمَّ لا عيش إلا عيش الآخرة".
                       كيف تأسى على ما فات من دنياك، أو تستسلم لما نزل من بلاياك!
                       
                       """.trimIndent(),
                "«صلاة الرجل تطوعا حيث لا يراه الناس تعدل صلاته على أعين الناس خمسا وعشرين» صحيح الجامع رقم: 3821\n",
                """
                       ﴿قد جاءكم بصائرُ من ربكم﴾
                       ضلال البعض اليوم، وحيرتهم تجاه تفسير الأحداث الجارية سببه: هجر القرآن قراءة وتدبرا
                       
                       """.trimIndent(),
                """ﻗﺎﻝ ﺣﺬﻳﻔﺔ ﺑﻦ ﺍﻟﻴﻤﺎﻥ:
 «ﻟﻴﺄﺗﻴﻦ ﻋﻠﻰ ﺍﻟﻨﺎﺱ ﺯﻣﺎﻥ ﻻ ﻳﻨﺠﻮ ﻓﻴﻪ ﺇﻻ ﺍﻟﺬﻱ ﻳﺪﻋﻮ ﺑﺪﻋﺎﺀ ﻛﺪﻋﺎﺀ ﺍﻟﻐﺮﻳﻖ»
""",
                "الفتنة تحوِّل بعض العمالقة أقزاما، وتحوِّل من ظنهم الناس أقزاما إلى عمالقة.\n",
                """
                       (يومئذ يتذكر الإنسان وأنّى له الذكرى).
                       اللهم ارزقنا تذكر أسباب النجاة قبل فوات الأوان.
                       وانتشِلنا من دائرة الغفلة والنسيان
                       
                       """.trimIndent(),
                """
                       "فطوبى للغرباء":
                       القابضين على جمر الحق مهما كانت التبعات.
                       السائرين على خطى الأنبياء مهما واجهوا العقبات
                       
                       """.trimIndent(),
                """
                       قال ابن تيمية:
                       «ومعصيةُ الكِبْر والعُجْب والرياء أعظمُ من معصية شُرْب الخمر، فالشارب الخاشع الخائف من ربه أقرب إلى رحمة ربه من الصائم المتكبِّر المُعْجَب المُرائي»
                       
                       """.trimIndent(),
                """
                       اربح ساعات من العبادة عن طريق نية يسيرة!
                       نم الليلة بنية التقوي على الاستيقاظ في السَّحَر للسحور، والاستغفار، وقيام الليل لمن كان من صفوة الأبرار
                       
                       """.trimIndent(),
                "من خاف زلة القدم بعد الثبات، فليجعل له حظا من عبادة السر والقُرُبات، وليحرِص عليها حتى الممات.\n",
                """
                       في غمرة الآلام قد ننسى أن المصائب اختبارات يقين، وسبب تمايز المؤمنين:
                       ومن اليقين ما تهوِّن به علينا مصائب الدنيا
                       
                       """.trimIndent(),
                """
                       سعادة العبد بما ربح من رضا مولاه، كفيلة بأن تمحو حزنه على ما فقد من دنياه
                       إن لم يكن بك عليَّ غضب فلا أبالي
                       
                       """.trimIndent(),
                "غدا تكتشف أن الجَنة أغلى بكثير مما بذلت، ومن عاين روعة الجزاء تمنى لو ضاعف العطاء.\n",
                "﴿ فَمَنْ كانَ يَرْجُوا لِقاءَ رَبِّهِ فَلْيَعْمَلْ عَمَلًا صالِحاً وَلا يُشْرِكْ بِعِبادَةِ رَبِّهِ أَحَداً ﴾ [الكهف: 110]\n",
                "بعض الهموم استدعاءٌ إجباريٌ للعودة إلى الله، وتقديمِ رضاه على ما سواه.\n",
                """
                       (إذ يقول لصاحبه لا تحزن إن الله معنا):
                       لم يقل:
                       لا تحزن فأنا رسول الله.
                       فحتى خير الخلق تبرأ من حوله وقوته إلى حول ربه وقوته..
                       فماذا عني وعنك؟!
                       
                       """.trimIndent(),
                """
                       والله ما أطلق عبدٌ بصره إلا حُرِم الخشوع ابتداء والانتظام في الصلوات انتهاء!
                       وأي شيء يبقى من دينك إذا ضاعت صلاتك؟!
                       
                       """.trimIndent(),
                "من ظنَّ أنه رجع من دعائه صفر اليدين، فما عرف ربه.\n",
                """
                       اللهم اجعلني ممن يئس منهم اليأس.
                       وخاف منهم الخوف.
                       واستسلم لهم الاستسلام
                       
                       """.trimIndent(),
                "واذكره حين يغفل الناس عن ذكره، يذكرك حين يغفل الناس عن وجعك (فاذكروني أذْكُركُم)\n",
                """
                       قال لي:
                       للصبر حدود!
                       قلت:
                       وقد يكون بغير حدود، ففي الحديث:
                       "ومن يتصبّر يُصبِّره الله".
                       وما عند الله من زاد، لا ينفد مهما جاد منه على العباد!
                       
                       """.trimIndent(),
                """
                       نشرك لمصائبك على صفحتك يُحزِن الصديق، ولا يُزيل الضيق.
                       ما رأيك أن تجرِّب الشكوى إلى ربك بدلا منها إلى صحبك؟!
                       
                       """.trimIndent(),
                """
                       استغفر الآن..
                       في الحديث عن النبي ﷺ:
                       "ما أَصْبَحْتُ غَدَاةً قَطُّ إِلا اسْتَغْفَرْتُ الله فيها مائة مَرَّة".
                       رواه الطبراني في الأوسط، هو في السلسلة الصحيحة.
                       والغداة: ما بين الفجر وشروق الشمس.
                       
                       """.trimIndent(),
                """
                       آفة أكثر الخلق: عدم تحمل تبعات الحق لا في عدم تمييز الحق من الباطل.
                       ادْعُ الله أن يعافيك من الآفتين:
                       "اللهم أرِنا الحق حقا، وارزقنا اتباعه".
                       
                       """.trimIndent(),
                """
                       وفِي لمح البصر، يغيِّر الله كل شيء..
                       إن الله على كل شيء قدير
                       
                       """.trimIndent(),
                """
                       وكما أن المصباح يحتاج إلى الزيت كي يضيء.
                       فكذلك القلب في حاجة للقرآن كي يستضيء، ومن غفلته يستفيق
                       
                       """.trimIndent(),
                "لا تحسبوه شرا لكم بل هو خيرٌ لكم\n",
                "صلاتنا عليه بعض ثمن الوقوف غدا على الحوض بين يديه\n",
                """
                       يا من بيده خزائن كل شيء..
                       أفرِغ على قلوبنا سكينة ورضا..
                       تهوِّن علينا كل شيء
                       
                       """.trimIndent(),
                "إذا أنعم الله عليك بنعمة، فثق أنها الأصلح لك، فلا تمدن عينيك إلى نعمة غيرك\n",
                "ألا يستفز جلَد الفجار وسعيهم به إلى النار.. ألا يستفز عجزَ الأبرار، ويستنهِض هِمَمهم نحو الجنة؟!\n",
                """
                       لكل منا أحزان!
                       لكن منا من ينحت جبل أحزانه بِمِعْوَل (القرآن) حتى يزيله.
                       ومنا من يستسلم لأحزانه حتى تُهلِكه
                       
                       """.trimIndent(),
                """
                       هل وجهت تحية المساء إلى شفيعك؟!
                       هل صليت عليه عشر مرات؟!
                       في الحديث:
                       "من صلى عليَّ حين يصبح عشرًا ، وحين يمسي عشرًا ، أدركته شفاعتي يوم القيامة"
                       
                       """.trimIndent(),
                """
                       ﴿ إذ أعجبتكم كثرتكُمْ فلم تُغْنِ عنكم شيئا..﴾
                       يا كل كاتب على صفحته أو حسابه:
                       ما فائدة أن يُعجَب الناس بحلاوة كلامك، بينما يكره الله سوء أفعالك وأحوالك؟!
                       
                       """.trimIndent(),
                """
                       ما أرحمك يا رب.
                       تتكرم فتعطي.
                       و تمنع فتحمي.
                       فلك الحمد على كل حال
                       
                       """.trimIndent(),
                """
                       من تعوّد التفريط في النوافل، ابتُلي بترك الفرائض!
                       النوافل سدٌّ منيع في وجه زلل الأقدام وزيغ القلوب.
                       اجعل لك نوافل لا تفرِّط بها مهما يكن.
                       
                       """.trimIndent(),
                """
                       أشكو إلى الله كما قد شكى ...
                       أولاد يعقوب إلى يوسف
                       قد مسَّني الضُّرُّ وأنت الذي ...
                       تعلم حالي وترى موقفي
                       
                       """.trimIndent(),
                """
                       فرحك بما ربحت من آخرتك كفيلٌ بأن يغمر حزنك على ما خسرتَ من دنياك.
                       في الحديث:
                       "ركعتا الفجر خير من الدنيا وما فيها"
                       
                       """.trimIndent(),
                """ ﴿ذَلِكَ تَأْوِيلُ مَا لَمْ تَسْطِعْ عَلَيْهِ صَبْرًا﴾[الكهف:82]:
تعلَّم فن الانتظار، واستقبِل أحداث الحياة بطول التأمل ونظرات الاعتبار""",
                """
                       ﴿ وَكانَ أبُوهُما صَالِحاً ﴾[الكهف:82]:
                       تبلى عظامك، وتذروك الرياح، ولا يزال أثر صلاحك باقيا في دنيا الناس عن طريق ذريتك.. اللهم ارزقنا هذا النسل المبارك.
                       
                       """.trimIndent(),
                """
                       ﴿فأراد ربك أن يبلغا أشدهما ويستخرجا كنزهما رحمة من ربك﴾[الكهف:82]:
                       قد يؤخِّر الله عنك الخير، لأنك لم تستعد لاستقباله بعد، ولو أتاك سريعا لفقدته سريعا، والدرس هنا: بعض التأخير فيه خير كثير
                       
                       """.trimIndent(),
                """
                       ربما كان بلاؤك بعض دوائك.
                       إذا كان سبب رجوعك إلى الله ومزيد اهتدائك.
                       (ولنذيقنهم من العذاب الأدنى دون العذاب الأكبر لعلهم يرجعون).
                       
                       """.trimIndent(),
                """
                       ﴿فَلا تُصَاحِبْنِي﴾[الكهف:76]:
                       إشارة إلى تواضع موسى عليه السلام، فقد رأى أن الرجل الصالح أعلى منه منْزِلة، وإلا لقال: (فلا أصاحبك) بدلا من قوله: (فلا تصاحبني)
                       
                       """.trimIndent(),
                "لم يعرف سبب وحشة قلبه وضيق صدره حتى فتح مصحفه اليوم!\n",
                """
                       ابتلاؤك الذي صبرت عليه اليوم هو:
                       ثمن الفرح والأمن الخالدين في الجنة غدا!
                       
                       """.trimIndent(),
                "ما رأيك أن تتخفف قليلا من متابعة الصفحات، لتحصِّل جرعات سكينة سماوية من الآيات؟\n",
                """
                       (كلا بل لا يخافون الآخرة):
                       لذا سيخافون في الآخرة!
                       الخوف من الله اليوم سبب النجاة غدا.
                       
                       """.trimIndent(),
                """في الحديث:
"عجبا لأمر المؤمن، إن أمره كلَّه له خير".
دقِّق في قول النبي صلى الله عليه وسلم:
 "كلَّه".
فحتى حُلمك الذي لم يكتمِل
ودعاؤك الذي لم يُستَجب على الوجه الذي تريد.
ورزقك الذي تأخَّر في الطريق.
كل هذا خيرٌ لك دون أن تشعر
""",
                """
                       (تولوا وأعينهم تفيض من الدمع حزنا ألا يجدوا ما ينفقون)
                       (تفيض)وليس(تدمع)؛
                       لشدة حزنهم على فوات طاعة الجهاد المفضي إلى الموت!
                       اللهم صدقا كصدق هؤلاء
                       
                       """.trimIndent(),
                """
                       (لا تخافا)..
                       لماذا؟!
                       (إنني معكما أسمع وأرى).
                       (لا تحزن).. 
                       لماذا؟
                       (إن الله معنا).
                       خلاصك من الخوف والحزن فقط في استجلاب معية الله بطاعته!
                       """.trimIndent(),
                """
     ربُّ شكور وعبدٌ غفول!
     صلاة ١٠ دقائق = صلاة ٨ ساعات!
     في الحديث:
     "من صلى العشاء في جماعة كان كقيام نصف الليل". 
     صحيح الجامع رقم:6342
     """.trimIndent(),
                """
                       ريحوا القلوب المتعبة بالقرآن.
                       سكِّنوا اضطرابها بسكينة الآيات.
                       داووا ضعفكم البشري باتصالكم بربكم القوي،
                       ليزوِّدكم بالثبات.
                       """.trimIndent(),
                """
                       أنت في زمن غربة الدين،
                       وثباتك فيه كالقبض على الجمر،
                       صعبٌ لكنه أجره عظيم،
                       وأجر الواحد بأجر خمسين صحابي.
                       هذا من أعظم حوافز الصبر وأسباب الثبات.
                       """.trimIndent(),
                """
                       ما أعطاك إلا ليدوم إقبالك عليه..
                       وما منعك الا ليستمر توجهك اليه..
                       فهو في كلا الحالين متعرِّف إليك، ومقبل عليك.
                       """.trimIndent(),
                """
                       قال الله تعالى:
                       "أنا عند ظن عبدي بي".
                       الله لكم كما تظنون.
                       فارفعوا سقف أحلامكم وطموحاتكم.
                       فإنما ترِدون على أكرم الأكرمين.
                       """.trimIndent(),
                """
                       لو تحررتَ قليلا من هاتفك المحمول، لبلغت علاقتك بالقرآن حدّها المأمول.
                       ولو تصفحت مصحفك كما تتصفح صفحتك، لختمت القرآن كل شهر بكل يُسْر.
                       """.trimIndent(),
                """
                       كلما رأيتَ مصحفا أمامك،
                       فكأنما سمعتَ مناديا يستنهِض إيمانك : الله يتكلم.
                       فافتح مصحفك لتسمع ما يقول الله.
                       """.trimIndent(),
                "من غاب عن صلاة الفجر، وواظب على مواعيد العمل، فليستح أن يكون رضا المخلوق لديه أهم من رضا الخالق!",
                """
     قال الله عن كتابه: 
     ﴿قد جاءكم بصائرُ من ربكم﴾
     ضلال البعض اليوم، وحيرتهم تجاه تفسير الأحداث الجارية سببه: هجر القرآن قراءة وتدبرا.
     """.trimIndent() //TODO العلماء
                ,
                """
                       الجُبْنُ خُلُقٌ مذمومٌ عند جميعِ الخَلْقِ، وأهلُ الجُبْنِ هم أهلُ سُوءِ الظَّنِّ باللهِ، وأهلُ الشَّجاعةِ والجُودِ هم أهلُ حُسْنِ الظَّنِّ باللهِ
                       ابن القيم
                       """.trimIndent(),
                """
                       لأن يَلقَى اللهَ العبدُ بكلِّ ذنبٍ ما خلا الشِّركَ به: خيرٌ له مِن أن يؤخِّرَ صلاةَ النَّهارِ إلى اللَّيلِ، وصلاةَ اللَّيلِ إلى النَّهارِ عُدوانًا عَمْدًا بلا عُذرٍ
                       ابن القيم
                       """.trimIndent(),
                """
                       أجمل أقوال ابن القيم عن الطاعة: فما حُفِظَتْ نعمةُ اللهِ بشيءٍ قطُّ مِثلِ طاعتِه، ولا حصَلَتْ فيها الزِّيادةُ بمِثلِ شُكرِه، ولا زالَتْ عنِ العبدِ بمِثلِ معصيتِه لرَبِّه
                       ابن القيم
                       """.trimIndent(),
                """
                       فالزُّهدُ فراغُ القلبِ مِن الدُّنيا، لا فراغُ اليدِ منها
                       ابن القيم
                       """.trimIndent(),
                """
                       وأكثرُ المعاصي إنَّما توَلُّدُها مِن فضولِ الكلامِ والنَّظرِ، وهما أوسَعُ مداخِلِ الشَّيطانِ؛ فإنَّ جارحتَيْهما لا يمَلَّانِ ولا يسأَمانِ، بخلافِ شهوةِ البطنِ
                       ابن القيم
                       """.trimIndent(),
                """
                       صلاة المنافقين صلاة أبدان، لا صلاة قلوب
                       ابن القيم
                       """.trimIndent(),
                """
                       إنو الخير ، فإنك لا تزال بخير ما نويت الخير
                       ابن حنبل
                       """.trimIndent(),
                """
                       إذا سكتَّ أنتَ، وسكتُّ أنا، فمتى يعرف الجاهلُ الصّحيحَ من السقيم
                       ابن حنبل
                       """.trimIndent(),
                """
                       إذا حار أمرك في شيئين، ولم تدري حيث الخطأ والصواب، فخالف هواك فإنّ الهوى يقود النفس إلى ما يعاب
                       الشافعي
                       """.trimIndent(),
                """
                       أثقل أخواني على قلبي؛ من يتكلف لي، وأتكلف له، وأحب أخواني إلى قلبي؛ من أكون معه، كما أكون وحدي
                       الشافعي
                       """.trimIndent()
            )
            val idx = Random().nextInt(notifications.size)
            return notifications[idx]
        }
}