package com.hazem.wazaker.Activites;

import android.content.Context;
import android.os.Bundle;
import android.widget.Button;

import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import com.hazem.wazaker.Adapters.NightAdapter;
import com.hazem.wazaker.Models.ZekeritemModel;
import com.hazem.wazkar.R;

import java.util.ArrayList;

public class NightAzkar extends AppCompatActivity {


    Context context ;
    Button copybtn;
    ArrayList<ZekeritemModel> nightItems;
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_night_azkar);


        RecyclerView recyclerView=findViewById(R.id.nightrec);

        copybtn=findViewById(R.id.copybtn);
        loadNightdata();


        LinearLayoutManager layoutManager = new LinearLayoutManager(this);
        recyclerView.setLayoutManager(layoutManager);
        NightAdapter adapter =new NightAdapter(nightItems,getBaseContext());
        recyclerView.setLayoutManager(layoutManager);
        recyclerView.setAdapter(adapter);
        recyclerView.setHasFixedSize(true);
    }



    private void loadNightdata(){
        nightItems = new ArrayList<>();
        nightItems.add(new ZekeritemModel(

                "أَعُوذُ بِالله السَّمِيعِ العَلِيِمِ مِنَ الشّيطَانِ الرّجِيمِ (بِسْمِ اللهِ الرَّحْمـَنِ الرَّحِيمِ , " +
                        "الْحَمْدُ للهِ رَبِّ الْعَالَمِينَ" +
                        " , الرَّحْمـنِ الرَّحِيمِ" +
                        " , مَـلِكِ يَوْمِ الدِّينِ , " +
                        "إِيَّاكَ نَعْبُدُ وإِيَّاكَ نَسْتَعِينُ ," +
                        " اهدِنَــــا الصِّرَاطَ المُستَقِيمَ ," +
                        " صِرَاطَ الَّذِينَ أَنعَمتَ عَلَيهِمْ غَيرِ المَغضُوبِ عَلَيهِمْ" +
                        " وَلاَ الضَّالِّينَ)" +"\n" +"\n" +
                        " (الفاتحة)",1));


        nightItems.add(new ZekeritemModel(
                        "(بِسْمِ اللّهِ الرَّحْمـنِ الرَّحِيمِ , الـم , ذَلِكَ الْكِتَابُ لاَ رَيْبَ فِيهِ هُدًى لِّلْمُتَّقِينَ ," +
                        " الَّذِينَ يُؤْمِنُونَ بِالْغَيْبِ " +"\n" +
                        "وَيُقِيمُونَ الصَّلاةَ " +
                        "وَمِمَّا رَزَقْنَاهُمْ يُنفِقُونَ ," +
                        " والَّذِينَ يُؤْمِنُونَ بِمَا أُنزِلَ إِلَيْك" +
                        "َ وَمَا أُنزِلَ مِن قَبْلِكَ " +"\n" +
                        "وَبِالآخِرَةِ هُمْ يُوقِنُونَ ," +
                        " أُوْلَـئِكَ عَلَى هُدًى مِّن" +"\n" +
                        " رَّبِّهِمْ " +
                        "وَأُوْلَـئِكَ هُمُ الْمُفْلِحُونَ)" +"\n" +"\n" +
                        " (البقرة:1-5)."


                ,1));


        nightItems.add(new ZekeritemModel(
                " بِسْمِ اللهِ الرَّحْمـَنِ الرَّحِيمِ" + "\n" +
                        " {اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ" +
                        " لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ" +
                        " وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء" +
                        " وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ}\n" + "\n" + "\n" + " [آية الكرسي – البقرة 255]" + "\n" +
                        "من قالها حين يصبح أجير من الجن حتى يمسى " +"\n" +
                        "ومن قالها حين يمسى أجير من الجن حتى" +"\n" +
                        " يصبح"

                ,1));

        nightItems.add(new ZekeritemModel(
                " ( آمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ ۚ" +
                        " كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ " +
                        "ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ" +
                        ". لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا لَهَا مَا كَسَبَتْ " +
                        "وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَّسِينَآ " +
                        "أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا " +
                        "رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا " +

                        "وَارْحَمْنَا أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِين )" + "\n" + "\n" +
                        " [البقرة 285 – 286]" + "\n" + "\n" +
                        "( مرة واحدة )"
                ,1));

        nightItems.add(new ZekeritemModel(
                "بسم الله الرحمن الرحيم" + "\n" + "\n" +
                        " قُلْ هُوَ اللَّهُ أَحَدِ،اللَّهُ الصَّمَدُِ،لَمْ يَلِدْ وَلَمْ يُولَدِْ، وَلَمْ يَكُن لَّهُ كُفُواً أَحَد" + "\n" + "\n" + "\n" + "( ثلاث مرات )" +
                        "\n",3));


        nightItems.add(new ZekeritemModel(


                "بسم الله الرحمن الرحيم" + "\n" + "\n" + "قُلْ أَعُوذُ بِرَبِّ الْفَلَق، مِن شَرِّ مَا خَلَقَِ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ،" +
                        " وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ" +
                        "\n" + "\n" + " ( ثلاث مرات ) ",3));

        nightItems.add(new ZekeritemModel(


                "بسم الله الرحمن الرحيم" + "\n" + "\n" +

                        "قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ.\n" +
                        "\n" +
                        "( ثلاث مرات )" + "\n" + "من قالها حين يصبح وحين يمسى كفته من كل شيء (الإخلاص والمعوذتين)\n" +
                        "\n"


                ,3));
        nightItems.add(new ZekeritemModel(

                 "اللّهُـمَّ بِكَ أَمْسَـينا وَبِكَ أَصْـبَحْنا، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ الْمَصِيرُ.\n" +"\n" +"( ثلاث مرات )",3));


        nightItems.add(new ZekeritemModel(

                        "أَمْسَيْنَا عَلَى فِطْرَةِ الإسْلاَم" +
                        "ِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، " +
                        "وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ" + "\n" + "\n" +
                        "( ثلاث مرات )"

                ,3));
        nightItems.add(new ZekeritemModel(
                "أَمْسَيْـنا وَأَمْسـى المـلكُ لله وَالحَمدُ لله، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير،" +
                        " رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذهِ اللَّـيْلَةِ وَخَـيرَ ما بَعْـدَهـا، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذهِ اللَّـيْلةِ وَشَرِّ ما بَعْـدَهـا،" +
                        " رَبِّ أَعـوذُ بِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر" + "\n" + "\n" +
                        "( مرة واحدة )"

                ,1));
        nightItems.add(new ZekeritemModel(
                "اللّهُـمَّ ما أَمسى بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر"
                        + "\n"  + "\n" + "\n"+"( ثلاث مرات )"

                        + "\n"
                        +"من قرأها حين يصبح فقد أدى شكر يومه ومن قرأها حين يمسي فقد ادى شكر ليلته - رواه ابو داوود"


                ,3));
        nightItems.add(new ZekeritemModel(
                "اللّهُـمَّ إِنِّـي أَمسيتُ أُشْـهِدُك " +
                        "، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك، وَمَلَائِكَتَكَ، وَجَمـيعَ خَلْـقِك،" +
                        " أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك" + "\n" + "\n" +

                        "\n" +  "من قال حين يصبح او يمسي اربع مرات اعتقه الله من النار- رواه ابو داوود"

                ,4));

        nightItems.add(new ZekeritemModel(
                "رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـا" + "\n" + "\n" +
                        "ً( ثلاث مرات )" +
                        "\n" + "\n" + "من قالها حين يصبح وحين يمسى كان حقا على الله أن يرضيه يوم القيامة"




                ,3));


        nightItems.add(new ZekeritemModel(
                "اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ، خَلَقْتَنـي وَأَنا عَبْـدُك، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت، أَعـوذُ بِكَ مِنْ شَـرِّ ما صَنَـعْت،" +
                        " أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ" + "\n"+
                        "(ثلاثا)"

                        + "\n" + "\n" + "\n" + "من قالها موقنا بها حين يمسى ومات من ليلته دخل الجنة وكذلك حين يصبح"


                ,3));


        nightItems.add(new ZekeritemModel(


                "سُبْحـانَ اللهِ وَبِحَمْـدِهِ عَدَدَ خَلْـقِه ، وَرِضـا نَفْسِـه ، وَزِنَـةَ عَـرْشِـه ، وَمِـدادَ كَلِمـاتِـه" + "\n" +"\n" +
                        "( ثلاث مرات )" ,3));

        nightItems.add(new ZekeritemModel(
                        "اللّهُـمَّ عافِـني في بَدَنـي ، اللّهُـمَّ عافِـني في سَمْـعي ، اللّهُـمَّ عافِـني في بَصَـريَ" +
                        "\n" +"\n" +
                        "( ثلاث مرات )"




                , 3));


        nightItems.add(new ZekeritemModel(
                "اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة، " +
                        "اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي،" +
                        " اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي، " +
                        "اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي وَعَن يَمـيني وَعَن شِمـالي،" +
                        " وَمِن فَوْقـي، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي" + "\n" + "\n" +
                        " مرة واحدة"
                ,1));


        nightItems.add(new ZekeritemModel(
                "بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم" + "\n" + "\n" +
                        "( ثلاث مرات )"+"\n" +"\"من قالها ثلاثا اذا اصبح وثلاثا اذا امسى لم يضره شيئ - رواه ابن ماجه\"",3));




        nightItems.add(new ZekeritemModel(
                "اللّهُـمَّ إِنّـي أَعـوذُ بِكَ مِنَ الْكُـفر، وَالفَـقْر، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر، لا إلهَ إلاّ أَنْـتَ" + "\n" + "\n" +
                        "( ثلاث مرات )"

                      ,3));
        nightItems.add(new ZekeritemModel(
                        "يَا حَيُّ يَا قيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَلاَ تَكِلْنِي إلَى نَفْسِي طَـرْفَةَ عَيْنٍ" + "\n" + "\n" +
                        "( ثلاث مرات )"

                ,3));


        nightItems.add(new ZekeritemModel(
                "حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم"
                        + "\n" + "\n" + "( سبع مرات )" +  "\n" + "من قالها كفاه الله ما أهمه من أمر الدنيا والأخرة "


                ,7));


        nightItems.add(new ZekeritemModel(
                "رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـاً" + "\n" + "\n" + "( ثلاث مرات )"


                        +  "\n" + "من قالها حين يصبح وحين يمسى كان حقا على الله أن يرضيه يوم القيامة"

                ,3));

        nightItems.add(new ZekeritemModel(

                "(اللهم إني أعوذ بك من الهم والحزن ، وأعوذ بك من العجز والكسل ، وأعوذ بك من الجبن والبخل ،" +
                        " وأعوذ بك من غلبة الدين وقهر الرجال)" +"\n" +"\n" +
                        " (ثلاثا)"+"\n" +

                        "إذا قُلْتَهُ أَذْهَبَ اللهُ تعالى هَمَّكَ وقَضَى عنك دَيْنَكَ"


                ,3));


        nightItems.add(new ZekeritemModel(
                "اللَّهُمَّ أَنْتَ رَبِّي لا إِلَهَ إِلا أَنْتَ، عَلَيْكَ تَوَكَّلْتُ،" +
                        " وَأَنْتَ رَبُّ الْعَرْشِ الْعَظِيمِ، مَا شَاءَ اللَّهُ كَانَ، وَمَا لَمْ يَشَأْ لَمْ يَكُنْ،" +
                        " وَلا حَوْلَ وَلا قُوَّةَ إِلا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ، " +
                        "أَعْلَمُ أَنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ،" +
                        " وَأَنَّ اللَّهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي،" +
                        " وَمِنْ شَرِّ كُلِّ دَابَّةٍ أَنْتَ آخِذٌ بِنَاصِيَتِهَا، إِنَّ رَبِّي عَلَى صِرَاطٍ مُسْتَقِيمٍ" + "\n" + "\n" +
                        " مرة واحدة"

                ,1));

        nightItems.add(new ZekeritemModel(

                "لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءِ قَدِير" + "\n" + "\n" +
                        " ( 100 مرة )"
                        + "\n" + "\n" + "كانت له عدل عشر رقاب، وكتبت له مئة حسنة، ومحيت عنه مئة سيئة، وكانت له حرزا من الشيطان"
                ,100));
        nightItems.add(new ZekeritemModel(

                "اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ على نَبِيِّنَا مُحمَّد" + "\n" + "\n" +
                        "( عشر مرات )" + "\n" + "\n" + "من صلى علي حين يصبح وحين يمسى أدركته شفاعتي يوم القيامة",10));
        nightItems.add(new ZekeritemModel(


                "\n" + "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا طَيِّبًا، وَعَمَلًا مُتَقَبَّلًا" + "\n" + "\n" +
                        "( ثلاث مرات )"
                ,3));


        nightItems.add(new ZekeritemModel(
                "\n" + "سُبْحـانَ اللهِ وَبِحَمْـدِه" + "\n" +
                        " ( 100 مرة )" + "\n" + "\n" + "من قالها غُفِرَتْ له ذنوبُه ولو كانت مثلَ زبدِ البحرِ"

                ,100));
        nightItems.add(new ZekeritemModel(
                "(اللهم صل على سيدنا محمد عبدك ورسولك النبي الأمي وعلى آله وصحبه وسلم تسليما عدد ما أحاط به علمك وخط به قلمك وأحصاه كتابك , وارض اللهم عن ساداتنا أبي بكر وعمر وعثمان وعلي , وعن الصحابة أجمعين , وعن التابعين وتابعيهم بإحسان إلى يوم الدين) (سبحان ربك رب العزة عما يصفون , وسلام على المرسلين , والحمد لله رب العالمين)\n"

                ,1));
        nightItems.add(new ZekeritemModel(
                "ورد الرابطة"+ "\n" + "\n" +
                        "\"قُلِ اللَّهُمَّ مَّالِكَ المُلْكِ تُؤْتِي المُلْكَ مَنْ تَشَاءُ وَتَنْزِعُ المُلْكَ مِمَّنَ تَشَاءُ وَتُعِزُّ مَنْ تَشَاءُ وَتُذِلُّ مَنْ تَشَاءُ بِيَدِكَ الخَيْرُ إِنَّكَ عَلَى كُلِّ شَيْءٍ قَدِيرٍ* تُولِجُ اللَّيْلَ فِي النَّهَارِ وَتُولِجُ النَّهَارَ فِي اللَّيْلَ وَتُخْرِجُ الحَيَّ مِنَ المَيِّتِ وَتُخْرِجُ المَيِّتُ مِنَ الحَيِّ وَتَرْزُقُ مَنْ تَشَاءُ بِغَيْرِ حِسَابٍ \"" +
                        "\n" +"\n" +
                        "اللهم هذا إقبال ليلك ، وإدبار نهارك ، وأصوات دعاتك ، فاغفر لي\""
                ,1));

        nightItems.add(new ZekeritemModel(
                "ثم يستحضر صور من يعرف من إخوانه في ذهنه ويستشعر الصلة الروحية بينه وبين من لم يعرفه منهم. ثم يدعو لهم بمثل هذا الدعاء:\n" +"\n"  +
                        "\" اللهم إنك تعلم أن هذه القلوب قد اجتمعت على محبتك والتقت على طاعتك، وتوحدت على دعوتك" +
                        "، وتعاهدت على نصرة شريعتك فوثق الله رابطتها" +
                        " وأدم ودها واهدها سبلها، واملأها بنورك الذي لا يخبو، واشرح صدورها بفيض الإيمان بك، وجميل التوكل عليك، " +
                        "وأحيها بمعرفتك، وأمتها على الشهادة في سبيلك، إنك نعم المولى ونعم النصير،" +
                        " اللهم "   +
                        "آمين وصل اللهم على سيدنا محمد وعلى آله" +"\n"  +
                        " وصحبه وسلم \"",1)); }


}
