package com.example.wazkar;

import android.annotation.SuppressLint;
import android.os.Bundle;
import android.view.View;
import android.widget.TextView;

import androidx.appcompat.app.AppCompatActivity;
import androidx.viewpager.widget.ViewPager;

import com.badoualy.stepperindicator.StepperIndicator;
import com.example.wazkar.Adapters.SlidePagerAdapter;

import at.markushi.ui.CircleButton;

import static com.example.wazkar.Adapters.RecAdapter.btnid;


public class Azkar extends AppCompatActivity {

    CircleButton buttonplus;
    TextView textViewplus;
    String[] mor;
    int[] mor2;


    // TODO azkar
    {
        //TODO MORNING
        if (btnid.equals("أذكار الصباح ")) {
            //// TODO: 4/18/20 Try to use Model(ZekerItem for ex ) it hold zeker text , and count of times for ex ZekerItem("abc" , 3) this help you to add more features
            mor = new String[]{" أعوذ بالله من الشيطان الرجيم" + "\n" +
                    " {اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ" +
                    " لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ" +
                    " وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء" +
                    " وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ}\n" + "\n" + "\n" + " [آية الكرسي – البقرة 255]" + "\n" +
                    "من قالها حين يصبح أجير من الجن حتى يمسى ومن قالها حين يمسى أجير من الجن حتى يصبح" +

                    "\n" + "\n",


                    "بسم الله الرحمن الرحيم" + "\n" + "\n" +
                            " {قُلْ هُوَ اللَّهُ أَحَد(1)اللَّهُ الصَّمَدُ*لَمْ يَلِدْ وَلَمْ يُولَدْ (2) وَلَمْ يَكُن لَّهُ كُفُواً أَحَد(3)" + "\n" + "\n" + "\n" + "( ثلاث مرات )" +
                            "\n",


                    "بسم الله الرحمن الرحيم" + "\n" + "\n" + "قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ (1) مِن شَرِّ مَا خَلَقَ (2) وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ (3) وَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقَد (4) وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ(5)" +
                            "\n" + "\n" + " ( ثلاث مرات ) ",


                    "بسم الله الرحمن الرحيم" + "\n" + "\n" +

                            "قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ.\n" +
                            "\n" +
                            "( ثلاث مرات )" + "\n" + "\n" + "\n" + "من قالها حين يصبح وحين يمسى كفته من كل شيء (الإخلاص والمعوذتين)\n" +
                            "\n"

                    ,

                    "أَصْـبَحْنا وَأَصْـبَحَ المُـلْكُ لله وَالحَمدُ لله، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد،" +
                            " وهُوَ على كلّ شَيءٍ قدير، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم وَخَـيرَ ما بَعْـدَه، " +
                            "وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم وَشَرِّ ما بَعْـدَه" +
                            "، رَبِّ أَعـوذُ بِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر،" +
                            " رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر" +
                            "\n" + "\n" + "( مرة واحدة )" + "\n" + "\n"

                    ,
                    "اللّهُـمَّ بِكَ أَصْـبَحْنا وَبِكَ أَمْسَـينا، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ النُّـشُور" +
                            "\n" + "\n" +
                            "أَصْبَـحْـنا عَلَى فِطْرَةِ الإسْلاَمِ" +
                            "، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّم" +
                            "َ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ"
                            + "\n" + "\n" + " ( مرة واحدة )",


                    "اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ، خَلَقْتَنـي وَأَنا عَبْـدُك، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت،" +
                            " أَعـوذُ بِكَ مِنْ شَـرِّ ما صَنَـعْت، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ ( مرة واحده )"

                            + "\n" + "\n" + "\n" + "من قالها موقنا بها حين يمسى ومات من ليلته دخل الجنة وكذلك حين يصبح"

                    , "(اللهم إني أصبحت أشهدك، وأشهد حملة عرشك، وملائكتك، وجميع خلقك، أنك أنت الله لا إله إلا أنت، وحدك لا شريك لك، وأن محمداً عبدك ورسولك)" + "\n" +


                    "\n" + "\n" + "من قالها ثلاثا أعتقه الله  من النار"


                    ,


                    "اللّهُـمَّ ما أَصْبَـَحَ بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر " +
                            "\n" + "\n" +
                            " ( مرة واحدة )   " +
                            "\n" + "\n" +

                            "من قالها حين يصبح أدى شكر يومه",

                    "رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـا" + "\n" + "\n" +

                            " ( ثلاث مرات )" + "\n" + "\n" + "من قالها حين يصبح وحين يمسى كان حقا على الله أن يرضيه يوم القيامة"
                    ,

                    "حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم"
                            + "\n" + "\n" + "( سبع مرات )" + "\n" + "\n" + "من قالها كفاه الله ما أهمه من أمر الدنيا والأخرة "


                    ,


                    "بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم " + "\n" + "\n" + " ثلاث  مرات " + "\n"


                    ,

                    "\n" + "سُبْحـانَ اللهِ وَبِحَمْـدِهِ عَدَدَ خَلْـقِه، وَرِضـا نَفْسِـه، وَزِنَـةَ عَـرْشِـه، وَمِـدادَ كَلِمـاتِـه" + "\n" +
                            "\n" + "\n" + " ( ثلاث  مرات ) " + "\n" + "\n" +
                            "اللّهُـمَّ عافِـني في بَدَنـي، اللّهُـمَّ عافِـني في سَمْـعي، اللّهُـمَّ عافِـني في بَصَـري، لا إلهَ إلاّ أَنْـتَ" + "\n" + "\n" + "\n" + "( ثلاث  مرات ) "


                    ,
                    "اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني " +
                            "وَدُنْـيايَ وَأهْـلي وَمالـي، اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي، اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي وَعَن يَمـيني وَعَن شِمـالي" +
                            "، وَمِن فَوْقـي، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي" + "\n" + "\n" + "\n" +
                            " ( مرة واحدة )" + "\n"

                    ,


                    "اللَّهُمَّ إِنَّا نَعُوذُ بِكَ مِنْ أَنْ نُشْرِكَ بِكَ شَيْئًا نَعْلَمُهُ، وَنَسْتَغْفِرُكَ لِمَا لَا نَعْلَمُهُ" + "\n" + "\n" +
                            " ( ثلاث مرات )" + "\n" + "\n" + "\n" + "أَعـوذُ بِكَلِمـاتِ اللّهِ التّـامّـاتِ مِنْ شَـرِّ ما خَلَـق" + "\n" + "\n" +
                            "( ثلاث مرات )"
                    ,

                    "أسْتَغْفِرُ اللهَ العَظِيمَ الَّذِي لاَ إلَهَ إلاَّ هُوَ، الحَيُّ القَيُّومُ، وَأتُوبُ إلَيه" + "\n" + "\n" +
                            "( ثلاث مرات )"
                            + "\n" + "\n"
                            + "يَا رَبِّ، لَكَ الْحَمْدُ كَمَا يَنْبَغِي لِجَلَالِ وَجْهِكَ، وَلِعَظِيمِ سُلْطَانِكَ" + "\n" + "\n" +
                            "( ثلاث مرات )"
                    ,
                    "لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءِ قَدِير" + "\n" + "\n" +
                            " ( 100 مرة )"
                            + "\n" + "\n" + "كانت له عدل عشر رقاب، وكتبت له مئة حسنة، ومحيت عنه مئة سيئة، وكانت له حرزا من الشيطان"

                    ,
                    "اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ على نَبِيِّنَا مُحمَّد" + "\n" + "\n" +
                            "( عشر مرات )" + "\n" + "\n" + "من صلى علي حين يصبح وحين يمسى أدركته شفاعتي يوم القيامة"

                    ,


                    "\n" + "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا طَيِّبًا، وَعَمَلًا مُتَقَبَّلًا" + "\n" + "\n" +
                            "( ثلاث مرات )"
                    ,

                    "سُبْحـانَ اللهِ وَبِحَمْـدِه" + "\n" + "\n" +
                            " ( 100 مرة )" + "\n" + "\n" + "من قالها غُفِرَتْ له ذنوبُه ولو كانت مثلَ زبدِ البحرِ"


            };


        }
        //TODO EVENING AZKAR
        else if (btnid.equals("أذكار المساء")) {


            mor = new String[]{" أعوذ بالله من الشيطان الرجيم" + "\n" +
                    " {اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ" +
                    " لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ" +
                    " وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء" +
                    " وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ}\n" + "\n" + "\n" + " [آية الكرسي – البقرة 255]" + "\n" +
                    "من قالها حين يصبح أجير من الجن حتى يمسى ومن قالها حين يمسى أجير من الجن حتى يصبح." +


                    "\n" + "\n", " ( آمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ ۚ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ " +
                    "ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ" +
                    ". لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا لَهَا مَا كَسَبَتْ " +
                    "وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَّسِينَآ " +
                    "أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا " +
                    "رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا " +

                    "وَارْحَمْنَا أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِين )" + "\n" + "\n" +
                    " [البقرة 285 – 286]" + "\n" + "\n" +
                    "( مرة واحدة )"

                    ,


                    "بسم الله الرحمن الرحيم" + "\n" + "\n" +
                            " {قُلْ هُوَ اللَّهُ أَحَد(1)اللَّهُ الصَّمَدُ*لَمْ يَلِدْ وَلَمْ يُولَدْ (2) وَلَمْ يَكُن لَّهُ كُفُواً أَحَد(3)" + "\n" + "\n" + "\n" + "( ثلاث مرات )" +
                            "\n",


                    "بسم الله الرحمن الرحيم" + "\n" + "\n" + "قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ (1) مِن شَرِّ مَا خَلَقَ (2) وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ (3) وَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقَد (4) وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ(5)" +
                            "\n" + "\n" + " ( ثلاث مرات ) ",


                    "بسم الله الرحمن الرحيم" + "\n" + "\n" +

                            "قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ.\n" +
                            "\n" +
                            "( ثلاث مرات )" + "\n" + "\n" + "\n" + "من قالها حين يصبح وحين يمسى كفته من كل شيء (الإخلاص والمعوذتين)\n" +
                            "\n"

                    ,

                    "أَمْسَيْـنا وَأَمْسـى المـلكُ لله وَالحَمدُ لله، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير،" +
                            " رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذهِ اللَّـيْلَةِ وَخَـيرَ ما بَعْـدَهـا، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذهِ اللَّـيْلةِ وَشَرِّ ما بَعْـدَهـا،" +
                            " رَبِّ أَعـوذُ بِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر" + "\n" + "\n" +
                            "( مرة واحدة )"

                    ,
                    "اللّهُـمَّ إِنِّـي أَمسيتُ أُشْـهِدُك " +
                            "، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك، وَمَلَائِكَتَكَ، وَجَمـيعَ خَلْـقِك،" +
                            " أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك" + "\n" + "\n" +

                            "\n" + "\n" + "من قالها ثلاثا أعتقه الله من النار"

                    ,
                    "رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـا" + "\n" + "\n" +
                            "ً( ثلاث مرات )" +
                            "\n" + "\n" + "من قالها حين يصبح وحين يمسى كان حقا على الله أن يرضيه يوم القيامة"


                    ,
                    "اللّهُـمَّ ما أَمسى بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر" + "\n" +

                            "\n" + "\n" + "من قالها كفاه الله ما أهمه من أمر الدنيا والأخرة"
                    ,
                    "اللّهُـمَّ بِكَ أَمْسَـينا وَبِكَ أَصْـبَحْنا، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ الْمَصِيرُ.\n" +
                            "\n" +

                            "\n" +
                            "أَمْسَيْنَا عَلَى فِطْرَةِ الإسْلاَم" +
                            "ِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، " +
                            "وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ" + "\n" + "\n" +
                            "( مرة واحدة )"

                    , "اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ، خَلَقْتَنـي وَأَنا عَبْـدُك، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت، أَعـوذُ بِكَ مِنْ شَـرِّ ما صَنَـعْت،" +
                    " أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ" + "\n" + "\n" +
                    "( مرة واحدة )" +
                    "\n" + "\n" + "من قالها موقنا بها حين يمسى ومات من ليلته دخل الجنة وكذلك حين يصبح"


                    ,


                    "سُبْحـانَ اللهِ وَبِحَمْـدِهِ عَدَدَ خَلْـقِه ، وَرِضـا نَفْسِـه ، وَزِنَـةَ عَـرْشِـه ، وَمِـدادَ كَلِمـاتِـه" + "\n" +
                            "( ثلاث مرات )" +
                            "\n" +

                            "\n" +
                            "اللّهُـمَّ عافِـني في بَدَنـي ، اللّهُـمَّ عافِـني في سَمْـعي ، اللّهُـمَّ عافِـني في بَصَـري ، لا إلهَ إلاّ أَنْـتَ" +
                            "\n" +
                            "( ثلاث مرات )"


                    ,

                    "اللّهُـمَّ عافِـني في بَدَنـي ، اللّهُـمَّ عافِـني في سَمْـعي ، اللّهُـمَّ عافِـني في بَصَـري ، لا إلهَ إلاّ أَنْـتَ" + "\n" + "\n" +
                            "( ثلاث مرات )"


                    , "اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة، " +
                    "اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي،" +
                    " اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي، " +
                    "اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي وَعَن يَمـيني وَعَن شِمـالي،" +
                    " وَمِن فَوْقـي، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي" + "\n" + "\n" +
                    " مرة واحدة"
                    ,
                    "بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم" + "\n" + "\n" +
                            "( ثلاث مرات )"
                            + "\n" + "\n" + "اللّهُـمَّ إِنّـي أَعـوذُ بِكَ مِنَ الْكُـفر، وَالفَـقْر، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر، لا إلهَ إلاّ أَنْـتَ" + "\n" + "\n" +
                            "( ثلاث مرات )"

                    ,
                    "حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم"
                            + "\n" + "\n" + "( سبع مرات )" + "\n" + "\n" + "من قالها كفاه الله ما أهمه من أمر الدنيا والأخرة "


                    ,


                    "رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـاً" + "\n" + "\n" + "( ثلاث مرات )"


                            + "\n" + "\n" + "من قالها حين يصبح وحين يمسى كان حقا على الله أن يرضيه يوم القيامة"

                    ,

                    "يَا حَيُّ يَا قيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَلاَ تَكِلْنِي إلَى نَفْسِي طَـرْفَةَ عَيْنٍ" + "\n" + "\n" +
                            "( ثلاث مرات )"

                    ,


                    "اللّهُـمَّ عالِـمَ الغَـيْبِ وَالشّـهادَةِ فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كـلِّ شَـيءٍ وَمَليـكَه ، " +
                            "أَشْهَـدُ أَنْ لا إِلـهَ إِلاّ أَنْت ، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي وَمِن شَـرِّ الشَّيْـطانِ وَشِرْكِهِ ، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم" + "\n" + "\n" +
                            "( مرة واحدة )"
                    ,

                    "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْهَمِّ وَالْحَزَنِ، وَأَعُوذُ بِكَ مِنْ الْعَجْزِ وَالْكَسَلِ، وَأَعُوذُ بِكَ مِنْ الْجُبْنِ وَالْبُخْلِ، وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ، وَقَهْرِ الرِّجَالِ" + "\n" + "\n" +
                            " ( ثلاث مرات )"
                            + "\n" + "\n" + "\n"
                            + "اللَّهُمَّ إِنَّا نَعُوذُ بِكَ مِنْ أَنْ نُشْرِكَ بِكَ شَيْئًا نَعْلَمُهُ، وَنَسْتَغْفِرُكَ لِمَا لَا نَعْلَمُه" +
                            "\n" + "\n" +
                            " ( ثلاث مرات )"

                    ,


                    "اللَّهُمَّ أَنْتَ رَبِّي لا إِلَهَ إِلا أَنْتَ، عَلَيْكَ تَوَكَّلْتُ،" +
                            " وَأَنْتَ رَبُّ الْعَرْشِ الْعَظِيمِ، مَا شَاءَ اللَّهُ كَانَ، وَمَا لَمْ يَشَأْ لَمْ يَكُنْ،" +
                            " وَلا حَوْلَ وَلا قُوَّةَ إِلا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ، " +
                            "أَعْلَمُ أَنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ،" +
                            " وَأَنَّ اللَّهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي،" +
                            " وَمِنْ شَرِّ كُلِّ دَابَّةٍ أَنْتَ آخِذٌ بِنَاصِيَتِهَا، إِنَّ رَبِّي عَلَى صِرَاطٍ مُسْتَقِيمٍ" + "\n" + "\n" +
                            " مرة واحدة"

                    ,

                    "لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءِ قَدِير" + "\n" + "\n" +
                            " ( 100 مرة )"
                            + "\n" + "\n" + "كانت له عدل عشر رقاب، وكتبت له مئة حسنة، ومحيت عنه مئة سيئة، وكانت له حرزا من الشيطان"
                    ,

                    "اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ على نَبِيِّنَا مُحمَّد" + "\n" + "\n" +
                            "( عشر مرات )" + "\n" + "\n" + "من صلى علي حين يصبح وحين يمسى أدركته شفاعتي يوم القيامة",


                    "\n" + "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا طَيِّبًا، وَعَمَلًا مُتَقَبَّلًا" + "\n" + "\n" +
                            "( ثلاث مرات )"
                    ,


                    "\n" + "سُبْحـانَ اللهِ وَبِحَمْـدِه" + "\n" +
                            " ( 100 مرة )" + "\n" + "\n" + "من قالها غُفِرَتْ له ذنوبُه ولو كانت مثلَ زبدِ البحرِ"

            };
        }
        //TODO AZKAR MASJED
        else if (btnid.equals("أذكار المسجد")) {
            mor = new String[]{

                    "دُعَاءُ الذَّهَابِ إلَى المَسْجِدِ" + "\n" + "\n" +

                            "اللّهُـمَّ اجْعَـلْ في قَلْبـي نورا ، وَفي لِسـاني نورا،" +
                            " وَاجْعَـلْ في سَمْعي نورا، وَاجْعَـلْ في بَصَري نورا،" +
                            " وَاجْعَـلْ مِنْ خَلْفي نورا، وَمِنْ أَمامـي نورا،" +
                            " وَاجْعَـلْ مِنْ فَوْقـي نورا ، وَمِن تَحْتـي نورا" +
                            " اللّهُـمَّ أَعْطِنـي نورا"

                    , "دُعَاءُ دُخُولِ المَسْجِدِ" + "\n" + "\n" +
                    "يَبْدَأُ بِرِجْلِهِ اليُمْنَى، وَيَقُولُ:" + "\n" +
                    "أَعوذُ باللهِ العَظيـم وَبِوَجْهِـهِ الكَرِيـم " +
                    "وَسُلْطـانِه القَديـم مِنَ الشّيْـطانِ الرَّجـيم، بِسْمِ اللَّهِ، وَالصَّلاةُ وَالسَّلامُ عَلَى رَسُولِ الله،" +
                    " اللّهُـمَّ افْتَـحْ لي أَبْوابَ رَحْمَتـِك. "


                    , "دُعَاءُ الخُرُوجِ مِنَ المَسْجِدِ" + "\n" + "\n" +
                    "يَبْدَأُ بِرِجْلِهِ الْيُسْرَى، وَيَقُولُ:" + "\n" +
                    "بِسْـمِ اللَّـهِ وَالصَّلاةُ وَالسَّلامُ عَلَى رَسُولِ اللَّهِ، اللَّهُمَّ إنِّي أَسْأَلُكَ مِنْ فَضْلِكَ، اللَّهُمَّ اعْصِمْنِي مِنَ الشَّيْطَانِ الرَّجِيم. "


            };


        }

        //TODO AFTER PRAY
        else if (btnid.equals("أذكار بعد الصلاه ")) {
            mor = new String[]{
                    "أَسْـتَغْفِرُ الله، أَسْـتَغْفِرُ الله، أَسْـتَغْفِرُ الله" + "\n" +
                            "اللّهُـمَّ أَنْـتَ السَّلامُ ، وَمِـنْكَ السَّلام ، تَبارَكْتَ يا ذا الجَـلالِ وَالإِكْـرام"


                    ,
                    "لا إلهَ إلاّ اللّهُ وحدَهُ لا شريكَ لهُ، لهُ المُـلْكُ ولهُ الحَمْد، وهوَ على كلّ شَيءٍ قَدير،" +
                            " اللّهُـمَّ لا مانِعَ لِما أَعْطَـيْت، وَلا مُعْطِـيَ لِما مَنَـعْت، " +
                            "وَلا يَنْفَـعُ ذا الجَـدِّ مِنْـكَ الجَـد"
                    ,
                    "لا إلهَ إلاّ اللّه, وحدَهُ لا شريكَ لهُ، لهُ الملكُ ولهُ الحَمد، وهوَ على كلّ شيءٍ قدير،" +
                            " لا حَـوْلَ وَلا قـوَّةَ إِلاّ بِاللهِ، لا إلهَ إلاّ اللّـه، وَلا نَعْـبُـدُ إِلاّ إيّـاه," +
                            " لَهُ النِّعْـمَةُ وَلَهُ الفَضْل وَلَهُ الثَّـناءُ الحَـسَن،" +
                            " لا إلهَ إلاّ اللّهُ مخْلِصـينَ لَـهُ الدِّينَ " +
                            "وَلَوْ كَـرِهَ الكـافِرون"


                    ,
                    "لا إلهَ إلاّ اللّهُ وَحْـدَهُ لا شريكَ لهُ، لهُ الملكُ ولهُ الحَمْد، وهُوَ على كُلّ شَيءٍ قَـدير"
                    ,
                    "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم" + "\n" +
                            "قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ" + "\n" + "\n" +
                            "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم" + "\n" +
                            "قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ" + "\n" + "\n" +
                            "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم" + "\n" +
                            "قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ " + "\n" + "\n" +


                            "ثلاث مرات بعد صلاتي الفجر والمغرب. ومرة بعد الصلوات الأخرى "
                    ,
                    "أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيم" + "\n" +
                            "اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا" +
                            " الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء" +
                            " وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ" + "\n" + "\n" +
                            " [آية الكرسى - البقرة 255]" + "\n" + "\n" +

                            "من قرأ آية الكرسي دبر كل صلاة لم يمنعه من دخول الجنة إلا الموت"

                    , "لا إلهَ إلاّ اللّهُ وحْـدَهُ لا شريكَ لهُ، لهُ المُلكُ ولهُ الحَمْد، يُحيـي وَيُمـيتُ وهُوَ على كُلّ شيءٍ قدير" + "\n" + "\n" + "\n" +
                    "عَشْر مَرّات بَعْدَ المَغْرِب وَالصّـبْح"

                    , "اللَّهُمَّ أَجِرْنِي مِنْ النَّار"

                    ,
                    "اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ وَشُكْرِكَ وَحُسْنِ عِبَادَتِكَ"


            };
        }

        // TODO AFTER AZAN
        else if (btnid.equals("أذكار الأذان ")) {
            mor = new String[]{

                    "ما يقال عند سماع الأذان" + "\n" +
                            "يَقُولُ مِثْلَ مَا يَقُولُ الـمُؤَذِّنُ إلاَّ فِي حَيَّ عَلَى الصَّلاةِ وَحَيَّ عَلَى الفَلاَح  فَيَقُولُ: لاَ حَوْلَ وَلا قُوَّةَ إلاَّ باللَّهِ"

                            + "\n" + "\n" + "\n" +
                            "عَنْ عبْدِ اللَّهِ بْنِ عَمرِو بْنِ العاصِ رضِيَ اللَّه عنْهُما أَنه سَمِع رسُولَ اللَّهِ صَلّى اللهُ عَلَيْهِ وسَلَّم" +
                            " يقُولُ :" + "\n" +
                            " إِذا سمِعْتُمُ النِّداءَ فَقُولُوا مِثْلَ ما يَقُولُ ، ثُمَّ صَلُّوا علَيَّ ، " +
                            "فَإِنَّهُ مَنْ صَلَّى علَيَّ صَلاةً صَلَّى اللَّه عَلَيْهِ بِهَا عشْراً ، ثُمَّ سلُوا اللَّه لي الْوسِيلَةَ ،" +
                            " فَإِنَّهَا مَنزِلَةٌ في الجنَّةِ لا تَنْبَغِي إِلاَّ لعَبْدٍ منْ عِباد اللَّه" +
                            " وَأَرْجُو أَنْ أَكُونَ أَنَا هُو " +
                            "، فَمنْ سَأَل ليَ الْوسِيلَة حَلَّتْ لَهُ الشَّفاعَةُ" + "\n" + "\n" +
                            " رواه مسلم"


                    ,
                    "ما يقال بعد سماع الأذان" + "\n" + "\n" +
                            "عَنْ جابرٍ بن عبد الله رضَي اللَّه عنهما" +
                            "أَنَّ رَسُولَ اللَّهِ صَلّى اللهُ عَلَيْهِ وسَلَّم قَالَ : " + "\n" +
                            "من قَال حِين يسْمعُ النِّداءَ : " + "\n" + "\n" +
                            "اللَّهُمَّ رَبَّ هذِهِ الدَّعوةِ التَّامَّةِ ،" +
                            " والصَّلاةِ الْقَائِمةِ، آت مُحَمَّداً الْوسِيلَةَ ، والْفَضَيِلَة، " +
                            "وابْعثْهُ مقَامًا محْمُوداً الَّذي وعَدْتَه ،" +
                            " حلَّتْ لَهُ شَفَاعتي يوْم الْقِيامِة" + "\n" + "\n" +
                            "رواه البخاري"
                    ,
                    "ما يقال بين الأذان والإقامة" + "\n" + "\n" +
                            "ما بين الأذان والإقامة فالدعاء عندئذٍ مرغّب فيه ومستحب " + "\n" + "\n" +
                            "قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:" + "\n" +
                            " الدُّعَاءُ لَا يُرَدُّ بَيْنَ الْأَذَانِ وَالْإِقَامَةِ " + "\n" + "\n" +
                            "قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:" + "\n" +
                            " إِنَّ الدُّعَاءَ لَا يُرَدُّ بَيْنَ الْأَذَانِ وَالْإِقَامَةِ فَادْعُوا"};
        }

        //TODO WADOOA

        else if (btnid.equals("أذكار الوضوء")) {
            mor = new String[]{
                    "الذكر قبل الوضوء :" + "\n" +
                            " بِسْمِ ٱللّٰه"

                    ,
                    "الذكر بعد الوضوء" + "\n" + "\n" +
                            "أشْهَدُ أن لا إله إلا الله وحْدَهُ لا شريكَ لهُ ، وأشْهَدُ أنَّ محمداً عَبدُهُ ورسُولُه " + "\n" +
                            "اللَّهُمَّ اجْعَلْني مِنَ التَّوَّابينَ واجْعَلْنِي من المُتَطَهِّرِينَ" + "\n" +
                            "سُبْحَانَكَ اللَّهُمَّ وبَحَمْدكَ أشْهدُ أنْ لا إلهَ إلا أنْتَ أَسْتَغْفِرُكَ وأتُوبُ إِلَيْكَ"


            };
        }
        //TODO QURAN DOAA
        else if (btnid.equals("الأدعيـة القرآنية")) {
            mor = new String[]{

                    "رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ" + "\n" + "\n" +

                            "[البقرة - 201]"

                    ,


                    "رَبَّنَا لاَ تُؤَاخِذْنَا إِن نَّسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلاَ تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِن قَبْلِنَا رَبَّنَا" +
                            " وَلاَ تُحَمِّلْنَا مَا لاَ طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنتَ مَوْلاَنَا فَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ" + "\n" + "\n" +
                            " [البقرة - 286]"
                    ,

                    "رَبَّنَا لاَ تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا وَهَبْ لَنَا مِن لَّدُنكَ رَحْمَةً إِنَّكَ أَنتَ الْوَهَّابُ" + "\n" + "\n"
                            + "[آل عمران - 8]"

                    ,

                    "رَبَّنَا إِنَّنَا آمَنَّا فَاغْفِرْ لَنَا ذُنُوبَنَا وَقِنَا عَذَابَ النَّارِ" + "\n" + "\n" +
                            "[آل عمران - 16]"

                    ,

                    "رَبِّ هَبْ لِي مِن لَّدُنْكَ ذُرِّيَّةً طَيِّبَةً إِنَّكَ سَمِيعُ الدُّعَاء" + "\n" + "\n" +

                            "[آل عمران - 38]"

                    ,

                    "رَبَّنَا آمَنَّا بِمَا أَنزَلْتَ وَاتَّبَعْنَا الرَّسُولَ فَاكْتُبْنَا مَعَ الشَّاهِدِينَ" + "\n" + "\n" +

                            "[آل عمران - 53]"
                    ,

                    "ربَّنَا اغْفِرْ لَنَا ذُنُوبَنَا وَإِسْرَافَنَا فِي أَمْرِنَا وَثَبِّتْ أَقْدَامَنَا وانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَِ" + "\n" + "\n" +

                            "[آل عمران - 147]"
                    ,

                    "رَبَّنَا مَا خَلَقْتَ هَذا بَاطِلاً سُبْحَانَكَ فَقِنَا عَذَابَ النَّارِ رَبَّنَا إِنَّكَ مَن تُدْخِلِ النَّارَ فَقَدْ أَخْزَيْتَهُ وَمَا لِلظَّالِمِينَ مِنْ أَنصَارٍ " +
                            "رَّبَّنَا إِنَّنَا سَمِعْنَا مُنَادِيًا يُنَادِي لِلإِيمَانِ أَنْ آمِنُواْ بِرَبِّكُمْ فَآمَنَّا رَبَّنَا فَاغْفِرْ لَنَا ذُنُوبَنَا وَكَفِّرْ عَنَّا سَيِّئَاتِنَا" +
                            " وَتَوَفَّنَا مَعَ الأبْرَارِ رَبَّنَا وَآتِنَا مَا وَعَدتَّنَا عَلَى رُسُلِكَ وَلاَ تُخْزِنَا يَوْمَ الْقِيَامَةِ إِنَّكَ لاَ تُخْلِفُ الْمِيعَادَ" + "\n" + "\n" +

                            "[آل عمران -  191-194]"

                    ,

                    "رَبَّنَا ظَلَمْنَا أَنفُسَنَا وَإِن لَّمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُونَنَّ مِنَ الْخَاسِرِينَ" + "\n" + "\n" +

                            "[الأعراف - 23]"
                    ,

                    "رَبَّنَا لاَ تَجْعَلْنَا مَعَ الْقَوْمِ الظَّالِمِينَ" + "\n" + "\n" +

                            "[الأعراف - 47]"
                    ,

                    "رَبَّنَا أَفْرِغْ عَلَيْنَا صَبْرًا وَتَوَفَّنَا مُسْلِمِينَ" + "\n" + "\n" +

                            "[الأعراف - 126]"
                    ,
                    "حَسْبِيَ اللّهُ لا إِلَـهَ إِلاَّ هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ" + "\n" + "\n" +

                            "[التوبة - 129]"
                    ,
                    "رَبَّنَا لاَ تَجْعَلْنَا فِتْنَةً لِّلْقَوْمِ الظَّالِمِينَ وَنَجِّنَا بِرَحْمَتِكَ مِنَ الْقَوْمِ الْكَافِرِينَ" + "\n" + "\n" +

                            "[يونس - 85-86]"

                    ,

                    "رَبِّ إِنِّي أَعُوذُ بِكَ أَنْ أَسْأَلَكَ مَا لَيْسَ لِي بِهِ عِلْمٌ وَإِلاَّ تَغْفِرْ لِي وَتَرْحَمْنِي أَكُن مِّنَ الْخَاسِرِينَ" + "\n" + "\n" +


                            "[هود - 47]"

                    ,
                    "رَبِّ اجْعَلْنِي مُقِيمَ الصَّلاَةِ وَمِن ذُرِّيَّتِي رَبَّنَا وَتَقَبَّلْ دُعَاء" + "\n" + "\n" +


                            " [إبرهيم - 40]"

                    ,
                    "رَبَّنَا اغْفِرْ لِي وَلِوَالِدَيَّ وَلِلْمُؤْمِنِينَ يَوْمَ يَقُومُ الْحِسَابُ" + "\n" + "\n" +

                            "[إبرهيم - 41]"

                    ,
                    "رَّبِّ أَدْخِلْنِي مُدْخَلَ صِدْقٍ وَأَخْرِجْنِي مُخْرَجَ صِدْقٍ وَاجْعَل لِّي مِن لَّدُنكَ سُلْطَانًا نَّصِيرًا" + "\n" + "\n" +


                            "[الإسراء - 80]"
                    ,


                    "رَبَّنَا آتِنَا مِن لَّدُنكَ رَحْمَةً وَهَيِّئْ لَنَا مِنْ أَمْرِنَا رَشَدًا" + "\n" + "\n" +

                            "[الكهف - 10]"
                    ,

                    "رَبِّ اشْرَحْ لِي صَدْرِي وَيَسِّرْ لِي أَمْرِي وَاحْلُلْ عُقْدَةً مِّن لِّسَانِي يَفْقَهُوا قَوْلِي" + "\n" + "\n" +

                            "[طه - 25-28]" + "\n" + "\n" +

                            "رَّبِّ زِدْنِي عِلْمًا" + "\n" + "\n" +

                            "[طه - 114]"

                    ,

                    "لا إِلَهَ إِلا أَنتَ سُبْحَانَكَ إِنِّي كُنتُ مِنَ الظَّالِمِينَ" + "\n" + "\n" +

                            "[الأنبياء - 87]"

                    ,
                    "رَبِّ لَا تَذَرْنِي فَرْدًا وَأَنتَ خَيْرُ الْوَارِثِينَ" + "\n" + "\n" +


                            "[الأنبياء - 89]"

                    ,
                    "رَّبِّ أَعُوذُ بِكَ مِنْ هَمَزَاتِ الشَّيَاطِينِ وَأَعُوذُ بِكَ رَبِّ أَن يَحْضُرُونِ" + "\n" + "\n" +


                            "[المؤمنون - 97-98]"

                    ,
                    "رَبَّنَا آمَنَّا فَاغْفِرْ لَنَا وَارْحَمْنَا وَأَنتَ خَيْرُ الرَّاحِمِينَ" + "\n" + "\n" +
                            "[المؤمنون - 109]"

                    ,

                    "رَّبِّ اغْفِرْ وَارْحَمْ وَأَنتَ خَيْرُ الرَّاحِمِينَ" + "\n" + "\n" +

                            "[المؤمنون - 118]"};
        }
        //TODO NABAYA DOAA
        else if (btnid.equals("أدعيه النبويه ")) {
            mor = new String[]{

                    "سيد الاستغفار" + "\n" +
                            "اللَّهُمَّ أنَْتَ رَبيِّ لَا إلِهََ إلَِّا أنَتَ، خَلَقْتنَيِ وَأنََا عَبدُْكَ،" +
                            " وَأنََا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ،" +
                            " وَأَبُوءُ بِذَنْبِي فَاغْفِرْ لِي فَإِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ" + "\n" + "\n" +

                            "رواه البخاري"
                    ,

                    "رَبِّ اغْفِرْ لِي خَطِيئَتِي وَجَهْلِي وَإِسْرَافِي فِي أَمْرِي كُلِّهِ وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي، " +
                            "اللَّهُمَّ اغْفِرْ لِي خَطَايَايَ وَعَمْدِي وَجَهْلِي وَهَزْلِي، وَكُلُّ ذَلِكَ عِنْدِي،" +
                            " اللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ وَمَا أَسْرَرْتُ وَمَا أَعْلَنْتُ أَنْتَ الْمُقَدِّمُ" +
                            " وَأَنْتَ الْمُؤَخِّرُ وَأَنْتَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ" + "\n" + "\n" +
                            "رواه البخاري  ومسلم "

                    ,

                    "اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظُلْمًا كَثِيرًا،" +
                            " وَلَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ، فَاغْفِرْ لِي مَغْفِرَةً مِنْ عِنْدِكَ " +
                            "وَارْحَمْنِي إِنَّك أَنْتَ الْغَفُورُ الرَّحِيمُ" + "\n" + "\n" +
                            "رواه البخاري ومسلم"

                    ,

                    "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ وَالْعَجْزِ وَالْكَسَلِ وَالْجُبْنِ وَالْبُخْلِ وَضَلَعِ الدَّيْنِ وَغَلَبَةِ الرِّجَالِ" + "\n" + "\n" +

                            "رواه البخاري "

                    ,

                    "اللَّهُمَّ إنِِّي أَعُوذُ بكَِ مِنَ الْبُخْلِ،" +
                            " وَأَعُوذُ بكَِ مِنَ الْجُبْنِ،" +
                            " وَأَعُوذُ بكَِ أَنْ أُرَدَّ إلَِى أَرْذَلِ الْعُمُرِ،" +
                            " وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الدُّنْيَا، " +
                            "وَأَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ"
                            + "\n" + "\n" +
                            "رواه البخاري"

                    ,

                    "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكَسَلِ وَالْهَرَمِ وَالْمَأْثَمِ وَالْمَغْرَمِ،" +
                            " وَمِنْ فِتْنَةِ الْقَبْرِ وَعَذَابِ الْقَبْرِ، وَمِنْ فِتْنَةِ النَّارِ وَعَذَابِ النَّارِ،" +
                            " وَمِنْ شَرِّ فِتْنَةِ الْغِنَى، " +
                            "وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْفَقْرِ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ،" +
                            " اللَّهُمَّ اغْسِلْ عَنِّي خَطَايَايَ بِمَاءِ الثَّلْجِ وَالْبَرَدِ،" +
                            " وَنَقِّ قَلْبِي مِنَ الْخَطَايَا كَمَا نَقَّيْتَ الثَّوْبَ الْأَبْيَضَ مِنَ الدَّنَسِ، " +
                            "وَبَاعِدْ بَيْنِي وَبَيْنَ خَطَايَايَ" +
                            " كَمَا بَاعَدْتَ بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ" + "\n" + "\n" +


                            "رواه البخاري  ومسلم"


                    ,

                    "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ مَا عَمِلْتُ وَمِنْ شَرِّ مَا لَمْ أَعْمَلْ" + "\n" + "\n" +


                            "رواه مسلم"

                    ,

                    "اللَّهُمَّ رَبَّ السَّمَوَاتِ وَرَبَّ الْأَرْضِ وَرَبَّ الْعَرْشِ الْعَظِيمِ، رَبَّنَا وَرَبَّ كُلِّ شَيْءٍ، فَالِقَ الْحَبِّ وَالنَّوَى" +
                            " وَمُنْزِلَ التَّوْرَاةِ وَالْإِنْجِيلِ وَالْفُرْقَانِ، أَعُوذُ بِكَ مِنْ شَرِّ كُلِّ شَيْءٍ أَنْتَ آخِذٌ بِنَاصِيَتهِِ،" +
                            " اللَّهُمَّ أَنْتَ الْأوََّلُ فَلَيْسَ قَبْلَكَ شَيْءٌ، وَأَنْتَ الْآخِرُ فَلَيْسَ بَعْدَكَ شَيْءٌ، " +
                            "وَأَنْتَ الظَّاهِرُ فَلَيْسَ فَوْقَكَ شَيْءٌ، وَأَنْتَ الْبَاطِنُ فَلَيْسَ دُونَكَ شَيْءٌ، " +
                            "اقْضِ عَنَّا الدَّيْنَ وَأَغْنِنَا مِنَ الْفَقْرِ" + "\n" + "\n" +

                            "رواه مسلم"
                    ,


                    "اللَّهُمَّ أَصْلِحْ لِي دِينِي الَّذِي هُوَ عِصْمَةُ أَمْرِي، وَأَصْلِحْ لِي دُنْيَايَ الَّتِي فِيهَا مَعَاشِي، " +
                            "وَأَصْلِحْ لِي آخِرَتِي الَّتِي فِيهَا مَعَادِي وَاجْعَلِ الْحَيَاةَ زِيَادَةً لِي فِي كُلِّ خَيْرٍ، " +
                            "وَاجْعَلِ الْمَوْتَ رَاحَةً لِي مِنْ كُلِّ شَرٍّ" + "\n" + "\n" +


                            "رواه مسلم"

                    ,

                    "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْهُدَى وَالتُّقَى وَالْعَفَافَ وَالْغِنَ" + "\n" + "\n" +


                            "رواه مسلم"
                    ,

                    "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ زَوَالِ نِعْمَتِكَ وَتَحَوُّلِ عَافِيَتِكَ وَفُجَاءَةِ نِقْمَتِكَ وَجَمِيعِ سَخَطِكَ" + "\n" + "\n" +


                            "رواه مسلم"

                    ,
                    "اللَّهُمَّ مُصَرِّفَ الْقُلُوبِ صَرِّفْ قُلُوبَنَا عَلَى طَاعَتِكَ" + "\n" + "\n" +

                            "رواه مسلم"

                    ,
                    "اللَّهُمَّ إِنِّي أَعُوذُ بِرِضَاكَ مِنْ سَخَطِكَ، وَبِمُعَافَاتِكَ مِنْ عُقُوبَتِكَ، وَأَعُوذُ بِكَ مِنْكَ،" +
                            " لَا أُحْصِي ثَنَاءً عَلَيْكَ، أَنْتَ كَمَا أَثْنَيْتَ عَلَى نَفْسِكَ" + "\n" + "\n" +


                            "رواه مسلم"
                    ,

                    "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ جَهْدِ الْبَلَاءِ وَدَرَكِ الشَّقَاءِ وَسُوءِ الْقَضَاءِ وَشَمَاتَةِ الْأَعْدَاءِ" + "\n" + "\n" +

                            "رواه مسلم"


                    ,


                    "اللَّهُمَّ اجْعَلْ لِي فِي قَلْبِي نُورًا، وَفِي لِسَانِي نُورًا، وَفِي سَمْعِي نُورًا،" +
                            " وَفِي بَصَرِي نُورًا، وَمِنْ فَوْقِي نُورًا، وَمِنْ تَحْتِي نُورًا، وَعَنْ يَمِينِي نُورًا،" +
                            " وَعَنْ شِمَالِي نُورًا، وَمِنْ بَيْنِ يَدَيَّ نُورًا، وَمِنْ خَلْفِي نُورًا،" +
                            " وَاجْعَلْ فِي نَفْسِي نُورًا، وَأَعْظِمْ لِي نُورًا" + "\n" + "\n" +


                            "رواه البخاري  ومسلم"
                    ,

                    "اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنَ الْخَيْرِ كُلِّهِ عَاجِلِهِ وَآجِلِهِ مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَم،ْ" +
                            " وَأَعُوذُ بِكَ مِنَ الشَّرِّ كُلِّهِ عَاجِلِهِ وَآجِلِهِ مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَمْ، اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ خَيْرِ مَا سَأَلَكَ عَبْدُكَ وَنَبِيُّكَ،" +
                            " وَأَعُوذُ بِكَ مِنْ شَرِّ مَا عَاذَ بِهِ عَبْدُكَ وَنَبِيُّكَ، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْجَنَّةَ وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ، " +
                            "وَأَعُوذُ بِكَ مِنَ النَّارِ وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ وَأَسْأَلُكَ أَنْ تَجْعَلَ كُلَّ قَضَاءٍ قَضَيْتَهُ لِي خَيْرًا" + "\n" + "\n" +

                            "رواه ابن ماجه (3846) بإسناد صحيح عن عائشة"

                    ,

                    "اللَّهُمَّ إِنِّي أَسْأَلُكَ العَفْوَ وَالْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ،" +
                            " اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِينِي وَدُنْيَايَ وَأَهْلِي وَمَالِي، اللَّهُمَّ اسْتُرْ عَوْرَاتِي وَآمِنْ رَوْعَاتِي،" +
                            " وَاحْفَظنْيِ مِنْ بيَنِْ يَدَيَّ وَمِنْ خَلْفِي وَعَنْ يَمِينيِ وَعَنْ شِمَاليِ وَمِنْ فَوْقِي،" +
                            " وَأَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي" + "\n" + "\n" +
                            "رواه أبو داود (5074) وغيره بإسناد صحيح عن ابن عمر"

                    ,

                    "للَّهُمَّ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ، فَاطِرَ السَّمَوَاتِ وَالْأَرْضِ، رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي وَشَرِّ الشَّيْطَانِ وَشِرْكِهِ " + "\n" + "\n" +


                            "رواه الترمذي (3392) وغيره بإسناد صحيح عن أبي هريرة"
                    ,

                    "\n" +
                            "اللَّهُمَّ إِنِّي أَسْأَلُكَ الثَّبَاتَ فِي الأَمْرِ، وَالْعَزِيمَةَ عَلَى الرُّشْدِ،" +
                            " وَأَسْأَلُكَ مُوجِبَاتِ رَحْمَتكَِ، وَعَزَائمَِ مَغْفِرَتكَِ، وَأسَْألَكَُ شُكْرَ نعِْمَتكَِ، وَحُسْنَ عِباَدَتكَِ، وَأسَْألَكَُ قَلْبًا سَلِيمًا، وَلِسَانًا صَادِقًا، " +
                            "وَأَسْأَلُكَ مِنْ خَيْرِ مَا تَعْلَمُ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا تَعْلَمُ، وَأَسْتَغْفِرُكَ لِمَا تَعْلَمُ، إِنَّكَ أَنْتَ عَلَّامُ الْغُيُوب " + "\n" + "\n" +


                            "رواه الطبراني في الكبير (7135) عن شداد بن أوس"
                    ,

                    "اللَّهُمَّ اكْفِنِي بِحَلَالِكَ عَنْ حَرَامِكَ وَأَغْنِنِي بِفَضْلِكَ عَمَّنْ سِوَاكَ" + "\n" + "\n" +
                            "رواه الترمذي (3563) بإسناد حسن عن علي."

                    ,

                    "اللَّهُمَّ عَافِنِي فِي بَدَنِي، اللَّهُمَّ عَافِنِي فِي سَمْعِي، اللَّهُمَّ عَافِنِي فِي بَصَرِي،" +
                            " لَا إلَِهَ إلَِّا أَنْتَ، اللَّهُمَّ إنِِّي أَعُوذُ بِكَ مِنَ الْكُفْرِ وَالْفَقْرِ، اللَّهُمَّ إنِِّي أَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، لَا إِلَهَ إِلَّا أَنْتَ. " + "\n" + "\n" +

                            "رواه أبو داود (5090) بإسناد حسن عن أبي بكرة"

                    ,

                    "رَبِّ أَعِنِّي وَلَا تُعِنْ عَلَيَّ، وَانْصُرْنِي وَلَا تَنْصُرْ عَلَيَّ، وَامْكُرْ لِي وَل َاتَمْكُرْ عَلَيَّ، وَاهْدِنِي وَيَسِّرِ الْهُدَى لِي، وَانْصُرْنِي عَلَى مَنْ بَغَى عَلَيَّ، رَبِّ اجْعَلْنِي لَكَ شَكَّارًا،" +
                            " لَكَ ذَكَّارًا، لَكَ رَهَّابًا، لَكَ مِطْوَاعًا، لَكَ مُخْبِتًا إِلَيْكَ أَوَّاهًا مُنِيبًا، رَبِّ تَقَبَّلْ تَوْبَتِي وَاغْسِلْ حَوْبَتِي " +
                            "وَأَجِبْ دَعْوَتِي وَثَبِّتْ حُجَّتِي وَسَدِّدْ لِسَانِي وَاهْدِ قَلْبِي وَاسْلُلْ سَخِيمَةَ صَدْرِي" + "\n" + "\n" +

                            "رواه الترمذي (3551) وغيره بإسناد صحيح عن ابن عباس"

                    ,


                    "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ وعَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ، " +
                            "اللّٰهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ" + "\n" + "\n" +
                            "رواه البخاري (3370) ومسلم (908) عن كعب بن عُجرة"};
        }
        //TODO EATING AZKAR
        else if (btnid.equals("أذكار الطعام")) {
            mor = new String[]{

                    "الذكر عند الطعام والشراب" + "\n" +
                            "بِسْمِ اللهِ" + "\n" +
                            "فإنْ نسي في أَوَّلِهِ، فَليَقُلْ:" + "\n" +
                            "بِسْمِ اللَّه أَوَّلَهُ وَآخِرَهُ."
                    ,
                    "الذكر عند الفراغ من الطعام والشراب" + "\n" + "\n" +
                            "الْحَمْدُ للهِ الَّذِي أَطْعَمَنِي هَذَا, وَرَزَقَنِيهِ مِنْ غَيْرِ حَوْلٍ مِّنِّي وَلاَ قُوَّة" + "\n" +
                            "الْحَمْدُ لِلَّهِ كَثِيرًا طَيِّبًا مُبَارَكًا فِيهِ غَيْرَ مَكْفِيٍّ وَلَا مُوَدَّعٍ وَلَا مُسْتَغْنًى عَنْهُ رَبَّنَا"
                    ,
                    "هدى النبى فى الشرب" + "\n" + "\n" +
                            "كَانَ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَشْرَبُ فِي ثَلاَثَةِ أَنْفَاسٍ، إِذَا " +
                            "أَدْنَى الإِنَاءَ إِلَى فَمِهِ سَمَّى اللهَ تَعَالَى, وَإِذَا أَخَّرَهُ حَمِدَ اللهَ تَعَالَى، يَفْعَلُ ذَلِكَ ثَلاَثَ مَرَّاتٍ"

                    ,
                    "أذكار الضيف" + "\n" + "\n" +
                            "أَفْطَرَ عِنْدَكُمُ الصَّائِمُونَ ، وَأَكَلَ طَعَامَكُمُ الأَبْرَارُ ، وَصَلَّتْ عَلَيْكُمُ الْمَلائِكَةُ"


            };
        }
        //TODO HOUSE AZKAR
        else if (btnid.equals("أذكار المنزل")) {
            mor = new String[]{
                    "أذكار الدخول إلى المنزل" + "\n" + "\n" +
                            "بِسْـمِ اللهِ وَلَجْنـا، وَبِسْـمِ اللهِ خَـرَجْنـا، وَعَلـى رَبِّنـا تَوَكّلْـنا"

                    ,
                    "أذكار الخروج من المنزل" + "\n" + "\n" +
                            "بِسْمِ اللهِ ، تَوَكَّلْـتُ عَلى اللهِ وَلا حَوْلَ وَلا قُـوَّةَ إِلاّ بِالله" +
                            "اللّهُـمَّ إِنِّـي أَعـوذُ بِكَ أَنْ أَضِـلَّ أَوْ أُضَـل ، أَوْ أَزِلَّ أَوْ أُزَل ، أَوْ أَظْلِـمَ أَوْ أَُظْلَـم ، أَوْ أَجْهَلَ أَوْ يُـجْهَلَ عَلَـيّ"};
        }

        //TODO SLEEPING AZKAR
        else if (btnid.equals("أذكار النوم")) {
            mor = new String[]{
                    "\n" +
                            "بِاسْمِكَ رَبِّـي وَضَعْـتُ جَنْـبي ، وَبِكَ أَرْفَعُـه، فَإِن أَمْسَـكْتَ نَفْسـي فارْحَـمْها ،" +
                            " وَإِنْ أَرْسَلْتَـها فاحْفَظْـها بِمـا تَحْفَـظُ بِه عِبـادَكَ الصّـالِحـين"
                    ,
                    "\n" +
                            "اللّهُـمَّ إِنَّـكَ خَلَـقْتَ نَفْسـي وَأَنْـتَ تَوَفّـاهـا لَكَ ممَـاتـها وَمَحْـياها ،" +
                            " إِنْ أَحْيَيْـتَها فاحْفَظْـها ، وَإِنْ أَمَتَّـها فَاغْفِـرْ لَـها ." +
                            " اللّهُـمَّ إِنَّـي أَسْـأَلُـكَ العـافِـيَة"
                    ,
                    "\n" +
                            "يجمع كفيه ثم ينفث فيهما والقراءة فيهما قل هو الله أحد قل أعوذ برب الفلق وقل أعوذ برب الناس ومسح ما" +
                            " استطاع من الجسد يبدأ بهما على رأسه ووجه وما أقبل من جسده"

                    ,
                    "\n" +
                            "الـحَمْدُ للهِ الَّذي أَطْـعَمَنا وَسَقـانا، وَكَفـانا، وَآوانا، فَكَـمْ مِمَّـنْ لا كـافِيَ لَـهُ وَلا مُـؤْوي"


                    ,
                    "\n" +
                            "آية الكرسى:" + "\n" + "\n" +
                            " أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيم" + "\n" +
                            "اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا" +
                            " الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ " +
                            "إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا" +
                            " وَهُوَ الْعَلِيُّ الْعَظِيمُ" + "\n" + "\n" +
                            " [البقرة 255] " + "\n" + "\n" + "أجير من الجن حتى يصبح"

                    ,
                    "\n" +
                            "أذكار من قلق في فراشه ولم ينم" + "\n" + "\n" +
                            "عن بريدة رضي الله عنه، قال شكا خالد بن الوليد رضي الله عنه إلى النبي صلى الله عليه وسلم فقال " +
                            " يا رسول الله ما أنام الليل من الأرق، فقال النبي صلى الله عليه وسلم" + "\n" +
                            " إذا أويت إلى فراشك فقل اللهم رب السموات السبع وما أظلت، ورب الأرضين وما أقلت،" +
                            " ورب الشياطين وما أضلت، كن لي جارا من خلقك كلهم جميعا أن يفرط علي أحد منهم" +
                            " أو أن يبغي علي، عز جارك، وجل ثناؤك ولا إله غيرك، ولا إله إلا أنت"

                    , "\n" +
                    "أذكار الأحلام" + "\n" + "\n" +
                    "عن أبي قتادة رضي الله عنه قال قال رسول الله صلى الله عليه وسلم" +
                    "الرؤيا الصالحة وفي رواية الرؤيا الحسنة من الله، " + "\n" +
                    "والحلم من الشيطان، فمن رأى شيئا يكرهه فلينفث عن شماله ثلاثا وليتعوذ من الشيطان، فإنها لا تضره"
            };
        }

        //TODO WAKING AZKAR
        else if (btnid.equals("أذكار الاستيقاظ من النوم")) {
            mor = new String[]{

                    "\n" +
                            "الحَمْـدُ لِلّهِ الّذي أَحْـيانا بَعْـدَ ما أَماتَـنا وَإليه النُّـشور"

                    ,
                    "\n" +
                            "الحمدُ للهِ الذي عافاني في جَسَدي وَرَدّ عَليّ روحي وَأَذِنَ لي بِذِكْرِه"

                    ,
                    "\n" +
                            "لا إلهَ إلاّ اللّهُ وَحْـدَهُ لا شَـريكَ له، لهُ المُلـكُ ولهُ الحَمـد،" +
                            " وهوَ على كلّ شيءٍ قدير، سُـبْحانَ اللهِ، والحمْـدُ لله ،" +
                            " ولا إلهَ إلاّ اللهُ واللهُ أكبَر، وَلا حَولَ وَلا قوّة" +
                            " إلاّ باللّهِ العليّ العظيم. رَبِّ اغْفرْ لي"};
        }
        //TODO دعاء ختم القران الكريم
        else if (btnid.equals("دعاء ختم القران الكريم")) {
            mor = new String[]{

                    "اللَّهُمَّ ارْحَمْنِي بالقُرْءَانِ وَاجْعَلهُ لِي إِمَاماً وَنُوراً وَهُدًى وَرَحْمَةً " +
                            "\n" + "\n" + "\n" +
                            "اللَّهُمَّ ذَكِّرْنِي مِنْهُ مَانَسِيتُ وَعَلِّمْنِي مِنْهُ مَاجَهِلْتُ وَارْزُقْنِي تِلاَوَتَهُ آنَاءَ اللَّيْلِ وَأَطْرَافَ النَّهَارِ وَاجْعَلْهُ لِي حُجَّةً يَارَبَّ العَالَمِينَ "
                    ,


                    "اللَّهُمَّ أَصْلِحْ لِي دِينِي الَّذِي هُوَ عِصْمَةُ أَمْرِي، وَأَصْلِحْ لِي دُنْيَايَ الَّتِي فِيهَا مَعَاشِي،" +
                            " وَأَصْلِحْ لِي آخِرَتِي الَّتِي فِيهَا مَعَادِي، وَاجْعَلِ الحَيَاةَ زِيَادَةً لِي فِي كُلِّ خَيْرٍ وَاجْعَلِ المَوْتَ رَاحَةً لِي مِنْ كُلِّ شَرٍّ"

                    ,
                    "اللَّهُمَّ اجْعَلْ خَيْرَ عُمْرِي آخِرَهُ وَخَيْرَ عَمَلِي خَوَاتِمَهُ وَخَيْرَ أَيَّامِي يَوْمَ أَلْقَاكَ فِيهِ" + "\n" + "\n" +

                            "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِيشَةً هَنِيَّةً وَمِيتَةً سَوِيَّةً وَمَرَدًّا غَيْرَ مُخْزٍ وَلاَ فَاضِحٍ"

                    ,
                    "اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَ المَسْأَلةِ وَخَيْرَ الدُّعَاءِ وَخَيْرَ النَّجَاحِ وَخَيْرَ العِلْمِ وَخَيْرَ العَمَلِ وَخَيْرَ الثَّوَابِ وَخَيْرَ الحَيَاةِ " +
                            "وَخيْرَ المَمَاتِ وَثَبِّتْنِي وَثَقِّلْ مَوَازِينِي وَحَقِّقْ إِيمَانِي وَارْفَعْ دَرَجَتِي وَتَقَبَّلْ صَلاَتِي وَاغْفِرْ خَطِيئَاتِي وَأَسْأَلُكَ العُلَا مِنَ الجَنَّةِ"

                    ,

                    "اللَّهُمَّ إِنِّي أَسْأَلُكَ مُوجِبَاتِ رَحْمَتِكَ وَعَزَائِمِ مَغْفِرَتِكَ وَالسَّلاَمَةَ مِنْ كُلِّ إِثْمٍ وَالغَنِيمَةَ مِنْ كُلِّ بِرٍّ وَالفَوْزَ بِالجَنَّةِ وَالنَّجَاةَ مِنَ النَّارِ"

                    ,

                    "اللَّهُمَّ أَحْسِنْ عَاقِبَتَنَا فِي الأُمُورِ كُلِّهَا، وَأجِرْنَا مِنْ خِزْيِ الدُّنْيَا وَعَذَابِ الآخِرَةِ"

                    ,
                    "اللَّهُمَّ اقْسِمْ لَنَا مِنْ خَشْيَتِكَ مَاتَحُولُ بِهِ بَيْنَنَا" +
                            " وَبَيْنَ مَعْصِيَتِكَ وَمِنْ طَاعَتِكَ مَاتُبَلِّغُنَا بِهَا جَنَّتَكَ وَمِنَ اليَقِينِ مَاتُهَوِّنُ بِهِ عَلَيْنَا مَصَائِبَ الدُّنْيَا " +
                            "وَمَتِّعْنَا بِأَسْمَاعِنَا وَأَبْصَارِنَا وَقُوَّتِنَا مَاأَحْيَيْتَنَا" +
                            " وَاجْعَلْهُ الوَارِثَ مِنَّا " +
                            "وَاجْعَلْ ثَأْرَنَا عَلَى مَنْ ظَلَمَنَا وَانْصُرْنَا عَلَى مَنْ عَادَانَا وَلاَ تجْعَلْ مُصِيبَتَنَا فِي دِينِنَا" +
                            " وَلاَ تَجْعَلِ الدُّنْيَا أَكْبَرَ هَمِّنَا وَلَا مَبْلَغَ عِلْمِنَا وَلاَ تُسَلِّطْ عَلَيْنَا مَنْ لَا يَرْحَمُنَا "

                    ,

                    "اللَّهُمَّ لَا تَدَعْ لَنَا ذَنْبًا إِلَّا غَفَرْتَهُ وَلَا هَمَّا إِلَّا فَرَّجْتَهُ وَلَا دَيْنًا إِلَّا قَضَيْتَهُ وَلَا حَاجَةً مِنْ حَوَائِجِ الدُّنْيَا وَالآخِرَة" +
                            " إِلَّا قَضَيْتَهَا يَاأَرْحَمَ الرَّاحِمِينَ"
                    ,

                    "رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ " +
                            "وَصَلَّى اللهُ عَلَى سَيِّدِنَا وَنَبِيِّنَا مُحَمَّدٍ وَعَلَى آلِهِ" +
                            " وَأَصْحَابِهِ الأَخْيَارِ " +
                            "وَسَلَّمَ تَسْلِيمًا كَثِيراً"};
        }


        //TODO فضل الدعاء
        else if (btnid.equals("فضل الدعاء")) {
            mor = new String[]{

                    "معنى الدعاء" + "\n" + "\n" +
                            "الدعاء هو أن يطلبَ الداعي ما ينفعُه وما يكشف ضُرَّه؛ وحقيقته إظهار الافتقار إلى الله، والتبرؤ من الحول والقوة، " +
                            "وهو سمةُ العبوديةِ، واستشعارُ الذلةِ البشرية، وفيه معنى الثناءِ على الله عز وجل، وإضافةِ الجود والكرم إليه"

                    ,

                    "الدعاءُ طاعةٌ لله، وامتثال لأمره" + "\n" + "\n" +
                            "قال تعالى: وَقَالَ رَبُّكُمُ ادْعُونِي أَسْتَجِبْ لَكُمْ إِنَّ الَّذِينَ يَسْتَكْبِرُونَ عَنْ عِبَادَتِي سَيَدْخُلُونَ جَهَنَّمَ دَاخِرِينَ" + "\n" + "\n" +
                            "[سورة غافر: الآية 60]"


                    ,
                    "الدعاء عبادة" + "\n" + "\n" +
                            "قال صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : " + "\n" +
                            "الدُّعَاءُ هُوَ الْعِبَادَةُ" + "\n" + "\n" +
                            " [رواه الترمذي وابن ماجه، وصححه الألباني]"

                    ,

                    "الدعاء أكرم شيء على الله تعالى" + "\n" + "\n" +
                            "قال صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : " + "\n" +
                            "لَيْسَ شَيْءٌ أَكْرَمَ عَلَى اللَّهِ تَعَالَى مِنْ الدُّعَاء" + "\n" + "\n" +
                            " [رواه أحمد والبخاري، وابن ماجة، والترمذي والحاكم وصححه، ووافقه الذهبي]"

                    ,

                    "الدعاء سبب لدفع غضب الله" + "\n" + "\n" +
                            "قال صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: " + "\n" +
                            "مَنْ لَمْ يَسْأَلْ اللَّهَ يَغْضَبْ عَلَيْه" + "\n" + "\n" +
                            "[رواه الترمذيُّ، وابن ماجةَ، وصححه الحاكم، ووافقه الذهبي، وحسنه الألباني]"

                    ,

                    "الدعاء سلامة من العجز، ودليل على الكَياسة" + "\n" + "\n" +
                            "قال صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:" + "\n" +
                            "أَعْجَزُ النَّاسِ مَنْ عَجَزَ عَنْ الدُّعَاءِ وَأَبْخَلُ النَّاسِ مَنْ بَخِلَ بِالسَّلَامِ" + "\n" + "\n" +
                            "[رواه ابن حبان وصححه الألباني]"

                    ,

                    "الدعاء سبب لرفع البلاء" + "\n" + "\n" +
                            "قال صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: " + "\n" +
                            "مَنْ فُتِحَ لَهُ مِنْكُمْ بَابُ الدُّعَاءِ " +
                            "فُتِحَتْ لَهُ أَبْوَابُ الرَّحْمَةِ وَمَا سُئِلَ اللَّهُ شَيْئًا يَعْنِي أَحَبَّ إِلَيْهِ مِنْ أَنْ يُسْأَلَ الْعَافِيَةَ" +
                            " وَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهم عَلَيْهِ وَسَلَّمَ " + "\n" +
                            "إِنَّ الدُّعَاءَ يَنْفَعُ مِمَّا نَزَلَ وَمِمَّا لَمْ يَنْزِلْ فَعَلَيْكُمْ عِبَادَ اللَّهِ بِالدُّعَاءِ" + "\n" + "\n" +
                            " [رواه الترمذي وحسنه الألباني ]"

                    ,

                    "الداعي في معيةُ الله" + "\n" + "\n" +
                            "قال رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: " + "\n" +
                            "يقول الله عز وجل: أَنَا عِنْدَ ظَنِّ عَبْدِي بِي وَأَنَا مَعَهُ إِذَا دَعَانِي" + "\n" + "\n" +
                            " [رواه مسلم]"


                    ,

                    "فضل الدعاء في السجود" + "\n" + "\n" +
                            "قال صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:" + "\n" +
                            "أَقْرَبُ مَا يَكُونُ الْعَبْدُ مِنْ رَبِّهِ عَزَّ وَجَلَّ وَهُوَ سَاجِدٌ ، فَأَكْثِرُوا الدُّعَاء" + "\n" + "\n" +
                            " [رواه مسلم]"

                    ,

                    "فضل الدعاء بالليل" + "\n" + "\n" +
                            "قال صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: " + "\n" +
                            " إِنَّ فِي اللَّيْلِ لَسَاعَةٌ لَا يُوَافِقُهَا رَجُلٌ مُسْلِمٌ يَسْأَلُ اللَّهَ تَعَالَى مِنْ أَمْرِ الدُّنْيَا وَالْآخِرَةِ إِلَّا أَعْطَاهُ إِيَّاهُ وَذَلِكَ كُلَّ لَيْلَةٍ" + "\n" + "\n" +
                            " [رواه مسلم]"

                    ,

                    "فضل الدعاء للمسلمين بظهر الغيب" + "\n" + "\n" +
                            "قال صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:" + "\n" +
                            " مَا مِنْ عَبْدٍ مُسْلِمٍ يَدْعُو لِأَخِيهِ بِظَهْرِ الْغَيْبِ إِلَّا قَالَ الْمَلَكُ : وَلَكَ بِمِثْلٍ" + "\n" + "\n" +
                            " [رواه مسلم]"


            };
        }
        //TODO فضل الأذكار


        else if (btnid.equals("فضل الأذكار")) {

            mor = new String[]{


                    "إنَّ من أفضل الأعمال الصالحة اليسيرة التي تقرب المسلم إلى ربه جل وعلا الذكرُ" + "\n" + "\n" +


                            "\n" + "قال تعالى : وَلَذِكْرُ اللَّهِ أَكْبَرُ" + "\n" +
                            "\n" + "وقال تعالى : وَسَبِّحُوهُ بُكْرَةً وَأَصِيلًا" + "\n" +
                            "\n" + "وقال تعالى : فَاذْكُرُونِي أَذْكُرْكُمْ وَاشْكُرُوا لِي وَلا تَكْفُرُونِ" + "\n" +
                            "\n" + "وقال تعالى : يَا أَيُّهَا الَّذِينَ آمَنُوا اذْكُرُوا اللَّهَ ذِكْراً كَثِيراً" + "\n"

                    ,

                    "وقال تعالى : وَاذْكُر رَّبَّكَ كَثِيرًا وَسَبِّحْ بِالْعَشِيِّ وَالْإِبْكَارِ" + "\n" + "\n" +

                            "وقال تعالى :" + "\n" +
                            " يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تُلْهِكُمْ أَمْوَالُكُمْ وَلَا أَوْلَادُكُمْ عَن ذِكْرِ اللَّهِ" + "\n" + "\n" +
                            "وقال تعالى : " + "\n" +
                            "فَإِذَا قَضَيْتُم مَّنَاسِكَكُمْ فَاذْكُرُوا اللَّهَ كَذِكْرِكُمْ آبَاءَكُمْ أَوْ أَشَدَّ ذِكْرًا"

                    ,
                    "أحاديث صحيحة عن رسول الله صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، نذكر ما تيسر منها" + "\n" + "\n" +

                            " قال رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:" + "\n" +
                            " \"مثل الذي يذكر ربه و الذي لا يذكر ربه مثل الحي و الميت\"." + "\n" + "\n" + "\n" +
                            "و قال رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:" + "\n" +
                            " \"من قعد مقعدا لم يذكر الله فيه كانت عليه من الله تره , و من أضطجع مضجعا" +
                            " لم يذكر فيه الله كانت عليه ترة\"."


                    ,
                    " قال رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:" + "\n" + "\n" +
                            " \"ألا أنبئكم بخير أعمالكم " +
                            "و أزكاها عند مليككم و أرفعها في درجاتكم و خير لكم من أنفاق الذهب و الورق" +
                            " و خير لكم من أن تلقوا عدوكم فتضربوا أعناقهم " +
                            "و يضربوا أعناقكم؟" +
                            " \" قالو بلى " + "\n" +
                            " قال : (ذكر الله تعالى)"
                    ,
                    "و قال رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:" + "\n" +
                            " يقول الله تعالى :" + "\n" + "\n" +
                            " أنا عند ظن عبدي بي ," +
                            " و أنا معه إذا ذكرني , فان ذكرني في نفسه ذكرته في نفسي و ان ذكرني في ملأ ذكرته في ملأ خير منهم ," +
                            " و ان تقرب إلي شبرا تقربت اليه ذراعا و ان تقرب إلى ذراعا تقربت اليه باعا و" +
                            " ان اتاني يمشي أتيته هرولة"
                    ,

                    " قال رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:" + "\n" + "\n" +
                            " \"ما جلس قوم مجلسا لم يذكروا الله فيه " +
                            ", و لم يصلوا على نبيهم الا كان عليهم ترة فان شاء عذبهم و ان شاء غفر لهم\""


            };
        }

        //TODO الرُّقية الشرعية
        else {


            mor = new String[]{

                    "الرُّقية الشرعية من القرآن الكريم" + "\n" + "\n" +

                            " بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ ﴿1﴾ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ ﴿2﴾ الرَّحْمَنِ الرَّحِيمِ " +
                            "﴿3﴾ مَالِكِ يَوْمِ الدِّينِ ﴿4﴾ إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ ﴿5﴾ اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ " +
                            "﴿6﴾ صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ ﴿7﴾" + "\n" + "\n" +
                            "[الفاتحة: 1-7]"

                    ,
                    " الم ﴿1﴾ ذَلِكَ الْكِتَابُ لَا رَيْبَ فِيهِ هُدًى لِلْمُتَّقِينَ ﴿2﴾" +
                            " الَّذِينَ يُؤْمِنُونَ بِالْغَيْبِ وَيُقِيمُونَ الصَّلَاةَ وَمِمَّا رَزَقْنَاهُمْ يُنْفِقُونَ ﴿3﴾" +
                            " وَالَّذِينَ يُؤْمِنُونَ بِمَا أُنْزِلَ إِلَيْكَ وَمَا أُنْزِلَ مِنْ قَبْلِكَ وَبِالْآَخِرَةِ هُمْ يُوقِنُونَ ﴿4﴾ " +
                            "أُولَئِكَ عَلَى هُدًى مِنْ رَبِّهِمْ وَأُولَئِكَ هُمُ الْمُفْلِحُونَ ﴿5﴾" + "\n" + "\n" +
                            " [البقرة: 1-5]"
                    ,
                    " اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِه" +
                            "ِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء" +
                            " وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ" + "\n" + "\n" +
                            "[آية الكرسى - البقرة 255]"
                    ,


                    " لِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ " +
                            "وَإِنْ تُبْدُوا مَا فِي أَنْفُسِكُمْ أَوْ تُخْفُوهُ يُحَاسِبْكُمْ بِهِ اللَّهُ فَيَغْفِرُ لِمَنْ يَشَاءُ وَيُعَذِّبُ مَنْ يَشَاءُ وَاللَّهُ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ﴿284﴾" +
                            " آَمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ كُلٌّ آَمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ " +
                            "وَقَالُوا سَمِعْنَا وَأَطَعْنَا غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ ﴿285﴾ لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا لَهَا مَا" +
                            " كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا " +
                            "إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ" +
                            " وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا" +
                            " أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ ﴿286﴾" + "\n" + "\n" +
                            " [البقرة: 284-286]"

                    ,

                    " قُلْ يَا أَيُّهَا الْكَافِرُونَ ﴿1﴾ لَا أَعْبُدُ مَا تَعْبُدُونَ ﴿2﴾ " +
                            "وَلَا أَنْتُمْ عَابِدُونَ مَا أَعْبُدُ ﴿3﴾ وَلَا أَنَا عَابِدٌ مَا عَبَدْتُمْ " +
                            "﴿4﴾ وَلَا أَنْتُمْ عَابِدُونَ مَا أَعْبُدُ ﴿5﴾" +
                            " لَكُمْ دِينُكُمْ وَلِيَ دِينِ ﴿6﴾" + "\n" + "\n" +
                            " [الكافرون]"

                    ,
                    " قُلْ هُوَ اللَّهُ أَحَدٌ ﴿1﴾ اللَّهُ الصَّمَدُ ﴿2﴾ لَمْ يَلِدْ وَلَمْ يُولَدْ ﴿3﴾ وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ ﴿4﴾" + "\n" + "\n" +
                            " [الإخلاص]"


                    ,
                    " قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ ﴿1﴾ مِنْ شَرِّ مَا خَلَقَ ﴿2﴾ وَمِنْ شَرِّ غَاسِقٍ إِذَا وَقَبَ ﴿3﴾ " +
                            "وَمِنْ شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ ﴿4﴾" +
                            " وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ ﴿5﴾" + "\n" + "\n" +
                            "[الفلق]"

                    ,
                    " قُلْ أَعُوذُ بِرَبِّ النَّاسِ ﴿1﴾ مَلِكِ النَّاسِ ﴿2﴾ إِلَهِ النَّاسِ ﴿3﴾ مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ ﴿4﴾" +
                            " الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ ﴿5﴾" +
                            " مِنَ الْجِنَّةِ وَالنَّاسِ ﴿6﴾" + "\n" + "\n" +
                            "[الناس]"


            };

        }
    }


    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_azkar);


        // view pager inside recycleview
        final ViewPager viewPager = findViewById(R.id.pager);
        SlidePagerAdapter azadapter = new SlidePagerAdapter(this, mor);
        viewPager.setAdapter(azadapter);


        // Ui
        StepperIndicator indicator = findViewById(R.id.STEPP);
        indicator.setViewPager(viewPager);


        viewPager.addOnPageChangeListener(new ViewPager.OnPageChangeListener() {

            @Override
            public void onPageScrolled(int position, float positionOffset, int positionOffsetPixels) {


            }

            @Override
            public void onPageSelected(int position) {


            }

            @Override
            public void onPageScrollStateChanged(int state) {


                String s = String.valueOf((mor2[viewPager.getCurrentItem()]));

                textViewplus.setText(s);


                buttonplus.setOnClickListener(new View.OnClickListener() {
                    @SuppressLint("SetTextI18n")
                    @Override
                    public void onClick(View v) {


                        mor2[viewPager.getCurrentItem()]++;
                        String s = String.valueOf((mor2[viewPager.getCurrentItem()]));
                        textViewplus.setText(s);


                    }
                });
            }
        });


        // counter
        buttonplus = findViewById(R.id.btnp);
        textViewplus = findViewById(R.id.textViewplus);


        buttonplus.setOnClickListener(new View.OnClickListener() {
            @SuppressLint("SetTextI18n")
            @Override
            public void onClick(View v) {
                mor2[viewPager.getCurrentItem()]++;

                String s = String.valueOf((mor2[viewPager.getCurrentItem()]));

                textViewplus.setText(s);
            }
        });
    }
}













