package com.islamic.Wazaker.Data.DataSets;

import com.islamic.Wazaker.Data.Models.AzkarListModel;

import java.util.ArrayList;
import java.util.List;

public class ZekerDataSet {

    public static List<AzkarListModel> zekeritemList;

    public static List<AzkarListModel> getZekerList(int index) {

        //TODO AZKAR MASJED
        if (index == 0) {
            zekeritemList = new ArrayList<>();

            zekeritemList.add(new AzkarListModel(

                    "دُعَاءُ الذَّهَابِ إلَى المَسْجِدِ" + "\n" + "\n" +

                            "اللّهُـمَّ اجْعَـلْ في قَلْبـي نورا ، وَفي لِسـاني نورا،" +
                            " وَاجْعَـلْ في سَمْعي نورا، وَاجْعَـلْ في بَصَري نورا،" +
                            " وَاجْعَـلْ مِنْ خَلْفي نورا، وَمِنْ أَمامـي نورا،" +
                            " وَاجْعَـلْ مِنْ فَوْقـي نورا ، وَمِن تَحْتـي نورا" +
                            " اللّهُـمَّ أَعْطِنـي نورا"));

            zekeritemList.add(new AzkarListModel(
                    "دُعَاءُ دُخُولِ المَسْجِدِ" + "\n" + "\n" +
                            "يَبْدَأُ بِرِجْلِهِ اليُمْنَى، وَيَقُولُ:" + "\n" +
                            "أَعوذُ باللهِ العَظيـم وَبِوَجْهِـهِ الكَرِيـم " +
                            "وَسُلْطـانِه القَديـم مِنَ الشّيْـطانِ الرَّجـيم، بِسْمِ اللَّهِ، وَالصَّلاةُ وَالسَّلامُ عَلَى رَسُولِ الله،" +
                            " اللّهُـمَّ افْتَـحْ لي أَبْوابَ رَحْمَتـِك. "));

            zekeritemList.add(new AzkarListModel(
                    "دُعَاءُ الخُرُوجِ مِنَ المَسْجِدِ" + "\n" + "\n" +
                            "يَبْدَأُ بِرِجْلِهِ الْيُسْرَى، وَيَقُولُ:" + "\n" +
                            "بِسْـمِ اللَّـهِ وَالصَّلاةُ وَالسَّلامُ عَلَى رَسُولِ اللَّهِ، اللَّهُمَّ إنِّي أَسْأَلُكَ مِنْ فَضْلِكَ، اللَّهُمَّ اعْصِمْنِي مِنَ الشَّيْطَانِ الرَّجِيم."
            ));


            //TODO AFTER PRAY
        } else if (index == 1) {
            zekeritemList = new ArrayList<>();

            zekeritemList.add(new AzkarListModel(
                    "أَسْـتَغْفِرُ الله، أَسْـتَغْفِرُ الله، أَسْـتَغْفِرُ الله" + "\n" +
                            "اللّهُـمَّ أَنْـتَ السَّلامُ ، وَمِـنْكَ السَّلام ، تَبارَكْتَ يا ذا الجَـلالِ وَالإِكْـرام"));

            zekeritemList.add(new AzkarListModel(
                    "لا إلهَ إلاّ اللّهُ وحدَهُ لا شريكَ لهُ، لهُ المُـلْكُ ولهُ الحَمْد، وهوَ على كلّ شَيءٍ قَدير،" +
                            " اللّهُـمَّ لا مانِعَ لِما أَعْطَـيْت، وَلا مُعْطِـيَ لِما مَنَـعْت، " +
                            "وَلا يَنْفَـعُ ذا الجَـدِّ مِنْـكَ الجَـد"
            ));

            zekeritemList.add(new AzkarListModel(
                    "لا إلهَ إلاّ اللّه, وحدَهُ لا شريكَ لهُ، لهُ الملكُ ولهُ الحَمد، وهوَ على كلّ شيءٍ قدير،" +
                            " لا حَـوْلَ وَلا قـوَّةَ إِلاّ بِاللهِ، لا إلهَ إلاّ اللّـه، وَلا نَعْـبُـدُ إِلاّ إيّـاه," +
                            " لَهُ النِّعْـمَةُ وَلَهُ الفَضْل وَلَهُ الثَّـناءُ الحَـسَن،" +
                            " لا إلهَ إلاّ اللّهُ مخْلِصـينَ لَـهُ الدِّينَ " +
                            "وَلَوْ كَـرِهَ الكـافِرون"

            ));

            zekeritemList.add(new AzkarListModel("سُـبْحانَ اللهِ\n" +
                    "\n" +
                    "( ثلاثة و ثلاثون مرة )\n" + "\n" +
                    "الحَمْـدُ لله\n" +
                    "\n" +
                    "( ثلاثة و ثلاثون مرة )\n" + "\n" +
                    "اللهُ أكْـبَر.\n" + "\n" +

                    "( ثلاثة و ثلاثون مرة )"

            ));

            zekeritemList.add(new AzkarListModel(
                    "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم" + "\n" +
                            "قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ" + "\n" + "\n" +
                            "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم" + "\n" +
                            "قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ" + "\n" + "\n" +
                            "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم" + "\n" +
                            "قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ " + "\n" + "\n" +

                            "ثلاث مرات بعد صلاتي الفجر والمغرب. ومرة بعد الصلوات الأخرى "
            ));

            zekeritemList.add(new AzkarListModel(
                    "أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيم" + "\n" +
                            "اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا" +
                            " الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء" +
                            " وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ" + "\n" + "\n" +
                            " [آية الكرسى - البقرة 255]" + "\n" + "\n" +

                            "من قرأ آية الكرسي دبر كل صلاة لم يمنعه من دخول الجنة إلا الموت"

            ));

            zekeritemList.add(new AzkarListModel(
                    "لا إلهَ إلاّ اللّهُ وحْـدَهُ لا شريكَ لهُ، لهُ المُلكُ ولهُ الحَمْد، يُحيـي وَيُمـيتُ وهُوَ على كُلّ شيءٍ قدير" + "\n" + "\n" + "\n" +
                            "عَشْر مَرّات بَعْدَ المَغْرِب وَالصّـبْح"

            ));

            zekeritemList.add(new AzkarListModel(
                    "اللَّهُمَّ أَجِرْنِي مِنْ النَّار"

                            + "\n" + "\n" + "\n" +
                            "اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ وَشُكْرِكَ وَحُسْنِ عِبَادَتِكَ" + "\n" + "\n"
                            + "عن مُعَاذُ بن جبل – رضي الله عنه - أَنَّ رَسُولَ اللَّهِ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ - أَخَذَ بِيَدِهِ وَقَال: \"يَا مُعَاذُ، وَاللَّهِ إِنِّي لَأُحِبُّكَ، وَاللَّهِ إِنِّي لَأُحِبُّكَ\". فَقَالَ: \"أُوصِيكَ يَا مُعَاذُ لَا تَدَعَنَّ فِي دُبُرِ كُلِّ صَلَاةٍ تَقُولُ: \"اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ وَشُكْرِكَ وَحُسْنِ عِبَادَتِكَ\""

            ));

        }

        // TODO AFTER AZAN
        else if (index == 2) {
            zekeritemList = new ArrayList<>();

            zekeritemList.add(new AzkarListModel(
                    "ما يقال عند سماع الأذان" + "\n" +
                            "يَقُولُ مِثْلَ مَا يَقُولُ الـمُؤَذِّنُ إلاَّ فِي حَيَّ عَلَى الصَّلاةِ وَحَيَّ عَلَى الفَلاَح  فَيَقُولُ: لاَ حَوْلَ وَلا قُوَّةَ إلاَّ باللَّهِ"

                            + "\n" + "\n" + "\n" +
                            "عَنْ عبْدِ اللَّهِ بْنِ عَمرِو بْنِ العاصِ رضِيَ اللَّه عنْهُما أَنه سَمِع رسُولَ اللَّهِ صَلّى اللهُ عَلَيْهِ وسَلَّم" +
                            " يقُولُ :" + "\n" +
                            " إِذا سمِعْتُمُ النِّداءَ فَقُولُوا مِثْلَ ما يَقُولُ ، ثُمَّ صَلُّوا علَيَّ ، " +
                            "فَإِنَّهُ مَنْ صَلَّى علَيَّ صَلاةً صَلَّى اللَّه عَلَيْهِ بِهَا عشْراً ، ثُمَّ سلُوا اللَّه لي الْوسِيلَةَ ،" +
                            " فَإِنَّهَا مَنزِلَةٌ في الجنَّةِ لا تَنْبَغِي إِلاَّ لعَبْدٍ منْ عِباد اللَّه" +
                            " وَأَرْجُو أَنْ أَكُونَ أَنَا هُو " +
                            "، فَمنْ سَأَل ليَ الْوسِيلَة حَلَّتْ لَهُ الشَّفاعَةُ" + "\n" + "\n" +
                            " رواه مسلم"

            ));

            zekeritemList.add(new AzkarListModel(
                    "ما يقال بعد سماع الأذان" + "\n" + "\n" +
                            "عَنْ جابرٍ بن عبد الله رضَي اللَّه عنهما" +
                            "أَنَّ رَسُولَ اللَّهِ صَلّى اللهُ عَلَيْهِ وسَلَّم قَالَ : " + "\n" +
                            "من قَال حِين يسْمعُ النِّداءَ : " + "\n" + "\n" +
                            "اللَّهُمَّ رَبَّ هذِهِ الدَّعوةِ التَّامَّةِ ،" +
                            " والصَّلاةِ الْقَائِمةِ، آت مُحَمَّداً الْوسِيلَةَ ، والْفَضَيِلَة، " +
                            "وابْعثْهُ مقَامًا محْمُوداً الَّذي وعَدْتَه ،" +
                            " حلَّتْ لَهُ شَفَاعتي يوْم الْقِيامِة" + "\n" + "\n" +
                            "رواه البخاري"
            ));

            zekeritemList.add(new AzkarListModel(
                    "ما يقال بين الأذان والإقامة" + "\n" + "\n" +
                            "ما بين الأذان والإقامة فالدعاء عندئذٍ مرغّب فيه ومستحب " + "\n" + "\n" +
                            "قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:" + "\n" +
                            " الدُّعَاءُ لَا يُرَدُّ بَيْنَ الْأَذَانِ وَالْإِقَامَةِ " + "\n" + "\n" +
                            "قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:" + "\n" +
                            " إِنَّ الدُّعَاءَ لَا يُرَدُّ بَيْنَ الْأَذَانِ وَالْإِقَامَةِ فَادْعُوا"));

        }

        //TODO WADOOA

        else if (index == 3) {
            zekeritemList = new ArrayList<>();

            zekeritemList.add(new AzkarListModel(
                    "الذكر قبل الوضوء :" + "\n" +
                            " بِسْمِ ٱللّٰه"

                            + "\n" + "\n" + "\n" +
                            "الذكر بعد الوضوء" + "\n" + "\n" +
                            "أشْهَدُ أن لا إله إلا الله وحْدَهُ لا شريكَ لهُ ، وأشْهَدُ أنَّ محمداً عَبدُهُ ورسُولُه " + "\n" +
                            "اللَّهُمَّ اجْعَلْني مِنَ التَّوَّابينَ واجْعَلْنِي من المُتَطَهِّرِينَ" + "\n" +
                            "سُبْحَانَكَ اللَّهُمَّ وبَحَمْدكَ أشْهدُ أنْ لا إلهَ إلا أنْتَ أَسْتَغْفِرُكَ وأتُوبُ إِلَيْكَ"

            ));

        }

        //TODO QURAN DOAA
        else if (index == 4) {
            zekeritemList = new ArrayList<>();

            zekeritemList.add(new AzkarListModel(
                    "رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ" + "\n" + "\n" +

                            "[البقرة - 201]"
            ));

            zekeritemList.add(new AzkarListModel(

                    "رَبَّنَا لاَ تُؤَاخِذْنَا إِن نَّسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلاَ تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِن قَبْلِنَا رَبَّنَا" +
                            " وَلاَ تُحَمِّلْنَا مَا لاَ طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنتَ مَوْلاَنَا فَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ" + "\n" + "\n" +
                            " [البقرة - 286]"
            ));

            zekeritemList.add(new AzkarListModel(

                    "رَبَّنَا لاَ تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا وَهَبْ لَنَا مِن لَّدُنكَ رَحْمَةً إِنَّكَ أَنتَ الْوَهَّابُ" + "\n" + "\n"
                            + "[آل عمران - 8]"

            ));

            zekeritemList.add(new AzkarListModel(
                    "رَبَّنَا إِنَّنَا آمَنَّا فَاغْفِرْ لَنَا ذُنُوبَنَا وَقِنَا عَذَابَ النَّارِ" + "\n" + "\n" +
                            "[آل عمران - 16]"

                            + "\n" + "\n" + "\n" +

                            "رَبِّ هَبْ لِي مِن لَّدُنْكَ ذُرِّيَّةً طَيِّبَةً إِنَّكَ سَمِيعُ الدُّعَاء" + "\n" + "\n" +
                            "[آل عمران - 38]"

            ));

            zekeritemList.add(new AzkarListModel(

                    "رَبَّنَا آمَنَّا بِمَا أَنزَلْتَ وَاتَّبَعْنَا الرَّسُولَ فَاكْتُبْنَا مَعَ الشَّاهِدِينَ" + "\n" + "\n" +

                            "[آل عمران - 53]"
                            + "\n" + "\n" + "\n" +

                            "ربَّنَا اغْفِرْ لَنَا ذُنُوبَنَا وَإِسْرَافَنَا فِي أَمْرِنَا وَثَبِّتْ أَقْدَامَنَا وانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَِ" + "\n" + "\n" +

                            "[آل عمران - 147]"
            ));

            zekeritemList.add(new AzkarListModel(

                    "رَبَّنَا مَا خَلَقْتَ هَذا بَاطِلاً سُبْحَانَكَ فَقِنَا عَذَابَ النَّارِ رَبَّنَا إِنَّكَ مَن تُدْخِلِ النَّارَ فَقَدْ أَخْزَيْتَهُ وَمَا لِلظَّالِمِينَ مِنْ أَنصَارٍ " +
                            "رَّبَّنَا إِنَّنَا سَمِعْنَا مُنَادِيًا يُنَادِي لِلإِيمَانِ أَنْ آمِنُواْ بِرَبِّكُمْ فَآمَنَّا رَبَّنَا فَاغْفِرْ لَنَا ذُنُوبَنَا وَكَفِّرْ عَنَّا سَيِّئَاتِنَا" +
                            " وَتَوَفَّنَا مَعَ الأبْرَارِ رَبَّنَا وَآتِنَا مَا وَعَدتَّنَا عَلَى رُسُلِكَ وَلاَ تُخْزِنَا يَوْمَ الْقِيَامَةِ إِنَّكَ لاَ تُخْلِفُ الْمِيعَادَ" + "\n" + "\n" +

                            "[آل عمران -  191-194]"

            ));

            zekeritemList.add(new AzkarListModel(
                    "رَبَّنَا ظَلَمْنَا أَنفُسَنَا وَإِن لَّمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُونَنَّ مِنَ الْخَاسِرِينَ" + "\n" + "\n" +

                            "[الأعراف - 23]"
            ));

            zekeritemList.add(new AzkarListModel(

                    "رَبَّنَا لاَ تَجْعَلْنَا مَعَ الْقَوْمِ الظَّالِمِينَ" + "\n" + "\n" +

                            "[الأعراف - 47]"
                            + "\n" + "\n" + "\n" +
                            "رَبَّنَا أَفْرِغْ عَلَيْنَا صَبْرًا وَتَوَفَّنَا مُسْلِمِينَ" + "\n" + "\n" +

                            "[الأعراف - 126]"
            ));

            zekeritemList.add(new AzkarListModel(
                    "حَسْبِيَ اللّهُ لا إِلَـهَ إِلاَّ هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ" + "\n" + "\n" +

                            "[التوبة - 129]"
            ));

            zekeritemList.add(new AzkarListModel(
                    "رَبَّنَا لاَ تَجْعَلْنَا فِتْنَةً لِّلْقَوْمِ الظَّالِمِينَ وَنَجِّنَا بِرَحْمَتِكَ مِنَ الْقَوْمِ الْكَافِرِينَ" + "\n" + "\n" +

                            "[يونس - 85-86]"

            ));
            zekeritemList.add(new AzkarListModel(

                    "رَبِّ إِنِّي أَعُوذُ بِكَ أَنْ أَسْأَلَكَ مَا لَيْسَ لِي بِهِ عِلْمٌ وَإِلاَّ تَغْفِرْ لِي وَتَرْحَمْنِي أَكُن مِّنَ الْخَاسِرِينَ" + "\n" + "\n" +

                            "[هود - 47]"

            ));

            zekeritemList.add(new AzkarListModel(
                    "رَبِّ اجْعَلْنِي مُقِيمَ الصَّلاَةِ وَمِن ذُرِّيَّتِي رَبَّنَا وَتَقَبَّلْ دُعَاء" + "\n" + "\n" +

                            " [إبرهيم - 40]"

                            + "\n" + "\n" + "\n" +
                            "رَبَّنَا اغْفِرْ لِي وَلِوَالِدَيَّ وَلِلْمُؤْمِنِينَ يَوْمَ يَقُومُ الْحِسَابُ" + "\n" + "\n" +
                            "[إبرهيم - 41]"

            ));

            zekeritemList.add(new AzkarListModel(
                    "رَّبِّ أَدْخِلْنِي مُدْخَلَ صِدْقٍ وَأَخْرِجْنِي مُخْرَجَ صِدْقٍ وَاجْعَل لِّي مِن لَّدُنكَ سُلْطَانًا نَّصِيرًا" + "\n" + "\n" +

                            "[الإسراء - 80]"
                            + "\n" + "\n" + "\n" +

                            "رَبَّنَا آتِنَا مِن لَّدُنكَ رَحْمَةً وَهَيِّئْ لَنَا مِنْ أَمْرِنَا رَشَدًا" + "\n" + "\n" +

                            "[الكهف - 10]"
            ));

            zekeritemList.add(new AzkarListModel(

                    "رَبِّ اشْرَحْ لِي صَدْرِي وَيَسِّرْ لِي أَمْرِي وَاحْلُلْ عُقْدَةً مِّن لِّسَانِي يَفْقَهُوا قَوْلِي" + "\n" + "\n" +

                            "[طه - 25-28]" + "\n" + "\n" +
                            "رَّبِّ زِدْنِي عِلْمًا" + "\n" + "\n" +

                            "[طه - 114]"

            ));

            zekeritemList.add(new AzkarListModel(

                    "لا إِلَهَ إِلا أَنتَ سُبْحَانَكَ إِنِّي كُنتُ مِنَ الظَّالِمِينَ" + "\n" + "\n" +

                            "[الأنبياء - 87]"

                            + "\n" + "\n" + "\n" +
                            "رَبِّ لَا تَذَرْنِي فَرْدًا وَأَنتَ خَيْرُ الْوَارِثِينَ" + "\n" + "\n" +

                            "[الأنبياء - 89]"

            ));

            zekeritemList.add(new AzkarListModel(
                    "رَّبِّ أَعُوذُ بِكَ مِنْ هَمَزَاتِ الشَّيَاطِينِ وَأَعُوذُ بِكَ رَبِّ أَن يَحْضُرُونِ" + "\n" + "\n" +

                            "[المؤمنون - 97-98]"

                            + "\n" + "\n" + "\n" +
                            "رَبَّنَا آمَنَّا فَاغْفِرْ لَنَا وَارْحَمْنَا وَأَنتَ خَيْرُ الرَّاحِمِينَ" + "\n" + "\n" +
                            "[المؤمنون - 109]"

            ));

            zekeritemList.add(new AzkarListModel(
                    "رَّبِّ اغْفِرْ وَارْحَمْ وَأَنتَ خَيْرُ الرَّاحِمِينَ" + "\n" + "\n" +

                            "[المؤمنون - 118]"));

        }
        //TODO NABAYA DOAA

        else if (index == 5) {
            zekeritemList = new ArrayList<>();

            zekeritemList.add(new AzkarListModel(

                    "سيد الاستغفار" + "\n" +
                            "اللَّهُمَّ أنَْتَ رَبيِّ لَا إلِهََ إلَِّا أنَتَ، خَلَقْتنَيِ وَأنََا عَبدُْكَ،" +
                            " وَأنََا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ،" +
                            " وَأَبُوءُ بِذَنْبِي فَاغْفِرْ لِي فَإِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ" + "\n" + "\n" +

                            "رواه البخاري"
            ));

            zekeritemList.add(new AzkarListModel(

                    "رَبِّ اغْفِرْ لِي خَطِيئَتِي وَجَهْلِي وَإِسْرَافِي فِي أَمْرِي كُلِّهِ وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي، " +
                            "اللَّهُمَّ اغْفِرْ لِي خَطَايَايَ وَعَمْدِي وَجَهْلِي وَهَزْلِي، وَكُلُّ ذَلِكَ عِنْدِي،" +
                            " اللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ وَمَا أَسْرَرْتُ وَمَا أَعْلَنْتُ أَنْتَ الْمُقَدِّمُ" +
                            " وَأَنْتَ الْمُؤَخِّرُ وَأَنْتَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ" + "\n" + "\n" +
                            "رواه البخاري  ومسلم "

            ));

            zekeritemList.add(new AzkarListModel(

                    "اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظُلْمًا كَثِيرًا،" +
                            " وَلَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ، فَاغْفِرْ لِي مَغْفِرَةً مِنْ عِنْدِكَ " +
                            "وَارْحَمْنِي إِنَّك أَنْتَ الْغَفُورُ الرَّحِيمُ" + "\n" + "\n" +
                            "رواه البخاري ومسلم"

            ));

            zekeritemList.add(new AzkarListModel(

                    "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ وَالْعَجْزِ وَالْكَسَلِ وَالْجُبْنِ وَالْبُخْلِ وَضَلَعِ الدَّيْنِ وَغَلَبَةِ الرِّجَالِ" + "\n" + "\n" +

                            "رواه البخاري "

            ));

            zekeritemList.add(new AzkarListModel(

                    "اللَّهُمَّ إنِِّي أَعُوذُ بكَِ مِنَ الْبُخْلِ،" +
                            " وَأَعُوذُ بكَِ مِنَ الْجُبْنِ،" +
                            " وَأَعُوذُ بكَِ أَنْ أُرَدَّ إلَِى أَرْذَلِ الْعُمُرِ،" +
                            " وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الدُّنْيَا، " +
                            "وَأَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ"
                            + "\n" + "\n" +
                            "رواه البخاري"

            ));

            zekeritemList.add(new AzkarListModel(

                    "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكَسَلِ وَالْهَرَمِ وَالْمَأْثَمِ وَالْمَغْرَمِ،" +
                            " وَمِنْ فِتْنَةِ الْقَبْرِ وَعَذَابِ الْقَبْرِ، وَمِنْ فِتْنَةِ النَّارِ وَعَذَابِ النَّارِ،" +
                            " وَمِنْ شَرِّ فِتْنَةِ الْغِنَى، " +
                            "وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْفَقْرِ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ،" +
                            " اللَّهُمَّ اغْسِلْ عَنِّي خَطَايَايَ بِمَاءِ الثَّلْجِ وَالْبَرَدِ،" +
                            " وَنَقِّ قَلْبِي مِنَ الْخَطَايَا كَمَا نَقَّيْتَ الثَّوْبَ الْأَبْيَضَ مِنَ الدَّنَسِ، " +
                            "وَبَاعِدْ بَيْنِي وَبَيْنَ خَطَايَايَ" +
                            " كَمَا بَاعَدْتَ بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ" + "\n" + "\n" +

                            "رواه البخاري  ومسلم"

            ));

            zekeritemList.add(new AzkarListModel(

                    "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ مَا عَمِلْتُ وَمِنْ شَرِّ مَا لَمْ أَعْمَلْ" + "\n" + "\n" +
                            "رواه مسلم"

            ));

            zekeritemList.add(new AzkarListModel(

                    "اللَّهُمَّ رَبَّ السَّمَوَاتِ وَرَبَّ الْأَرْضِ وَرَبَّ الْعَرْشِ الْعَظِيمِ، رَبَّنَا وَرَبَّ كُلِّ شَيْءٍ، فَالِقَ الْحَبِّ وَالنَّوَى" +
                            " وَمُنْزِلَ التَّوْرَاةِ وَالْإِنْجِيلِ وَالْفُرْقَانِ، أَعُوذُ بِكَ مِنْ شَرِّ كُلِّ شَيْءٍ أَنْتَ آخِذٌ بِنَاصِيَتهِِ،" +
                            " اللَّهُمَّ أَنْتَ الْأوََّلُ فَلَيْسَ قَبْلَكَ شَيْءٌ، وَأَنْتَ الْآخِرُ فَلَيْسَ بَعْدَكَ شَيْءٌ، " +
                            "وَأَنْتَ الظَّاهِرُ فَلَيْسَ فَوْقَكَ شَيْءٌ، وَأَنْتَ الْبَاطِنُ فَلَيْسَ دُونَكَ شَيْءٌ، " +
                            "اقْضِ عَنَّا الدَّيْنَ وَأَغْنِنَا مِنَ الْفَقْرِ" + "\n" + "\n" +
                            "رواه مسلم"
            ));


            zekeritemList.add(new AzkarListModel(
                    "اللَّهُمَّ أَصْلِحْ لِي دِينِي الَّذِي هُوَ عِصْمَةُ أَمْرِي، وَأَصْلِحْ لِي دُنْيَايَ الَّتِي فِيهَا مَعَاشِي، " +
                            "وَأَصْلِحْ لِي آخِرَتِي الَّتِي فِيهَا مَعَادِي وَاجْعَلِ الْحَيَاةَ زِيَادَةً لِي فِي كُلِّ خَيْرٍ، " +
                            "وَاجْعَلِ الْمَوْتَ رَاحَةً لِي مِنْ كُلِّ شَرٍّ" + "\n" + "\n" +
                            "رواه مسلم"

            ));
            zekeritemList.add(new AzkarListModel(

                    "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْهُدَى وَالتُّقَى وَالْعَفَافَ وَالْغِنَي" + "\n" + "\n" +
                            "رواه مسلم"
            ));

            zekeritemList.add(new AzkarListModel(

                    "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ زَوَالِ نِعْمَتِكَ وَتَحَوُّلِ عَافِيَتِكَ وَفُجَاءَةِ نِقْمَتِكَ وَجَمِيعِ سَخَطِكَ" + "\n" + "\n" +

                            "رواه مسلم"

            ));

            zekeritemList.add(new AzkarListModel(
                    "اللَّهُمَّ مُصَرِّفَ الْقُلُوبِ صَرِّفْ قُلُوبَنَا عَلَى طَاعَتِكَ" + "\n" + "\n" +

                            "رواه مسلم"

            ));

            zekeritemList.add(new AzkarListModel(
                    "اللَّهُمَّ إِنِّي أَعُوذُ بِرِضَاكَ مِنْ سَخَطِكَ، وَبِمُعَافَاتِكَ مِنْ عُقُوبَتِكَ، وَأَعُوذُ بِكَ مِنْكَ،" +
                            " لَا أُحْصِي ثَنَاءً عَلَيْكَ، أَنْتَ كَمَا أَثْنَيْتَ عَلَى نَفْسِكَ" + "\n" + "\n" +


                            "رواه مسلم"
            ));

            zekeritemList.add(new AzkarListModel(

                    "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ جَهْدِ الْبَلَاءِ وَدَرَكِ الشَّقَاءِ وَسُوءِ الْقَضَاءِ وَشَمَاتَةِ الْأَعْدَاءِ" + "\n" + "\n" +

                            "رواه مسلم"
            ));

            zekeritemList.add(new AzkarListModel(

                    "اللَّهُمَّ اجْعَلْ لِي فِي قَلْبِي نُورًا، وَفِي لِسَانِي نُورًا، وَفِي سَمْعِي نُورًا،" +
                            " وَفِي بَصَرِي نُورًا، وَمِنْ فَوْقِي نُورًا، وَمِنْ تَحْتِي نُورًا، وَعَنْ يَمِينِي نُورًا،" +
                            " وَعَنْ شِمَالِي نُورًا، وَمِنْ بَيْنِ يَدَيَّ نُورًا، وَمِنْ خَلْفِي نُورًا،" +
                            " وَاجْعَلْ فِي نَفْسِي نُورًا، وَأَعْظِمْ لِي نُورًا" + "\n" + "\n" +


                            "رواه البخاري  ومسلم"
            ));

            zekeritemList.add(new AzkarListModel(

                    "اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنَ الْخَيْرِ كُلِّهِ عَاجِلِهِ وَآجِلِهِ مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَم،ْ" +
                            " وَأَعُوذُ بِكَ مِنَ الشَّرِّ كُلِّهِ عَاجِلِهِ وَآجِلِهِ مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَمْ، اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ خَيْرِ مَا سَأَلَكَ عَبْدُكَ وَنَبِيُّكَ،" +
                            " وَأَعُوذُ بِكَ مِنْ شَرِّ مَا عَاذَ بِهِ عَبْدُكَ وَنَبِيُّكَ، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْجَنَّةَ وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ، " +
                            "وَأَعُوذُ بِكَ مِنَ النَّارِ وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ وَأَسْأَلُكَ أَنْ تَجْعَلَ كُلَّ قَضَاءٍ قَضَيْتَهُ لِي خَيْرًا" + "\n" + "\n" +

                            "رواه ابن ماجه (3846) بإسناد صحيح عن عائشة"

            ));

            zekeritemList.add(new AzkarListModel(

                    "اللَّهُمَّ إِنِّي أَسْأَلُكَ العَفْوَ وَالْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ،" +
                            " اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِينِي وَدُنْيَايَ وَأَهْلِي وَمَالِي، اللَّهُمَّ اسْتُرْ عَوْرَاتِي وَآمِنْ رَوْعَاتِي،" +
                            " وَاحْفَظنْيِ مِنْ بيَنِْ يَدَيَّ وَمِنْ خَلْفِي وَعَنْ يَمِينيِ وَعَنْ شِمَاليِ وَمِنْ فَوْقِي،" +
                            " وَأَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي" + "\n" + "\n" +
                            "رواه أبو داود (5074) وغيره بإسناد صحيح عن ابن عمر"

            ));

            zekeritemList.add(new AzkarListModel(
                    "اللَّهُمَّ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ، فَاطِرَ السَّمَوَاتِ وَالْأَرْضِ، رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ، أَعُوذُ" +
                            " بِكَ مِنْ شَرِّ نَفْسِي وَشَرِّ الشَّيْطَانِ وَشِرْكِهِ " + "\n" + "\n" +

                            "رواه الترمذي (3392) وغيره بإسناد صحيح عن أبي هريرة"
            ));

            zekeritemList.add(new AzkarListModel(

                    "اللَّهُمَّ إِنِّي أَسْأَلُكَ الثَّبَاتَ فِي الأَمْرِ، وَالْعَزِيمَةَ عَلَى الرُّشْدِ،" +
                            " وَأَسْأَلُكَ مُوجِبَاتِ رَحْمَتكَِ، وَعَزَائمَِ مَغْفِرَتكَِ، وَأسَْألَكَُ شُكْرَ نعِْمَتكَِ، وَحُسْنَ عِباَدَتكَِ، وَأسَْألَكَُ قَلْبًا سَلِيمًا، وَلِسَانًا صَادِقًا، " +
                            "وَأَسْأَلُكَ مِنْ خَيْرِ مَا تَعْلَمُ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا تَعْلَمُ، وَأَسْتَغْفِرُكَ لِمَا تَعْلَمُ، إِنَّكَ أَنْتَ عَلَّامُ الْغُيُوب " + "\n" + "\n" +

                            "رواه الطبراني في الكبير (7135) عن شداد بن أوس"
            ));

            zekeritemList.add(new AzkarListModel(

                    "اللَّهُمَّ اكْفِنِي بِحَلَالِكَ عَنْ حَرَامِكَ وَأَغْنِنِي بِفَضْلِكَ عَمَّنْ سِوَاكَ" + "\n" + "\n" +
                            "رواه الترمذي (3563) بإسناد حسن عن علي."

            ));

            zekeritemList.add(new AzkarListModel(
                    "اللَّهُمَّ عَافِنِي فِي بَدَنِي، اللَّهُمَّ عَافِنِي فِي سَمْعِي، اللَّهُمَّ عَافِنِي فِي بَصَرِي،" +
                            " لَا إلَِهَ إلَِّا أَنْتَ، اللَّهُمَّ إنِِّي أَعُوذُ بِكَ مِنَ الْكُفْرِ وَالْفَقْرِ، اللَّهُمَّ إنِِّي أَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، لَا إِلَهَ إِلَّا أَنْتَ. " + "\n" + "\n" +

                            "رواه أبو داود (5090) بإسناد حسن عن أبي بكرة"

            ));

            zekeritemList.add(new AzkarListModel(
                    "رَبِّ أَعِنِّي وَلَا تُعِنْ عَلَيَّ، وَانْصُرْنِي وَلَا تَنْصُرْ عَلَيَّ، وَامْكُرْ لِي وَلا تَمْكُرْ عَلَيَّ، وَاهْدِنِي وَيَسِّرِ الْهُدَى لِي، وَانْصُرْنِي عَلَى مَنْ بَغَى عَلَيَّ، رَبِّ اجْعَلْنِي لَكَ شَكَّارًا،" +
                            " لَكَ ذَكَّارًا، لَكَ رَهَّابًا، لَكَ مِطْوَاعًا، لَكَ مُخْبِتًا إِلَيْكَ أَوَّاهًا مُنِيبًا، رَبِّ تَقَبَّلْ تَوْبَتِي وَاغْسِلْ حَوْبَتِي " +
                            "وَأَجِبْ دَعْوَتِي وَثَبِّتْ حُجَّتِي وَسَدِّدْ لِسَانِي وَاهْدِ قَلْبِي وَاسْلُلْ سَخِيمَةَ صَدْرِي" + "\n" + "\n" +

                            "رواه الترمذي (3551) وغيره بإسناد صحيح عن ابن عباس"

            ));

            zekeritemList.add(new AzkarListModel(
                    "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ وعَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ، " +
                            "اللّٰهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ" + "\n" + "\n" +
                            "رواه البخاري (3370) ومسلم (908) عن كعب بن عُجرة"));
        }
        //TODO EATING AZKAR

        else if (index == 6) {
            zekeritemList = new ArrayList<>();

            zekeritemList.add(new AzkarListModel(

                    "الذكر عند الطعام والشراب" + "\n" +
                            "بِسْمِ اللهِ" + "\n" +
                            "فإنْ نسي في أَوَّلِهِ، فَليَقُلْ:" + "\n" +
                            "بِسْمِ اللَّه أَوَّلَهُ وَآخِرَهُ."
            ));

            zekeritemList.add(new AzkarListModel(
                    "الذكر عند الفراغ من الطعام والشراب" + "\n" + "\n" +
                            "الْحَمْدُ للهِ الَّذِي أَطْعَمَنِي هَذَا, وَرَزَقَنِيهِ مِنْ غَيْرِ حَوْلٍ مِّنِّي وَلاَ قُوَّة" + "\n" +
                            "الْحَمْدُ لِلَّهِ كَثِيرًا طَيِّبًا مُبَارَكًا فِيهِ غَيْرَ مَكْفِيٍّ وَلَا مُوَدَّعٍ وَلَا مُسْتَغْنًى عَنْهُ رَبَّنَا"
            ));

            zekeritemList.add(new AzkarListModel(
                    "هدى النبى فى الشرب" + "\n" + "\n" +
                            "كَانَ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَشْرَبُ فِي ثَلاَثَةِ أَنْفَاسٍ، إِذَا " +
                            "أَدْنَى الإِنَاءَ إِلَى فَمِهِ سَمَّى اللهَ تَعَالَى, وَإِذَا أَخَّرَهُ حَمِدَ اللهَ تَعَالَى، يَفْعَلُ ذَلِكَ ثَلاَثَ مَرَّاتٍ"

            ));

            zekeritemList.add(new AzkarListModel(
                    "أذكار الضيف" + "\n" + "\n" +
                            "أَفْطَرَ عِنْدَكُمُ الصَّائِمُونَ ، وَأَكَلَ طَعَامَكُمُ الأَبْرَارُ ، وَصَلَّتْ عَلَيْكُمُ الْمَلائِكَةُ"));

        }
        //TODO HOUSE AZKAR

        else if (index == 7) {
            zekeritemList = new ArrayList<>();

            zekeritemList.add(new AzkarListModel(
                    "أذكار الدخول إلى المنزل" + "\n" + "\n" +
                            "بِسْـمِ اللهِ وَلَجْنـا، وَبِسْـمِ اللهِ خَـرَجْنـا، وَعَلـى رَبِّنـا تَوَكّلْـنا"

                            + "\n" + "\n" +
                            "أذكار الخروج من المنزل" + "\n" + "\n" +
                            "بِسْمِ اللهِ ، تَوَكَّلْـتُ عَلى اللهِ وَلا حَوْلَ وَلا قُـوَّةَ إِلاّ بِالله" +
                            "اللّهُـمَّ إِنِّـي أَعـوذُ بِكَ أَنْ أَضِـلَّ أَوْ أُضَـل ، أَوْ أَزِلَّ أَوْ أُزَل ، أَوْ أَظْلِـمَ أَوْ أَُظْلَـم ، أَوْ أَجْهَلَ أَوْ يُـجْهَلَ عَلَـيّ"));

        }

        //TODO SLEEPING AZKAR
        else if (index == 8) {
            zekeritemList = new ArrayList<>();

            zekeritemList.add(new AzkarListModel(

                    "بِاسْمِكَ رَبِّـي وَضَعْـتُ جَنْـبي ، وَبِكَ أَرْفَعُـه، فَإِن أَمْسَـكْتَ نَفْسـي فارْحَـمْها ،" +
                            " وَإِنْ أَرْسَلْتَـها فاحْفَظْـها بِمـا تَحْفَـظُ بِه عِبـادَكَ الصّـالِحـين"
            ));

            zekeritemList.add(new AzkarListModel(

                    "اللّهُـمَّ إِنَّـكَ خَلَـقْتَ نَفْسـي وَأَنْـتَ تَوَفّـاهـا لَكَ ممَـاتـها وَمَحْـياها ،" +
                            " إِنْ أَحْيَيْـتَها فاحْفَظْـها ، وَإِنْ أَمَتَّـها فَاغْفِـرْ لَـها ." +
                            " اللّهُـمَّ إِنَّـي أَسْـأَلُـكَ العـافِـيَة"
            ));

            zekeritemList.add(new AzkarListModel(
                    "يجمع كفيه ثم ينفث فيهما والقراءة فيهما قل هو الله أحد قل أعوذ برب الفلق وقل أعوذ برب الناس ومسح ما" +
                            " استطاع من الجسد يبدأ بهما على رأسه ووجه وما أقبل من جسده"

            ));

            zekeritemList.add(new AzkarListModel(
                    "الـحَمْدُ للهِ الَّذي أَطْـعَمَنا وَسَقـانا، وَكَفـانا، وَآوانا، فَكَـمْ مِمَّـنْ لا كـافِيَ لَـهُ وَلا مُـؤْوي"


            ));

            zekeritemList.add(new AzkarListModel(
                    "آية الكرسى:" + "\n" + "\n" +
                            " أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيم" + "\n" +
                            "اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا" +
                            " الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ " +
                            "إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا" +
                            " وَهُوَ الْعَلِيُّ الْعَظِيمُ" + "\n" + "\n" +
                            " [البقرة 255] " + "\n" + "\n" + "أجير من الجن حتى يصبح"

            ));
            zekeritemList.add(new AzkarListModel(
                    "أذكار الأحلام" + "\n" + "\n" +
                            "عن أبي قتادة رضي الله عنه قال قال رسول الله صلى الله عليه وسلم" +
                            "الرؤيا الصالحة وفي رواية الرؤيا الحسنة من الله، " + "\n" +
                            "والحلم من الشيطان، فمن رأى شيئا يكرهه فلينفث عن شماله ثلاثا وليتعوذ من الشيطان، فإنها لا تضره"
            ));

        }

        //TODO WAKING AZKAR
        else if (index == 9) {
            zekeritemList = new ArrayList<>();

            zekeritemList.add(new AzkarListModel(
                    "الحَمْـدُ لِلّهِ الّذي أَحْـيانا بَعْـدَ ما أَماتَـنا وَإليه النُّـشور"

                            + "\n" + "\n" + "\n" +

                            "الحمدُ للهِ الذي عافاني في جَسَدي وَرَدّ عَليّ روحي وَأَذِنَ لي بِذِكْرِه"

            ));

            zekeritemList.add(new AzkarListModel(
                    "لا إلهَ إلاّ اللّهُ وَحْـدَهُ لا شَـريكَ له، لهُ المُلـكُ ولهُ الحَمـد،" +
                            " وهوَ على كلّ شيءٍ قدير، سُـبْحانَ اللهِ، والحمْـدُ لله ،" +
                            " ولا إلهَ إلاّ اللهُ واللهُ أكبَر، وَلا حَولَ وَلا قوّة" +
                            " إلاّ باللّهِ العليّ العظيم. رَبِّ اغْفرْ لي"));
        }


        else if (index == 10) {

            zekeritemList = new ArrayList<>();
            zekeritemList.add(new AzkarListModel("سُبْحَانَ اللَّهِ.\n" +
                    "\n" +
                    "مائة مرة.\n" +
                    "يكتب له ألف حسنة أو يحط عنه ألف خطيئة."
            ));

            zekeritemList.add(new AzkarListModel(
                    "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ.\n" +
                            "\n" +
                            "مائة مرة.\n" +
                            "حُطَّتْ خَطَايَاهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ. لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ بِأَفْضَلَ مِمَّا جَاءَ بِهِ إِلَّا أَحَدٌ قَالَ مِثْلَ مَا قَالَ أَوْ زَادَ عَلَيْهِ."
            ));

            zekeritemList.add(new AzkarListModel(
                    "سُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ.\n" +
                            "\n" +
                            "مائة مرة.\n" +
                            "تَمْلَآَنِ مَا بَيْنَ السَّمَاوَاتِ وَالْأَرْضِ."
            ));

            zekeritemList.add(new AzkarListModel(
                    "سُبْحَانَ اللهِ العَظِيمِ وَبِحَمْدِهِ.\n" +
                            "\n" +
                            "مائة مرة.\n" +
                            "غرست له نخلة في الجنة "
            ));

            zekeritemList.add(new AzkarListModel(
                    "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ, سُبْحَانَ اللَّهِ الْعَظِيمِ.\n" +
                            "\n" +
                            "مائة مرة.\n" +
                            "ثقيلتان في الميزان حبيبتان إلى الرحمن "

            ));

            zekeritemList.add(new AzkarListModel(
                    "لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ, لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلُّ شَيْءِ قَدِيرِ.\n" +
                            "\n" +
                            "مائة مرة.\n" +
                            "كانت له عدل عشر رقاب, وكتبت له مئة حسنة, ومحيت عنه مئة سيئة, وكانت له حرزا من الشيطان"
            ));

            zekeritemList.add(new AzkarListModel(
                    "لا حَوْلَ وَلا قُوَّةَ إِلا بِاللَّهِ.\n" +
                            "\n" +
                            "مائة مرة.\n" +
                            "كنز من كنوز الجنة (أى عدد)"
            ));

            zekeritemList.add(new AzkarListModel(
                    "الْحَمْدُ للّهِ رَبِّ الْعَالَمِينَ.\n" +
                            "\n" +
                            "مائة مرة.\n" +
                            "تملأ ميزان العبد بالحسنات"
            ));

            zekeritemList.add(new AzkarListModel(
                    "الْلَّهُم صَلِّ وَسَلِم وَبَارِك عَلَى سَيِّدِنَا مُحَمَّد.\n" +
                            "\n" +
                            "مائة مرة.\n" +
                            "من صلى على حين يصبح وحين يمسى ادركته شفاعتى يوم القيامة"
            ));

            zekeritemList.add(new AzkarListModel(
                    "أستغفر الله\n" +
                            "\n" +
                            "مائة مرة.\n" +
                            "لفعل الرسول صلى الله عليه وسلم"
            ));
            zekeritemList.add(new AzkarListModel(
                    "سُبْحَانَ الْلَّهِ, وَالْحَمْدُ لِلَّهِ, وَلَا إِلَهَ إِلَّا الْلَّهُ, وَالْلَّهُ أَكْبَر\n" +
                            "\n" +
                            "مائة مرة.\n" +
                            "أنهن أحب الكلام الى الله, ومكفرات للذنوب, وغرس الجنة, وجنة لقائلهن من النار, وأحب الى النبي عليه السلام مما طلعت عليه الشمس, والْبَاقِيَاتُ الْصَّالِحَات"
            ));
            zekeritemList.add(new AzkarListModel(
                    "لَا إِلَهَ إِلَّا اللَّهُ\n" +
                            "\n" +
                            "مائة مرة.\n" +
                            "أفضل الذكر لا إله إلاّ الله"
            ));
            zekeritemList.add(new AzkarListModel(
                    "الْلَّهُ أَكْبَرُ\n" +
                            "\n" +
                            "مائة مرة.\n" +
                            "من قال الله أكبر كتبت له عشرون حسنة وحطت عنه عشرون سيئة. الله أكبر من كل شيء"
            ));
            zekeritemList.add(new AzkarListModel(
                    "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ , وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ , اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ\n" +
                            "\n" +
                            "مائة مرة.\n" +
                            "في كل مره تحط عنه عشر خطايا ويرفع له عشر درجات ويصلي الله عليه عشرا وتعرض على الرسول صلى الله عليه وسلم."
            ));


        }


        else if (index == 11) {

            zekeritemList=new ArrayList<>();
            zekeritemList.add(new AzkarListModel(
                    "( دعاء السفر )" + "\n" + "\n" +

                            "الله أكبر الله أكبر الله أكبر، " + "\n" +
                            "〈 سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ ⓭ وَإِنَّا إِلَى رَبِّنَا لَمُنقَلِبُونَ ⓮ 〉 " + "\n" + "\n" +
                            "اللّهمّ إنّا نسألُكَ في سَفَرِنَا هذَا البِرّ والتّقْوَى، ومِن العَمَلِ مَاتَرْضَى، اللّهمّ هَوِّنْ عَلَيْنَا سَفَرِنَا هذَا وَاطْوِ عَنَّا بُعْدَه، اللَّهُمَّ أَنْتَ الصَّاحِبُ فِي السَّفَرِ، وَالْخَلِيفَةُ فِي الأَهْلِ، " +
                            "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ وَعَثَاءِ السَّفَرِ وَكَآبَةِ الْمَنْظَر وَسُوءِ الْمُنْقَلَبِ فِي الْمَالِ وَالأَهْلِ\n" + "\n" +
                            "وَإِذَا رَجَعَ قَالَهُنَّ وَزَادَ " + "\n" +
                            "” آيِبُونَ تَائِبُونَ عَابِدُونَ لِرَبِّنَا حَامِدُونَ “ " + "\n" +
                            "رَوَاهُ مُسْلِمْ"
            ));

        }


        //TODO دعاء ختم القران الكريم
        else if (index == 12) {
            zekeritemList = new ArrayList<>();

            zekeritemList.add(new AzkarListModel(

                    "اللَّهُمَّ ارْحَمْنِي بالقُرْءَانِ وَاجْعَلهُ لِي إِمَاماً وَنُوراً وَهُدًى وَرَحْمَةً " +
                            "\n" + "\n" + "\n" +
                            "اللَّهُمَّ ذَكِّرْنِي مِنْهُ مَانَسِيتُ وَعَلِّمْنِي مِنْهُ مَاجَهِلْتُ وَارْزُقْنِي تِلاَوَتَهُ آنَاءَ اللَّيْلِ وَأَطْرَافَ النَّهَارِ وَاجْعَلْهُ لِي حُجَّةً يَارَبَّ العَالَمِينَ "
            ));
            zekeritemList.add(new AzkarListModel(

                    "اللَّهُمَّ أَصْلِحْ لِي دِينِي الَّذِي هُوَ عِصْمَةُ أَمْرِي، وَأَصْلِحْ لِي دُنْيَايَ الَّتِي فِيهَا مَعَاشِي،" +
                            " وَأَصْلِحْ لِي آخِرَتِي الَّتِي فِيهَا مَعَادِي، وَاجْعَلِ الحَيَاةَ زِيَادَةً لِي فِي كُلِّ خَيْرٍ وَاجْعَلِ المَوْتَ رَاحَةً لِي مِنْ كُلِّ شَرٍّ"));

            zekeritemList.add(new AzkarListModel(
                    "اللَّهُمَّ اجْعَلْ خَيْرَ عُمْرِي آخِرَهُ وَخَيْرَ عَمَلِي خَوَاتِمَهُ وَخَيْرَ أَيَّامِي يَوْمَ أَلْقَاكَ فِيهِ" + "\n" + "\n" +

                            "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِيشَةً هَنِيَّةً وَمِيتَةً سَوِيَّةً وَمَرَدًّا غَيْرَ مُخْزٍ وَلاَ فَاضِحٍ"

            ));

            zekeritemList.add(new AzkarListModel(
                    "اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَ المَسْأَلةِ وَخَيْرَ الدُّعَاءِ وَخَيْرَ النَّجَاحِ وَخَيْرَ العِلْمِ وَخَيْرَ العَمَلِ وَخَيْرَ الثَّوَابِ وَخَيْرَ الحَيَاةِ " +
                            "وَخيْرَ المَمَاتِ وَثَبِّتْنِي وَثَقِّلْ مَوَازِينِي وَحَقِّقْ إِيمَانِي وَارْفَعْ دَرَجَتِي وَتَقَبَّلْ صَلاَتِي وَاغْفِرْ خَطِيئَاتِي وَأَسْأَلُكَ العُلَا مِنَ الجَنَّةِ"

            ));

            zekeritemList.add(new AzkarListModel(
                    "اللَّهُمَّ إِنِّي أَسْأَلُكَ مُوجِبَاتِ رَحْمَتِكَ وَعَزَائِمِ مَغْفِرَتِكَ وَالسَّلاَمَةَ مِنْ كُلِّ إِثْمٍ وَالغَنِيمَةَ مِنْ كُلِّ بِرٍّ وَالفَوْزَ بِالجَنَّةِ وَالنَّجَاةَ مِنَ النَّارِ"

            ));
            zekeritemList.add(new AzkarListModel(

                    "اللَّهُمَّ أَحْسِنْ عَاقِبَتَنَا فِي الأُمُورِ كُلِّهَا، وَأجِرْنَا مِنْ خِزْيِ الدُّنْيَا وَعَذَابِ الآخِرَةِ"

            ));
            zekeritemList.add(new AzkarListModel(
                    "اللَّهُمَّ اقْسِمْ لَنَا مِنْ خَشْيَتِكَ مَاتَحُولُ بِهِ بَيْنَنَا" +
                            " وَبَيْنَ مَعْصِيَتِكَ وَمِنْ طَاعَتِكَ مَاتُبَلِّغُنَا بِهَا جَنَّتَكَ وَمِنَ اليَقِينِ مَاتُهَوِّنُ بِهِ عَلَيْنَا مَصَائِبَ الدُّنْيَا " +
                            "وَمَتِّعْنَا بِأَسْمَاعِنَا وَأَبْصَارِنَا وَقُوَّتِنَا مَاأَحْيَيْتَنَا" +
                            " وَاجْعَلْهُ الوَارِثَ مِنَّا " +
                            "وَاجْعَلْ ثَأْرَنَا عَلَى مَنْ ظَلَمَنَا وَانْصُرْنَا عَلَى مَنْ عَادَانَا وَلاَ تجْعَلْ مُصِيبَتَنَا فِي دِينِنَا" +
                            " وَلاَ تَجْعَلِ الدُّنْيَا أَكْبَرَ هَمِّنَا وَلَا مَبْلَغَ عِلْمِنَا وَلاَ تُسَلِّطْ عَلَيْنَا مَنْ لَا يَرْحَمُنَا "

            ));

            zekeritemList.add(new AzkarListModel(

                    "اللَّهُمَّ لَا تَدَعْ لَنَا ذَنْبًا إِلَّا غَفَرْتَهُ وَلَا هَمَّا إِلَّا فَرَّجْتَهُ وَلَا دَيْنًا إِلَّا قَضَيْتَهُ وَلَا حَاجَةً مِنْ حَوَائِجِ الدُّنْيَا وَالآخِرَة" +
                            " إِلَّا قَضَيْتَهَا يَاأَرْحَمَ الرَّاحِمِينَ"
            ));
            zekeritemList.add(new AzkarListModel(

                    "رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ " +
                            "وَصَلَّى اللهُ عَلَى سَيِّدِنَا وَنَبِيِّنَا مُحَمَّدٍ وَعَلَى آلِهِ" +
                            " وَأَصْحَابِهِ الأَخْيَارِ " +
                            "وَسَلَّمَ تَسْلِيمًا كَثِيراً"));

        }


        //TODO فضل الدعاء
        else if (index == 13) {
            zekeritemList = new ArrayList<>();

            zekeritemList.add(new AzkarListModel(
                    "معنى الدعاء" + "\n" + "\n" +
                            "الدعاء هو أن يطلبَ الداعي ما ينفعُه وما يكشف ضُرَّه؛ وحقيقته إظهار الافتقار إلى الله، والتبرؤ من الحول والقوة، " +
                            "وهو سمةُ العبوديةِ، واستشعارُ الذلةِ البشرية، وفيه معنى الثناءِ على الله عز وجل، وإضافةِ الجود والكرم إليه"

            ));

            zekeritemList.add(new AzkarListModel(

                    "الدعاءُ طاعةٌ لله، وامتثال لأمره" + "\n" + "\n" +
                            "قال تعالى: وَقَالَ رَبُّكُمُ ادْعُونِي أَسْتَجِبْ لَكُمْ إِنَّ الَّذِينَ يَسْتَكْبِرُونَ عَنْ عِبَادَتِي سَيَدْخُلُونَ جَهَنَّمَ دَاخِرِينَ" + "\n" + "\n" +
                            "[سورة غافر: الآية 60]"

            ));

            zekeritemList.add(new AzkarListModel(
                    "الدعاء عبادة" + "\n" + "\n" +
                            "قال صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : " + "\n" +
                            "الدُّعَاءُ هُوَ الْعِبَادَةُ" + "\n" + "\n" +
                            " [رواه الترمذي وابن ماجه، وصححه الألباني]"

            ));

            zekeritemList.add(new AzkarListModel(

                    "الدعاء أكرم شيء على الله تعالى" + "\n" + "\n" +
                            "قال صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ : " + "\n" +
                            "لَيْسَ شَيْءٌ أَكْرَمَ عَلَى اللَّهِ تَعَالَى مِنْ الدُّعَاء" + "\n" + "\n" +
                            " [رواه أحمد والبخاري، وابن ماجة، والترمذي والحاكم وصححه، ووافقه الذهبي]"

            ));
            zekeritemList.add(new AzkarListModel(

                    "الدعاء سبب لدفع غضب الله" + "\n" + "\n" +
                            "قال صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: " + "\n" +
                            "مَنْ لَمْ يَسْأَلْ اللَّهَ يَغْضَبْ عَلَيْه" + "\n" + "\n" +
                            "[رواه الترمذيُّ، وابن ماجةَ، وصححه الحاكم، ووافقه الذهبي، وحسنه الألباني]"

            ));

            zekeritemList.add(new AzkarListModel(

                    "الدعاء سلامة من العجز، ودليل على الكَياسة" + "\n" + "\n" +
                            "قال صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:" + "\n" +
                            "أَعْجَزُ النَّاسِ مَنْ عَجَزَ عَنْ الدُّعَاءِ وَأَبْخَلُ النَّاسِ مَنْ بَخِلَ بِالسَّلَامِ" + "\n" + "\n" +
                            "[رواه ابن حبان وصححه الألباني]"

            ));
            zekeritemList.add(new AzkarListModel(

                    "الدعاء سبب لرفع البلاء" + "\n" + "\n" +
                            "قال صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: " + "\n" +
                            "مَنْ فُتِحَ لَهُ مِنْكُمْ بَابُ الدُّعَاءِ " +
                            "فُتِحَتْ لَهُ أَبْوَابُ الرَّحْمَةِ وَمَا سُئِلَ اللَّهُ شَيْئًا يَعْنِي أَحَبَّ إِلَيْهِ مِنْ أَنْ يُسْأَلَ الْعَافِيَةَ" +
                            " وَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهم عَلَيْهِ وَسَلَّمَ " + "\n" +
                            "إِنَّ الدُّعَاءَ يَنْفَعُ مِمَّا نَزَلَ وَمِمَّا لَمْ يَنْزِلْ فَعَلَيْكُمْ عِبَادَ اللَّهِ بِالدُّعَاءِ" + "\n" + "\n" +
                            " [رواه الترمذي وحسنه الألباني ]"

            ));
            zekeritemList.add(new AzkarListModel(

                    "الداعي في معيةُ الله" + "\n" + "\n" +
                            "قال رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: " + "\n" +
                            "يقول الله عز وجل: أَنَا عِنْدَ ظَنِّ عَبْدِي بِي وَأَنَا مَعَهُ إِذَا دَعَانِي" + "\n" + "\n" +
                            " [رواه مسلم]"


            ));
            zekeritemList.add(new AzkarListModel(

                    "فضل الدعاء في السجود" + "\n" + "\n" +
                            "قال صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:" + "\n" +
                            "أَقْرَبُ مَا يَكُونُ الْعَبْدُ مِنْ رَبِّهِ عَزَّ وَجَلَّ وَهُوَ سَاجِدٌ ، فَأَكْثِرُوا الدُّعَاء" + "\n" + "\n" +
                            " [رواه مسلم]"

            ));
            zekeritemList.add(new AzkarListModel(

                    "فضل الدعاء بالليل" + "\n" + "\n" +
                            "قال صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: " + "\n" +
                            " إِنَّ فِي اللَّيْلِ لَسَاعَةٌ لَا يُوَافِقُهَا رَجُلٌ مُسْلِمٌ يَسْأَلُ اللَّهَ تَعَالَى مِنْ أَمْرِ الدُّنْيَا وَالْآخِرَةِ إِلَّا أَعْطَاهُ إِيَّاهُ وَذَلِكَ كُلَّ لَيْلَةٍ" + "\n" + "\n" +
                            " [رواه مسلم]"

            ));

            zekeritemList.add(new AzkarListModel(
                    "فضل الدعاء للمسلمين بظهر الغيب" + "\n" + "\n" +
                            "قال صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:" + "\n" +
                            " مَا مِنْ عَبْدٍ مُسْلِمٍ يَدْعُو لِأَخِيهِ بِظَهْرِ الْغَيْبِ إِلَّا قَالَ الْمَلَكُ : وَلَكَ بِمِثْلٍ" + "\n" + "\n" +
                            " [رواه مسلم]"));
        }

        // TODO فضل القرأن الكريم
        else  if (index ==14){
            zekeritemList = new ArrayList<>();

            zekeritemList.add(new AzkarListModel(

                    "قال تعالى: ﴿ الَّذِينَ آَتَيْنَاهُمُ الْكِتَابَ يَتْلُونَهُ حَقَّ تِلَاوَتِهِ أُولَئِكَ يُؤْمِنُونَ بِهِ" +
                            " وَمَنْ يَكْفُرْ بِهِ فَأُولَئِكَ هُمُ الْخَاسِرُونَ ﴾ [سورة البقرة: 121].\n"
                            + "\n" + "\n" +
                            "وقال سبحانه: ﴿ إِنَّمَا الْمُؤْمِنُونَ الَّذِينَ إِذَا ذُكِرَ اللَّهُ وَجِلَتْ قُلُوبُهُمْ وَإِذَا تُلِيَتْ عَلَيْهِمْ آَيَاتُهُ زَادَتْهُمْ إِيمَانًا وَعَلَى رَبِّهِمْ يَتَوَكَّلُونَ ﴾ [الأنفال: 2].\n"
            ));

            zekeritemList.add(new AzkarListModel(
                    "وقال سبحانه: ﴿ أَقِمِ الصَّلَاةَ لِدُلُوكِ الشَّمْسِ إِلَى غَسَقِ اللَّيْلِ وَقُرْآَنَ الْفَجْرِ إِنَّ قُرْآَنَ الْفَجْرِ كَانَ مَشْهُودًا * وَمِنَ اللَّيْلِ فَتَهَجَّدْ بِهِ نَافِلَةً لَكَ عَسَى أَنْ يَبْعَثَكَ رَبُّكَ مَقَامًا مَحْمُودًا ﴾ [الإسراء: 78، 79].\n" +
                            "\n" + "\n" + "\n" +
                            "روى الترمذي من حديث عبدالله بن مسعود رضي الله عنه أن رسول الله - صلى الله عليه وسلم - قال: «من قرأ حرفًا من كتاب الله فله به حسنة، والحسنة بعشر أمثالها، لا أقول: ألم حرف بل ألف حرف ولام حرف وميم حرف»\n" +
                            "\n"));

            zekeritemList.add(new AzkarListModel(

                    "وروى الشيخان من حديث أبي موسى الأشعري رضي الله عنه أن رسول الله - صلى الله عليه وسلم - قال: «مثل المؤمن الذي يقرأ القرآن مثل الأترجة ريحها طيب وطعمها طيب، ومثل المؤمن الذي لا يقرأ القرآن كمثل التمرة لا ريح لها وطعمها حلو، ومثل المنافق الذي يقرأ القرآن مثل الريحانة ريحها طيب وطعمها مر، مثل المنافق الذي لا يقرأ القرآن كمثل الحنظلة ليس لها ريح وطعمها مر»\n" +
                            "\n"
            ));
            zekeritemList.add(new AzkarListModel(
                    "وروى مسلم من حدث أبي أمامة الباهلي رضي الله عنه أن رسول الله - صلى الله عليه وسلم - قال: «اقرؤوا القرآن فإنه يأتي يوم القيامة شفيعًا لأصحابه»\n" +
                            "\n"));
            zekeritemList.add(new AzkarListModel(
                    "وروى الإمام مسلم أيضًا من حديث النواس بن سمعان رضي الله عنه أن رسول الله - صلى الله عليه وسلم - قال: «يؤتى يوم القيامة بالقرآن وأهله الذين كانوا يعملون به في الدنيا، تقدمه سورة البقرة وآل عمران تحاجان عن صاحبهما»\n" +
                            "\n"));

            zekeritemList.add(new AzkarListModel(
                    "وروى البخاري من حديث عثمان بن عفان رضي الله عنه أن رسول الله - صلى الله عليه وسلم - قال: «خيركم من تعلم القرآن وعلمه»\n" +
                            "\n" + "\n" + "\n" +

                            "وقال سبحانه:﴿ وَلَقَدْ يَسَّرْنَا الْقُرْءَانَ لِلذِّكْرِ فَهَلْ مِن مُّدَّكِرٍ ﴾ [القمر: 17].\n" +
                            "\n"
            ));

            zekeritemList.add(new AzkarListModel(
                    "وروى مسلم من حديث أبي هريرة رضي الله عنه أن رسول الله - صلى الله عليه وسلم - قال: «وما اجتمع قوم في بيت من بيوت الله يتلون كتاب الله ويتدارسونه بينهم، إلا نزلت عليهم السكينة وغشيتهم الرحمة، وحفتهم الملائكة وذكرهم الله فيمن عنده»\n" +
                            "\n" + "\n" + "\n" +
                            "روى أبو داود من حديث عبدالله بن عمرو بن العاص رضي الله عنهما أن رسول الله - صلى الله عليه وسلم - قال: «يقال لصاحب القرآن: اقرأ وارتق ورتل كما كنت ترتل في الدنيا، فإن منزلك عند آخر آية تقرؤها»\n" +
                            "\n"));

        }


        //TODO فضل الأذكار

        else if (index == 15) {
            zekeritemList = new ArrayList<>();

            zekeritemList.add(new AzkarListModel(

                    "إنَّ من أفضل الأعمال الصالحة اليسيرة التي تقرب المسلم إلى ربه جل وعلا الذكرُ" + "\n" + "\n" +


                            "\n" + "قال تعالى : وَلَذِكْرُ اللَّهِ أَكْبَرُ" + "\n" +
                            "\n" + "وقال تعالى : وَسَبِّحُوهُ بُكْرَةً وَأَصِيلًا" + "\n" +
                            "\n" + "وقال تعالى : فَاذْكُرُونِي أَذْكُرْكُمْ وَاشْكُرُوا لِي وَلا تَكْفُرُونِ" + "\n" +
                            "\n" + "وقال تعالى : يَا أَيُّهَا الَّذِينَ آمَنُوا اذْكُرُوا اللَّهَ ذِكْراً كَثِيراً" + "\n"

            ));

            zekeritemList.add(new AzkarListModel(

                    "وقال تعالى : وَاذْكُر رَّبَّكَ كَثِيرًا وَسَبِّحْ بِالْعَشِيِّ وَالْإِبْكَارِ" + "\n" + "\n" +

                            "وقال تعالى :" + "\n" +
                            " يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تُلْهِكُمْ أَمْوَالُكُمْ وَلَا أَوْلَادُكُمْ عَن ذِكْرِ اللَّهِ" + "\n" + "\n" +
                            "وقال تعالى : " + "\n" +
                            "فَإِذَا قَضَيْتُم مَّنَاسِكَكُمْ فَاذْكُرُوا اللَّهَ كَذِكْرِكُمْ آبَاءَكُمْ أَوْ أَشَدَّ ذِكْرًا"

            ));

            zekeritemList.add(new AzkarListModel(
                    "أحاديث صحيحة عن رسول الله صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، نذكر ما تيسر منها" + "\n" + "\n" +

                            " قال رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:" + "\n" +
                            " \"مثل الذي يذكر ربه و الذي لا يذكر ربه مثل الحي و الميت\"." + "\n" + "\n" + "\n" +
                            "و قال رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:" + "\n" +
                            " \"من قعد مقعدا لم يذكر الله فيه كانت عليه من الله تره , و من أضطجع مضجعا" +
                            " لم يذكر فيه الله كانت عليه ترة\"."


            ));

            zekeritemList.add(new AzkarListModel(
                    " قال رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:" + "\n" + "\n" +
                            " \"ألا أنبئكم بخير أعمالكم " +
                            "و أزكاها عند مليككم و أرفعها في درجاتكم و خير لكم من أنفاق الذهب و الورق" +
                            " و خير لكم من أن تلقوا عدوكم فتضربوا أعناقهم " +
                            "و يضربوا أعناقكم؟" +
                            " \" قالو بلى " + "\n" +
                            " قال : (ذكر الله تعالى)"
            ));

            zekeritemList.add(new AzkarListModel(
                    "و قال رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:" + "\n" +
                            " يقول الله تعالى :" + "\n" + "\n" +
                            " أنا عند ظن عبدي بي ," +
                            " و أنا معه إذا ذكرني , فان ذكرني في نفسه ذكرته في نفسي و ان ذكرني في ملأ ذكرته في ملأ خير منهم ," +
                            " و ان تقرب إلي شبرا تقربت اليه ذراعا و ان تقرب إلى ذراعا تقربت اليه باعا و" +
                            " ان اتاني يمشي أتيته هرولة"
            ));

            zekeritemList.add(new AzkarListModel(

                    " قال رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:" + "\n" + "\n" +
                            " \"ما جلس قوم مجلسا لم يذكروا الله فيه " +
                            ", و لم يصلوا على نبيهم الا كان عليهم ترة فان شاء عذبهم و ان شاء غفر لهم\""
            ));

        }

        //TODO الرُّقية الشرعية
        else if (index == 16) {
            zekeritemList = new ArrayList<>();

            zekeritemList.add(new AzkarListModel(

                    "الرُّقية الشرعية من القرآن الكريم" + "\n" + "\n" +

                            " بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ ﴿1﴾ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ ﴿2﴾ الرَّحْمَنِ الرَّحِيمِ " +
                            "﴿3﴾ مَالِكِ يَوْمِ الدِّينِ ﴿4﴾ إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ ﴿5﴾ اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ " +
                            "﴿6﴾ صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ ﴿7﴾" + "\n" + "\n" +
                            "[الفاتحة: 1-7]"

            ));

            zekeritemList.add(new AzkarListModel(
                    " الم ﴿1﴾ ذَلِكَ الْكِتَابُ لَا رَيْبَ فِيهِ هُدًى لِلْمُتَّقِينَ ﴿2﴾" +
                            " الَّذِينَ يُؤْمِنُونَ بِالْغَيْبِ وَيُقِيمُونَ الصَّلَاةَ وَمِمَّا رَزَقْنَاهُمْ يُنْفِقُونَ ﴿3﴾" +
                            " وَالَّذِينَ يُؤْمِنُونَ بِمَا أُنْزِلَ إِلَيْكَ وَمَا أُنْزِلَ مِنْ قَبْلِكَ وَبِالْآَخِرَةِ هُمْ يُوقِنُونَ ﴿4﴾ " +
                            "أُولَئِكَ عَلَى هُدًى مِنْ رَبِّهِمْ وَأُولَئِكَ هُمُ الْمُفْلِحُونَ ﴿5﴾" + "\n" + "\n" +
                            " [البقرة: 1-5]"
            ));

            zekeritemList.add(new AzkarListModel(
                    " اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِه" +
                            "ِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء" +
                            " وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ" + "\n" + "\n" +
                            "[آية الكرسى - البقرة 255]"
            ));

            zekeritemList.add(new AzkarListModel(

                    " لِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ " +
                            "وَإِنْ تُبْدُوا مَا فِي أَنْفُسِكُمْ أَوْ تُخْفُوهُ يُحَاسِبْكُمْ بِهِ اللَّهُ فَيَغْفِرُ لِمَنْ يَشَاءُ وَيُعَذِّبُ مَنْ يَشَاءُ وَاللَّهُ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ﴿284﴾" +
                            " آَمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ كُلٌّ آَمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ " +
                            "وَقَالُوا سَمِعْنَا وَأَطَعْنَا غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ ﴿285﴾ لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا لَهَا مَا" +
                            " كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا " +
                            "إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ" +
                            " وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا" +
                            " أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ ﴿286﴾" + "\n" + "\n" +
                            " [البقرة: 284-286]"

            ));

            zekeritemList.add(new AzkarListModel(

                    " قُلْ يَا أَيُّهَا الْكَافِرُونَ ﴿1﴾ لَا أَعْبُدُ مَا تَعْبُدُونَ ﴿2﴾ " +
                            "وَلَا أَنْتُمْ عَابِدُونَ مَا أَعْبُدُ ﴿3﴾ وَلَا أَنَا عَابِدٌ مَا عَبَدْتُمْ " +
                            "﴿4﴾ وَلَا أَنْتُمْ عَابِدُونَ مَا أَعْبُدُ ﴿5﴾" +
                            " لَكُمْ دِينُكُمْ وَلِيَ دِينِ ﴿6﴾" + "\n" + "\n" +
                            " [الكافرون]"

            ));

            zekeritemList.add(new AzkarListModel(
                    " قُلْ هُوَ اللَّهُ أَحَدٌ ﴿1﴾ اللَّهُ الصَّمَدُ ﴿2﴾ لَمْ يَلِدْ وَلَمْ يُولَدْ ﴿3﴾ وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ ﴿4﴾" + "\n" + "\n" +
                            " [الإخلاص]"


            ));

            zekeritemList.add(new AzkarListModel(
                    " قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ ﴿1﴾ مِنْ شَرِّ مَا خَلَقَ ﴿2﴾ وَمِنْ شَرِّ غَاسِقٍ إِذَا وَقَبَ ﴿3﴾ " +
                            "وَمِنْ شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ ﴿4﴾" +
                            " وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ ﴿5﴾" + "\n" + "\n" +
                            "[الفلق]"

            ));

            zekeritemList.add(new AzkarListModel(
                    " قُلْ أَعُوذُ بِرَبِّ النَّاسِ ﴿1﴾ مَلِكِ النَّاسِ ﴿2﴾ إِلَهِ النَّاسِ ﴿3﴾ مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ ﴿4﴾" +
                            " الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ ﴿5﴾" +
                            " مِنَ الْجِنَّةِ وَالنَّاسِ ﴿6﴾" + "\n" + "\n" +
                            "[الناس]"));

        }
        else {
            zekeritemList = new ArrayList<>();
            zekeritemList.add(new AzkarListModel("اللَّهُمَّ، اغْفِرْ له وَارْحَمْهُ، وَاعْفُ عنْه وَعَافِهِ، وَأَكْرِمْ نُزُلَهُ،" +
                    " وَوَسِّعْ مُدْخَلَهُ، وَاغْسِلْهُ بمَاءٍ وَثَلْجٍ وَبَرَدٍ" +
                    "، وَنَقِّهِ مِنَ الخَطَايَا كما يُنَقَّى الثَّوْبُ الأبْيَضُ مِنَ الدَّنَسِ، " +
                    "وَأَبْدِلْهُ دَارًا خَيْرًا مِن دَارِهِ،" +
                    " وَأَهْلًا خَيْرًا مِن أَهْلِهِ،" +
                    " وَزَوْجًا خَيْرًا مِن زَوْجِهِ،" +
                    " وَقِهِ فِتْنَةَ القَبْرِ" +
                    " وَعَذَابَ النَّارِ\n"));

            zekeritemList.add(new AzkarListModel("اللَّهمَّ اغْفِرْ لحيِّنا وميِّتِنا وشاهدنا وغائِبنا" +
                    " وصَغيرنا وَكبيرنا وذَكرِنا وأُنثانا اللَّهمَّ مَنْ أحييتَه مِنَّا فأحيِه علَى الإسلام" +
                    "ِ ومن تَوَفَّيتَه مِنَّا فتَوفَّهُ علَى الإيمانِ اللَّهمَّ لا تحرمنا أجرَه ولا تُضلَّنا بعدَه\n"));

            zekeritemList.add(new AzkarListModel("اللَّهمَّ إنَّ فلانَ بنَ فلانٍ في ذِمَّتِك وحبلِ جِوارِك فَقِهِ من فتنةِ القبرِ وعذابِ النَّار" +
                    "ِ وأنتَ أهلُ الوفاءِ" +
                    " والحقِّ فاغفر لَه وارحمه" +
                    "ُ إنَّكَ أنتَ الغفورُ الرَّحيمُ\n"));


            zekeritemList.add(new AzkarListModel("اللهم أنت ربه، وأنت خلقته، وأنت هديته للإسلام، وأنت قبضت روحه، وأنت أعلم بسره وعلانيته، جئنا شفعاء فاغفر له\n" +
                    "\n" + "اللهمّ أبدله داراً خيراً من داره، وأهلاً خيراً من أهله، وأدخله الجنّة، وأعذه من عذاب القبر، ومن عذاب النّار. اللهمّ عامله بما أنت أهله، ولا تعامله بما هو أهله. اللهمّ اجزه عن الإحسان إحساناً، وعن الإساءة عفواً وغفراناً.\n" +
                    "\n"
            ));

            zekeritemList.add(new AzkarListModel("اللهمّ إن كان محسناً فزد من حسناته، وإن كان مسيئاً فتجاوز عن سيّئاته. اللهمّ أدخله الجنّة من غير مناقشة حساب، ولا سابقة عذاب. اللهمّ آنسه في وحدته، وفي وحشته، وفي غربته. اللهمّ أنزله منزلاً مباركاً، وأنت خير المنزلين. اللهمّ أنزله منازل الصدّيقين، والشّهداء، والصّالحين، وحسُن أولئك رفيقاً.\n" +
                    "\n"));

            zekeritemList.add(new AzkarListModel("اللهمّ اجعل قبره روضةً من رياض الجنّة، ولا تجعله حفرةً من حفر النّار. اللهمّ افسح له في قبره مدّ بصره، وافرش قبره من فراش الجنّة. اللهمّ أعذه من عذاب القبر، وجفاف ِالأرض عن جنبيها. اللهمّ املأ قبره بالرّضا، والنّور، والفسحة، والسّرور. اللهمّ إنّه في ذمّتك وحبل جوارك، فقِهِ فتنة القبر، وعذاب النّار، وأنت أهل الوفاء والحقّ، فاغفر له وارحمه، إنّك أنت الغفور الرّحيم.\n" +
                    "\n"));

            zekeritemList.add(new AzkarListModel("اللهمّ إنّه عبدك وابن عبدك، خرج من الدّنيا، وسعتها، ومحبوبها، وأحبّائه فيها، إلى ظلمة القبر، وما هو لاقيه. اللهمّ إنّه كان يشهد أنّك لا إله إلّا أنت، وأنّ محمّداً عبدك ورسولك، وأنت أعلم به. اللهمّ إنّا نتوسّل بك إليك، ونقسم بك عليك أن ترحمه ولا تعذّبه، وأن تثبّته عند السّؤال.\n" +
                    "\n"));

            zekeritemList.add(new AzkarListModel("اللهمّ آته برحمتك ورضاك، وقهِ فتنة القبر وعذابه، وآته برحمتك الأمن من عذابك حتّى تبعثه إلى جنّتك يا أرحم الرّاحمين. اللهمّ انقله من مواطن الدّود، وضيق اللّحود، إلى جنّات الخلود. اللهمّ احمه تحت الأرض، واستره يوم العرض، ولا تخزه يوم يبعثون \"يوم لا ينفع مالٌ ولا بنون إلّا من أتى الله بقلبٍ سليم\".\n" +
                    "\n"));

            zekeritemList.add(new AzkarListModel("اللهمّ أسكنه فسيح الجنان، واغفر له يا رحمن، وارحمه يا رحيم، وتجاوز عمّا تعلم يا عليم. اللهمّ اعف عنه، فإنّك القائل \"ويعفو عن كثير\". اللهمّ إنّه جاء ببابك، وأناخ بجنابك، فَجُد عليه بعفوك، وإكرامك، وجود إحسانك. اللهمّ إنّ رحمتك وسعت كلّ شيء، فارحمه رحمةً تطمئنّ بها نفسه، وتقرّ بها عينه.\n" +
                    "\n"));

            zekeritemList.add(new AzkarListModel("اللهمّ أنزل على أهله الصّبر والسّلوان، وارضهم بقضائك. اللهمّ ثبّتهم على القول الثّابت في الحياة الدّنيا، وفي الآخرة، ويوم يقوم الأشهاد.\n" +
                    "\n" + "اللَّهُمَّ افسح له في قبره مدّ بصره، وافرش قبره من فراش الجنّة. اللهمّ صلّ وسلّم وبارك على سيّدنا محمّد، وعلى آله وصحبه وسلّم إلى يوم الدّين\n"
            ));

        }
        return zekeritemList;
    }

}
